import 'package:favorite_button/favorite_button.dart';
import 'package:flutter/material.dart';
// import 'package:provider/provider.dart';

import 'Homepage.dart';
import 'Provider/favorite_provider.dart';

class amharicsearch extends StatefulWidget {
  const amharicsearch({Key? key}) : super(key: key);

  @override
  State<amharicsearch> createState() => _amharicsearchState();
}

class _amharicsearchState extends State<amharicsearch> {
  final List<Map<String, dynamic>> _allWords = [
    {'id': 1, 'ትርጉም': 'ማጥባት', 'name': 'Qarsa', 'ንባብ': 'ዓርሳ'},
    {
      'id': 2,
      'ትርጉም': 'እውቅት',
      'name': 'ixxiga                                               ንባብ: እድድጋ',
    },
    {
      'id': 3,
      'ትርጉም': 'ትምህርት ቤት',
      'name': 'Baritto buxa',
      'ንባብ': 'በረትቶበ ቡራ',
    },
    {
      'id': 4,
      'ትርጉም': 'የ መጀመሪያ ደረጃ ትምህርት ቤት',
      'name':
          'Qimbo barittoh buxa                                                ንባብ: ኢምቢቦ በረትቶህ ቡራ',
    },
    {
      'id': 5,
      'ትርጉም': 'ሁለተኛ ደረጃ ትምህርት ቤት',
      'name':
          '2haytoh caddoh b.buxa                                             ንባብ: ነምቦብ በረትቶህ ሃድዲህ በርትቶህ ቡራ ',
    },
    {
      'id': 6,
      'ትርጉም': 'ኮሌጅ',
      'name':
          'kulliyata                                               ንባብ: ኩልሊይታ',
    },
    {
      'id': 7,
      'ትርጉም': 'እስፔሻላዜሽን',
      'name':
          'Cagalu                                                                           ንባብ: ሃገሉ',
    },
    {
      'id': 8,
      'ትርጉም': 'ምረቃ',
      'name':
          'Duqayso                                                                      ንባብ: ዱዓይሶ',
    },
    {
      'id': 9,
      'ትርጉም': 'መምህር',
      'name':
          'Kabiiri                                                                       ንባብ: ከቢሪ',
    },
    {
      'id': 10,
      'ትርጉም': 'አስተማሪ',
      'name':
          'Barseena                                                                     ንባብ: በርሴና',
    },
    {
      'id': 11,
      'ትርጉም': 'ተማሪ/1ኛ ደረጃ/',
      'name': 'Darsaytu      ንባብ: ደርሰይቱ',
    },
    {
      'id': 12,
      'ትርጉም': 'ተማሪ/2ኛ ደረጃ/',
      'name': 'Barteena       ንባብ: በርቴና',
    },
    {
      'id': 13,
      'ትርጉም': 'ፈተና',
      'name': 'Aqayyaare             ንባብ: አዓይያሬ',
    },
    {
      'id': 14,
      'ትርጉም': 'ሙከራ',
      'name': 'Aqakkaane          ንባብ: አዐክካኔ',
    },
    {
      'id': 15,
      'ትርጉም': 'ማለፍ/ፈተና/',
      'name': 'Aslugiyaa           ንባብ: አዐክካኔ',
    },
    {
      'id': 16,
      'ትርጉም': 'መውደቅ',
      'name': 'Elleliya           ንባብ: ኤልሌሊይያ',
    },
    {
      'id': 17,
      'ትርጉም': 'መጽሃፍ',
      'name': 'Kitaaba            ንባብ: ኪታባ',
    },
    {
      'id': 18,
      'ትርጉም': 'ጥቁር ሰሌዳ',
      'name': 'Data luucu                ንባብ: ደታ ሉሁ',
    },
    {
      'id': 19,
      'ትርጉም': 'ማስመሪያ',
      'name': 'Diiliseena               ንባብ: ዲሊሴና',
    },
    {
      'id': 20,
      'ትርጉም': 'እርሳስ',
      'name': 'Bilsime                  ንባብ: ቢልሲሜ',
    },
    {
      'id': 21,
      'ትርጉም': 'ላጲስ',
      'name': 'Duugeena               ንባብ: ዱጌና',
    },
    {
      'id': 22,
      'ትርጉም': 'መቅረጫ',
      'name': 'Saniseyna                   ንባብ: ሳኒሰይና',
    },
    {
      'id': 23,
      'ትርጉም': 'ቾክ',
      'name': 'Barda                      ንባብ: በርዳ',
    },
    {
      'id': 24,
      'ትርጉም': 'ንባብ',
      'name': 'Kiryaati                      ንባብ: ኪርያቲ	',
    },
    {
      'id': 25,
      'ትርጉም': 'ጽሁፍ',
      'name': 'Kutbe                            ንባብ: ኩትቤ',
    },
    {
      'id': 26,
      'ትርጉም': 'ትምህርት',
      'name': 'Qasiiri                           ንባብ: ዐሲሪ',
    },
    {
      'id': 27,
      'ትርጉም': 'ጥናት/ማጥናት',
      'name': 'Mutalaqa                          ንባብ: ሙታለዓ	',
    },
    {
      'id': 28,
      'ትርጉም': 'ክፍለ ትምህርት',
      'name': 'Fella/Darsi                   ንባብ: ፌልላ/ደርሲ',
    },
    {
      'id': 29,
      'ትርጉም': 'አባባል',
      'name': 'Maxca                              ንባብ: መድሃ ',
    },
    {
      'id': 30,
      'ትርጉም': 'ጥቅስ',
      'name': 'Maaqiita                            ንባብ: ማኢታ ',
    },
    {
      'id': 31,
      'ትርጉም': 'ጥቅስ',
      'name': 'Esseri                               ንባብ: ማኢታ',
    },
    {
      'id': 32,
      'ትርጉም': 'መልስ',
      'name': 'Aydobba      ንባብ: አይዶብባ',
    },
    {
      'id': 33,
      'ትርጉም': 'ደብተር',
      'name': 'Daftara      ንባብ: ደፍተራ',
    },
    {
      'id': 34,
      'ትርጉም': 'እስክርቢቶ',
      'name': 'Kalama        ንባብ: ከላማ ',
    },
    {
      'id': 35,
      'ትርጉም': 'ስህተት',
      'name': 'Aylalokka    ንባብ: አይላሎክ',
    },
    {
      'id': 36,
      'ትርጉም': 'መሳት',
      'name': 'Gittoyso       ንባብ: ጊትቶይሶ',
    },
    {
      'id': 37,
      'ትርጉም': 'እርማት',
      'name': 'Gita                 ንባብ: ጊታ',
    },
    {
      'id': 38,
      'ትርጉም': 'መኮረጅ',
      'name': 'Garqiino Korsa          ንባብ:  ገርዒኖ ኮርሳ',
    },
    {
      'id': 39,
      'ትርጉም': 'መተርጎም',
      'name': 'Maqinisso   ንባብ: መዕኒስሶ',
    },
    {
      'id': 40,
      'ትርጉም': 'መኮረጅ',
      'name': 'Ellebarito              ንባብ: ኤልሌበረትቶ',
    },
    {
      'id': 41,
      'ትርጉም': 'ሽልማት',
      'name': 'kaado          ንባብ: ከዶ',
    },
    {
      'id': 42,
      'ትርጉም': 'ቅጣት',
      'name': 'Digala             ንባብ: ዲጋላ',
    },
    {
      'id': 43,
      'ትርጉም': 'እረፍት',
      'name': 'Ramaqqa/Oftoyu             ንባብ: ረማዕዓ/ኦፍቶዩ ',
    },
    {
      'id': 44,
      'ትርጉም': 'መዝናናት',
      'name': 'Hallaala                 ንባብ:  ሃልላላ',
    },
    {
      'id': 45,
      'ትርጉም': 'የቃል ጽሁፍ',
      'name': 'Abbuukfirsa            ንባብ: አብቡክፍርሳ ',
    },
    {
      'id': 46,
      'ትርጉም': 'ድርሰት',
      'name': 'Fedella               ንባብ: ፍዲልላ',
    },
    {
      'id': 47,
      'ትርጉም': 'ነጥብ',
      'name': 'Muura           ንባብ: ሙራ',
    },
    {
      'id': 48,
      'ትርጉም': 'ትርጉም',
      'name': 'Aftigacasa             ንባብ: አፍቲገህጎ',
    },
    {
      'id': 49,
      'ትርጉም': 'ውድድር',
      'name': 'Qalayli                 ንባብ: አላይሊ',
    },
    {
      'id': 50,
      'ትርጉም': 'ፍክክር',
      'name': 'Anaakara                   ንባብ: አናከራ',
    },
    {
      'id': 51,
      'ትርጉም': 'ከውሴንታ',
      'name': 'Kawsenta               ንባብ: ከውሴንታ',
    },
    {
      'id': 52,
      'ትርጉም': 'ምንባብ',
      'name': 'Mincat                ንባብ: ሚኒሐታ ',
    },
    {
      'id': 53,
      'ትርጉም': 'ስርዓተ ትምህርት',
      'name': 'Baritto sirra       ንባብ: በረትቶስ ሲራ',
    },
    {
      'id': 54,
      'ትርጉም': 'ደውል',
      'name': 'Baddonta       ንባብ: ባዶንታ ',
    },
    {
      'id': 55,
      'ትርጉም': 'ሰልፍ',
      'name': 'Rooru            ንባብ:  ሮሩ',
    },
    {
      'id': 56,
      'ትርጉም': 'ሰርተፍኬት',
      'name': 'Sumaqta         ንባብ: ሱመዕታ ',
    },
    {
      'id': 57,
      'ትርጉም': 'ቁጥጥር',
      'name': 'Loynisso          ንባብ: ሎይኒሲሶ',
    },
    {
      'id': 58,
      'ትርጉም': 'ክለሳ',
      'name': 'Amo-wagiti            ንባብ: አሞው ወጊቲ',
    },
    {
      'id': 59,
      'ትርጉም': 'የሰንደቃ አላማ መዝሙር',
      'name': 'Bandiira saare             ንባብ: በንዲራ ሳሬ',
    },
    {
      'id': 60,
      'ትርጉም': 'ጨዋታ',
      'name': 'Digiiri                  ንባብ: ዲገር',
    },
    {
      'id': 61,
      'ትርጉም': 'ስፖርት',
      'name': 'Xagardig                ንባብ: ደገርዲግ',
    },
    {
      'id': 62,
      'ትርጉም': 'ራስ/ጸጉር',
      'name': 'Amo               ንባብ: ኦሞ',
    },
    {
      'id': 63,
      'ትርጉም': 'ጭንቅላት',
      'name': 'Moyya            ንባብ: ሞይያ',
    },
    {
      'id': 64,
      'ትርጉም': 'ሞኒተር',
      'name': 'Moniitar              ንባብ: ሞኒተር',
    },
    {
      'id': 65,
      'ትርጉም': 'አእምሮ/አንጎል',
      'name': 'Missinkica                ንባብ:  ሚሲንኪሃ ',
    },
    {
      'id': 66,
      'ትርጉም': 'የራስ ቅል',
      'name': 'Cangal-xala              ንባብ: ሃንገል ዳላ',
    },
    {
      'id': 67,
      'ትርጉም': 'ጸጉር',
      'name': 'Xagooru                 ንባብ: ዳጉሩ',
    },
    {
      'id': 68,
      'ትርጉም': 'ክለሳ',
      'name': 'Qairgacsa              ንባብ: አሲርገህሳ',
    },
    {
      'id': 69,
      'ትርጉም': 'ፊት',
      'name': 'Fooca                       ንባብ: ፎሃ',
    },
    {
      'id': 70,
      'ትርጉም': 'ዓይን',
      'name': 'Inti               ንባብ: ኢንቲ',
    },
    {
      'id': 71,
      'ትርጉም': 'ቅንድብ',
      'name': 'Minini                 ንባብ: ሚኒኒ',
    },
    {
      'id': 72,
      'ትርጉም': 'አፍንጫ',
      'name': 'Sana                  ንባብ: ሰና',
    },
    {
      'id': 73,
      'ትርጉም': 'ጆሮ',
      'name': 'Ayti                   ንባብ: አይቲ',
    },
    {
      'id': 74,
      'ትርጉም': 'አፍ',
      'name': 'afa                ንባብ: አፍ',
    },
    {
      'id': 75,
      'ትርጉም': 'ምላስ',
      'name': 'Arraba          ንባብ: አርራባ',
    },
    {
      'id': 76,
      'ትርጉም': 'ጥርስ',
      'name': 'Moddina              ንባብ: ሞድዲና',
    },
    {
      'id': 77,
      'ትርጉም': 'ከንፈር',
      'name': 'Sokto                 ንባብ: ሳክቶ ',
    },
    {
      'id': 78,
      'ትርጉም': 'አገጭ',
      'name': 'Debeni            ንባብ: ዴቤን',
    },
    {
      'id': 79,
      'ትርጉም': 'ጺም',
      'name': 'Raadida             ንባብ: ራዲድዳ',
    },
    {
      'id': 80,
      'ትርጉም': 'ጣት',
      'name': 'Feera              ንባብ: ፌራ',
    },
    {
      'id': 81,
      'ትርጉም': 'አንገት',
      'name': 'Qunti             ንባብ:  ንቲ',
    },
    {
      'id': 82,
      'ትርጉም': 'ትከሻ',
      'name': 'Labka           ንባብ: ላብካ ',
    },
    {
      'id': 83,
      'ትርጉም': 'ክንድ',
      'name': 'Caraya           ንባብ: ሃራያ ',
    },
    {
      'id': 84,
      'ትርጉም': 'እጅ',
      'name': 'Gaba             ንባብ: ገባ',
    },
    {
      'id': 85,
      'ትርጉም': 'ክርን',
      'name': 'Mogoyu           ንባብ: ሞጉዮ ',
    },
    {
      'id': 86,
      'ትርጉም': 'ጥፍር',
      'name': 'Lifiqi             ንባብ: ሊፊኢ',
    },
    {
      'id': 87,
      'ትርጉም': 'መልስ',
      'name': 'Fiiqi            ንባብ: ፊኢ ',
    },
    {
      'id': 88,
      'ትርጉም': 'ደረት',
      'name': 'Aliili            ንባብ: አሊሊ',
    },
    {
      'id': 89,
      'ትርጉም': 'ሆድ',
      'name': 'Bagu            ንባብ: በጉ',
    },
    {
      'id': 90,
      'ትርጉም': 'ጀርባ',
      'name': 'Seeccaya            ንባብ: ሴህያ ',
    },
    {
      'id': 91,
      'ትርጉም': 'እግር',
      'name': 'Iba            ንባብ: ኢባ',
    },
    {
      'id': 92,
      'ትርጉም': 'ባት',
      'name': 'sarba             ንባብ: ሰርባ',
    },
    {
      'id': 93,
      'ትርጉም': 'ዳሌ',
      'name': 'Xoggale           ንባብ: ዶግገሌ',
    },
    {
      'id': 94,
      'ትርጉም': 'ጭን',
      'name': 'xiiqare               ንባብ: ዲኢሬ',
    },
    {
      'id': 95,
      'ትርጉም': 'መቀመጫ',
      'name': 'Kamuusa     ንባብ: ከሙሱ',
    },
    {
      'id': 96,
      'ትርጉም': 'የወንድ ብልት',
      'name': 'Labna          ንባብ: ለብና',
    },
    {
      'id': 97,
      'ትርጉም': 'መቀመጫ',
      'name': 'Gamada           ንባብ: ገመዳ',
    },
    {
      'id': 98,
      'ትርጉም': 'የሴት ብልት',
      'name': 'Sayna              ንባብ: ሳይና',
    },
    {
      'id': 99,
      'ትርጉም': 'ብብት',
      'name': 'Xabqe             ንባብ: ደብኤ',
    },
    {
      'id': 100,
      'ትርጉም': 'የዓይን ሺፍሽፍት',
      'name': 'Danbara               ንባብ: ደንበራ',
    },
    {
      'id': 101,
      'ትርጉም': 'ሽንጥ',
      'name': 'mayxaya              ንባብ: ማይዴያ',
    },
    {
      'id': 102,
      'ትርጉም': 'ቅልጥም',
      'name': 'Mayinto         ንባብ: መዬንቶ',
    },
    {
      'id': 103,
      'ትርጉም': 'የእግር ወርች',
      'name': 'dadaba             ንባብ: ደደባ ',
    },
    {
      'id': 104,
      'ትርጉም': 'አንገት',
      'name': 'Filla            ንባብ: ፊልላ',
    },
    {
      'id': 105,
      'ትርጉም': 'ውስጥ እግር',
      'name': 'Addaqasa                ንባብ: አድዳዓሳ',
    },
    {
      'id': 106,
      'ትርጉም': 'መዳፍ',
      'name': 'gennqata              ንባብ: ጌንናዕታ',
    },
    {
      'id': 107,
      'ትርጉም': 'ደም',
      'name': 'Qabala               ንባብ: አባላ',
    },
    {
      'id': 108,
      'ትርጉም': 'ቆዳ',
      'name': 'Araba                   ንባብ: አረባ',
    },
    {
      'id': 109,
      'ትርጉም': 'አጥንት',
      'name': 'Lafa             ንባብ: ለፋ',
    },
    {
      'id': 110,
      'ትርጉም': 'ኩክ',
      'name': 'Ayti qokka            ንባብ: አይቲዕ ዖክካ',
    },
    {
      'id': 111,
      'ትርጉም': 'እምባ',
      'name': 'inti ximo           ንባብ: ኢንቲድ ዲሞ',
    },
    {
      'id': 112,
      'ትርጉም': 'ሰገራ',
      'name': 'Bagi daaco         ንባብ: በጊ ዶሃ',
    },
    {
      'id': 113,
      'ትርጉም': 'ንፍጥ',
      'name': 'Santi Surraaqa             ንባብ: ሳንቲ ሱርራዓ',
    },
    {
      'id': 114,
      'ትርጉም': 'አክታ',
      'name': 'Afti caaka          ንባብ: አፍቲ ሃአካ',
    },
    {
      'id': 115,
      'ትርጉም': 'ሽንት',
      'name': 'Sammo daaco           ንባብ: ሰምሞ ዳሆ',
    },
    {
      'id': 116,
      'ትርጉም': 'ልብ',
      'name': 'Afqado/Lubbi          ንባብ: አፍዓዶ/ሉብቢ',
    },
    {
      'id': 117,
      'ትርጉም': 'እምብርት',
      'name': 'Cunudubu               ንባብ: ሁንዱቡ',
    },
    {
      'id': 118,
      'ትርጉም': 'ደም ስር',
      'name': 'Ramada                     ንባብ: ረመዳ',
    },
    {
      'id': 119,
      'ትርጉም': 'ጉበት',
      'name': 'Tiro             ንባብ: ትሮ',
    },
    {
      'id': 120,
      'ትርጉም': 'ሃሞት ከረጢት',
      'name': 'xactusso              ንባብ: ዳህቱስሶ',
    },
    {
      'id': 121,
      'ትርጉም': 'አንጀት',
      'name': 'Ulqi              ንባብ: ኡልኢ',
    },
    {
      'id': 122,
      'ትርጉም': 'ጡት',
      'name': 'Angu               ንባብ: አንጉ ',
    },
    {
      'id': 123,
      'ትርጉም': 'ዓጽም',
      'name': 'Gogooni         ንባብ: ጎጎኒ',
    },
    {
      'id': 124,
      'ትርጉም': 'ጡንቻ',
      'name': 'Tobdo             ንባብ: ቶብዶ',
    },
    {
      'id': 125,
      'ትርጉም': 'ቁርጭምጭሚት',
      'name': 'Xukuunto/Kulcunto             ንባብ: ዶክሁንቶ/ኩልህንቶ/',
    },
    {
      'id': 126,
      'ትርጉም': 'ቤተሰብ',
      'name': 'Daala                       ንባብ: ዳላ',
    },
    {
      'id': 127,
      'ትርጉም': 'ቅርስ ቤተሰብ',
      'name': 'Buxa mara                  ንባብ: ቡራም መራ',
    },
    {
      'id': 128,
      'ትርጉም': 'አባት',
      'name': 'Abba                 ንባብ: አብባ',
    },
    {
      'id': 129,
      'ትርጉም': 'እናት',
      'name': 'Ina                 ንባብ: ኢና',
    },
    {
      'id': 130,
      'ትርጉም': 'ሴት አያት',
      'name': 'Aboyya                ንባብ: አብይያ',
    },
    {
      'id': 131,
      'ትርጉም': 'ሴት ልጅ',
      'name': 'Baxa              ንባብ: በራእ',
    },
    {
      'id': 132,
      'ትርጉም': 'ወንድም',
      'name': 'Tobokoyta                ንባብ: ቶቦኮይታ ',
    },
    {
      'id': 133,
      'ትርጉም': 'ወንድ አያት',
      'name': 'KAxxaaba             ንባብ: ከድዳብባ',
    },
    {
      'id': 134,
      'ትርጉም': 'አጎት/ከ አባት በኩል',
      'name': 'Qammi                  ንባብ: አምሚ ',
    },
    {
      'id': 135,
      'ትርጉም': 'ሴት አያት',
      'name': 'Aboyya                  ንባብ: አብይያ ',
    },
    {
      'id': 136,
      'ትርጉም': 'ሴት ልጅ',
      'name': 'Baxa                   ንባብ: በራእ',
    },
    {
      'id': 137,
      'ትርጉም': 'አጎት/ከእናት በኩል',
      'name': 'Abu              ንባብ: አቡ ',
    },
    {
      'id': 138,
      'ትርጉም': 'አክስት',
      'name': 'Anna           ንባብ: አንና',
    },
    {
      'id': 139,
      'ትርጉም': 'አክስት',
      'name': 'Absuma                ንባብ: አብሱማ',
    },
    {
      'id': 140,
      'ትርጉም': 'ባል',
      'name': 'Baqala               ንባብ: በዕላ',
    },
    {
      'id': 141,
      'ትርጉም': 'ባል',
      'name': 'Barra            ንባብ:  በርራ',
    },
    {
      'id': 142,
      'ትርጉም': 'አማች',
      'name': 'Ballu            ንባብ:  በልሉ ',
    },
    {
      'id': 143,
      'ትርጉም': 'የጡት ልጅ',
      'name': 'Ballo              ንባብ:  በልሎ ',
    },
    {
      'id': 144,
      'ትርጉም': 'ጉዲፈቻ',
      'name': 'Arqo baxa               ንባብ:  አርኦ በራ ',
    },
    {
      'id': 145,
      'ትርጉም': 'የእንጀራ ልጅ',
      'name': 'baqli baxa           ንባብ:  በዕሊ በራ',
    },
    {
      'id': 146,
      'ትርጉም': 'የእህት ባል',
      'name': 'Dama              ንባብ:  ደማ',
    },
    {
      'id': 147,
      'ትርጉም': 'የእህትማማች ባሎች',
      'name': 'canno           ንባብ: ሃንኖ',
    },
    {
      'id': 148,
      'ትርጉም': 'የእህትማማች ባሎች',
      'name': 'lamayna           ንባብ:  ለመይና',
    },
    {
      'id': 149,
      'ትርጉም': 'የጡት ልጅ',
      'name': 'Qarseena                ንባብ:  አርሴና',
    },
    {
      'id': 150,
      'ትርጉም': 'መስማት',
      'name': 'maababa                ንባብ:  መብባ',
    },
    {
      'id': 151,
      'ትርጉም': 'ማየት',
      'name': 'Mabla                        ንባብ:  ማብላ',
    },
    {
      'id': 152,
      'ትርጉም': 'ጀልባ',
      'name': 'Doniki                 ንባብ:  ዶይኒኪ',
    },
    {
      'id': 153,
      'ትርጉም': 'መቅመስ',
      'name': 'Tamu                       ንባብ:  ተሙ',
    },
    {
      'id': 154,
      'ትርጉም': 'በስነ ስርአት ማሳደግ',
      'name': 'Adbiysiyyo                   ንባብ:  አድቢሲይዬ ',
    },
    {
      'id': 155,
      'ትርጉም': 'ትራንስፖርት',
      'name': 'Wadba                       ንባብ:  ወድባ',
    },
    {
      'id': 156,
      'ትርጉም': 'መገናኛ',
      'name': 'Angaararwa                   ንባብ:  አንጋሪዋ',
    },
    {
      'id': 157,
      'ትርጉም': 'አውራ ጎዳና /የአርሆ መንገድ',
      'name': 'arho gita                 ንባብ:  አርህጎ ጊታ',
    },
    {
      'id': 158,
      'ትርጉም': 'መኪና',
      'name': 'Makiina               ንባብ:  መኪና',
    },
    {
      'id': 159,
      'ትርጉም': 'ጭነት/ቤት',
      'name': 'Qari          ንባብ:  አሪ',
    },
    {
      'id': 160,
      'ትርጉም': 'አየር ማረፊያ',
      'name': 'Tayyara  boxxa             ንባብ:  ተይያራ በራ',
    },
    {
      'id': 161,
      'ትርጉም': 'ተሳቢ',
      'name': 'wilqeena                ንባብ:   ዊልዔና',
    },
    {
      'id': 162,
      'ትርጉም': 'አየር ማረፊያ',
      'name': 'Tayyara  boxxa                ንባብ:  ተይያራ በራ',
    },
    {
      'id': 163,
      'ትርጉም': 'አውቶቢስ',
      'name': 'Attabusu              ንባብ:  አትተቡሱ',
    },
    {
      'id': 164,
      'ትርጉም': 'አውሮፕላን',
      'name': 'Tayyyara                     ንባብ:  ተይያራ',
    },
    {
      'id': 165,
      'ትርጉም': 'ባቡር',
      'name': 'Baaburu                       ንባብ:  ባቡሩ',
    },
    {
      'id': 166,
      'ትርጉም': 'ባቡር ሐዲድ',
      'name': 'Baaburu horda                  ንባብ:  ባቡሩ ሆርዳ',
    },
    {
      'id': 167,
      'ትርጉም': 'መርካባ',
      'name': 'Markaba                  ንባብ:  መርከባ',
    },
    {
      'id': 168,
      'ትርጉም': 'ወደብ/port/',
      'name': 'Furda                   ንባብ:  ፋርዳ',
    },
    {
      'id': 169,
      'ትርጉም': 'ወደብ/harbor/',
      'name': 'Marso                  ንባብ:  መርሶ',
    },
    {
      'id': 170,
      'ትርጉም': 'መጫኛ',
      'name': 'Meeraytu                ንባብ:  ሜርራይቶ',
    },
    {
      'id': 171,
      'ትርጉም': 'ፖስታ',
      'name': 'Farmo siba/Zarfi                ንባብ:  ፈርሞስ ሲባ/ዛርፊ',
    },
    {
      'id': 172,
      'ትርጉም': 'ደብዳቤ',
      'name': 'Farmoh ayyufta            ንባብ:  ፈርሞህ አይዮፍታ',
    },
    {
      'id': 173,
      'ትርጉም': 'ስልክ',
      'name': 'Telefoonu                   ንባብ:  ቴሌፎኑ',
    },
    {
      'id': 174,
      'ትርጉም': 'ቴሌግራፍ',
      'name': 'Telegraafa               ንባብ:  ቴሌግራፋ',
    },
    {
      'id': 175,
      'ትርጉም': 'ቴሌክስ',
      'name': 'Teleksi           ንባብ: ቴሌክሲ',
    },
    {
      'id': 176,
      'ትርጉም': 'ጉዞ',
      'name': 'Safara       ንባብ:  ሰፈራ',
    },
    {
      'id': 177,
      'ትርጉም': 'ኮምፒዩተር',
      'name': 'Kompuyuteri         ንባብ:  ኮምፒዩቴሪ',
    },
    {
      'id': 178,
      'ትርጉም': 'መመለስ',
      'name': 'Madaara                 ንባብ: መዳራ',
    },
    {
      'id': 179,
      'ትርጉም': 'ሹፌር',
      'name': 'Shufeeri              ንባብ: ሹፌሪ',
    },
    {
      'id': 180,
      'ትርጉም': 'ፓይለት',
      'name': 'Haadise/Payleeti            ንባብ: ሃዲሲ/ፐይሌቲ',
    },
    {
      'id': 181,
      'ትርጉም': 'የመርከብ ካፕቴን',
      'name': 'Naakuda              ንባብ: ናኩዳ',
    },
    {
      'id': 182,
      'ትርጉም': 'ባህረኛ',
      'name': 'Bacriyaytu            ንባብ: በህሪያይቱ',
    },
    {
      'id': 183,
      'ትርጉም': 'ትኬት',
      'name': 'TIkeeti               ንባብ: ትኬቱ',
    },
    {
      'id': 184,
      'ትርጉም': 'ጉዞ',
      'name': 'Gexo            ንባብ: ጌሮ',
    },
    {
      'id': 185,
      'ትርጉም': 'መቀዳደም',
      'name': 'Ossokooko moyta      ንባብ: ኦስሶ ኮኮሞይታ',
    },
    {
      'id': 186,
      'ትርጉም': 'ቱሪዝም',
      'name': 'Wacaysiri         ንባብ: ወሃይሲሪ',
    },
    {
      'id': 187,
      'ትርጉም': 'ቱሪስት/ቱሪስቶች',
      'name': 'Wacaysire/a                  ንባብ: ወሃሰይሬ/ራ',
    },
    {
      'id': 188,
      'ትርጉም': 'ሆቴል',
      'name': 'Hoteeli                 ንባብ: ሆቴላ',
    },
    {
      'id': 189,
      'ትርጉም': 'ጉብኝት',
      'name': 'Gufne/Ziyaara               ንባብ: ጉፍኔ',
    },
    {
      'id': 190,
      'ትርጉም': 'እንግዳ',
      'name': 'Qibnaytu             ንባብ: ዒብናይቱ',
    },
    {
      'id': 191,
      'ትርጉም': 'ማረፊያ',
      'name': 'Goqonta             ንባብ: ጎዖንታ',
    },
    {
      'id': 192,
      'ትርጉም': 'ፓስፖርት',
      'name': 'Pazaporti                ንባብ: ፓዝፖርቲ',
    },
    {
      'id': 193,
      'ትርጉም': 'የይለፍ ምልክት',
      'name': 'tatur asta             ንባብ: ታቱር አስታ',
    },
    {
      'id': 194,
      'ትርጉም': 'ሁልማ',
      'name': 'culma             ንባብ: ሁልማ',
    },
    {
      'id': 195,
      'ትርጉም': 'ሁልማ',
      'name': 'insipid                ንባብ: ሁልማ',
    },
    {
      'id': 196,
      'ትርጉም': 'ኤልሌሱጋህ ኢካማ',
      'name': 'Ellesugah ikaama           ንባብ: ኤልሌሱጋሃ ኢካማ',
    },
    {
      'id': 197,
      'ትርጉም': 'ቅርስ',
      'name': 'Daaran         ንባብ: ዳራን',
    },
    {
      'id': 198,
      'ትርጉም': 'ሁልማ',
      'name': 'intermediary            ንባብ: ሁልማ',
    },
    {
      'id': 199,
      'ትርጉም': 'ሙዝየም',
      'name': 'Diyaaran             ንባብ: ዲያራን',
    },
    {
      'id': 200,
      'ትርጉም': 'ሲኒማ',
      'name': 'Siinima            ንባብ: ሲኒማ',
    },
    {
      'id': 201,
      'ትርጉም': 'ፓርክ',
      'name': 'parki             ንባብ: ፓርኪ',
    },
    {
      'id': 202,
      'ትርጉም': 'ክልክል',
      'name': 'Kalaata          ንባብ: ከላታ',
    },
    {
      'id': 203,
      'ትርጉም': 'ፈቃድ',
      'name': 'idini            ንባብ: ኢዲኒ',
    },
    {
      'id': 204,
      'ትርጉም': 'አለመቀበል',
      'name': 'Cina                     ንባብ: ሒና',
    },
    {
      'id': 205,
      'ትርጉም': 'አገልግሎት',
      'name': 'Ayfaafaya             ንባብ: አይፍፍያ',
    },
    {
      'id': 206,
      'ትርጉም': 'ፕሮጀክት',
      'name': 'Cugayyo                         ንባብ: ሁጋይዬ',
    },
    {
      'id': 207,
      'ትርጉም': 'ጎረቤት',
      'name': 'cuggaane               ንባብ: ሁግጋኔ',
    },
    {
      'id': 208,
      'ትርጉም': 'አካባቢ',
      'name': 'Deraafi                     ንባብ: ድራፊ',
    },
    {
      'id': 209,
      'ትርጉም': 'ዲንበር',
      'name': 'Caydu            ንባብ: ሃይዱ',
    },
    {
      'id': 210,
      'ትርጉም': 'ኑዛዜ',
      'name': 'farrimtu           ንባብ: ፋርረሚቱ',
    },
    {
      'id': 211,
      'ትርጉም': 'ቪዛ',
      'name': 'viiza          ንባብ: ቪዛ',
    },
    {
      'id': 212,
      'ትርጉም': 'የጉዞ ወኪል',
      'name': 'safar mixxaageyna          ንባብ: ሰፈር ሚድዳጌይና',
    },
    {
      'id': 213,
      'ትርጉም': 'እቃ',
      'name': 'uwwa              ንባብ: ኡውዋ',
    },
    {
      'id': 214,
      'ትርጉም': 'የእጅ ባትሪ',
      'name': 'Gaba tirik           ንባብ: ገባት ቲሪክ',
    },
    {
      'id': 215,
      'ትርጉም': 'እቃ',
      'name': 'Aflitia             ንባብ: አፍሊታ',
    },
    {
      'id': 216,
      'ትርጉም': 'ጃንጥላ',
      'name': 'Shanta              ንባብ: ሽንታ',
    },
    {
      'id': 217,
      'ትርጉም': 'የመንገድ ካርታ',
      'name': 'Giti karta          ንባብ: ጊታ ካርታ',
    },
    {
      'id': 218,
      'ትርጉም': 'ቤት',
      'name': 'Buxa/qari          ንባብ: ቡራ፣ዓሪ',
    },
    {
      'id': 219,
      'ትርጉም': 'መኖሪያ ቤት',
      'name': 'Sigo buxa           ንባብ: ሲጎ ቡራ',
    },
    {
      'id': 220,
      'ትርጉም': 'ንግድ ቤት',
      'name': 'kabxa buxa              ንባብ: ካብራ ቡራ',
    },
    {
      'id': 221,
      'ትርጉም': 'ክፍል',
      'name': 'Goli                     ንባብ: ጎሊ',
    },
    {
      'id': 222,
      'ትርጉም': 'የንግድ ክፍል',
      'name': 'qibni goli               ንባብ: ኢበኒ ጎሊ',
    },
    {
      'id': 223,
      'ትርጉም': 'መኝታ ክፍል',
      'name': 'xintima goli            ንባብ: ዲንቲማ ጎሊ',
    },
    {
      'id': 224,
      'ትርጉም': 'ማዕድ ቤት',
      'name': 'Gira dabu               ንባብ: ጊራ ዳቡ',
    },
    {
      'id': 225,
      'ትርጉም': 'ሽንት ቤት',
      'name': 'kadco dabu            ንባብ: ካድሆ ዳቡ',
    },
    {
      'id': 226,
      'ትርጉም': 'ወለል',
      'name': 'Baaxa             ንባብ: ባኣራ',
    },
    {
      'id': 227,
      'ትርጉም': 'እቃ',
      'name': 'mundane           ንባብ: ገባት ቲሪክ',
    },
    {
      'id': 228,
      'ትርጉም': 'ጣራ',
      'name': 'munificent                      ንባብ: ታርማን',
    },
    {
      'id': 229,
      'ትርጉም': 'ጓዳ',
      'name': 'Guna                            ንባብ: ጎና',
    },
    {
      'id': 230,
      'ትርጉም': 'ሳር ቤት',
      'name': 'Dassa                ንባብ: ዳስ',
    },
    {
      'id': 231,
      'ትርጉም': 'ግንብ ቤት',
      'name': 'Kalqata                              ንባብ: ከልዓታ',
    },
    {
      'id': 232,
      'ትርጉም': 'አዳራሽ',
      'name': 'handaga                               ንባብ: ሃንዳጋ',
    },
    {
      'id': 233,
      'ትርጉም': 'በር',
      'name': 'Alfenta/baaba                   ንባብ: አልፈንታ/ባባ',
    },
    {
      'id': 234,
      'ትርጉም': 'መስኮት',
      'name': 'Taagata                         ንባብ: ታጋታ',
    },
    {
      'id': 235,
      'ትርጉም': 'ጠረጴዛ',
      'name': 'Miizi                       ንባብ: ሚዝ',
    },
    {
      'id': 236,
      'ትርጉም': 'ወንበር',
      'name': 'Kursi                       ንባብ: ኩርሲ',
    },
    {
      'id': 237,
      'ትርጉም': 'ቁም ሳጥን',
      'name': 'Doolaaba                           ንባብ: ዶኦላባ',
    },
    {
      'id': 238,
      'ትርጉም': 'አልጋ',
      'name': 'Qarkayto                          ንባብ: ዓርከይቶ',
    },
    {
      'id': 239,
      'ትርጉም': 'ምግብ',
      'name': 'Maaqo                                  ንባብ: ማኦ',
    },
    {
      'id': 240,
      'ትርጉም': 'ውሃ',
      'name': 'Lee                                     ንባብ: ሌይ',
    },
    {
      'id': 241,
      'ትርጉም': 'ወተት',
      'name': 'Cana                          ንባብ: ሃና',
    },
    {
      'id': 242,
      'ትርጉም': 'ስጋ',
      'name': 'Cado                        ንባብ: ሃዶ',
    },
    {
      'id': 243,
      'ትርጉም': 'ዳቦ',
      'name': 'Goqammo/Goggo                             ንባብ: ጋዓምሞ/ጎግጎ',
    },
    {
      'id': 244,
      'ትርጉም': 'ቅቤ',
      'name': 'Subaaca                              ንባብ: ሱባሃ',
    },
    {
      'id': 245,
      'ትርጉም': 'ማር',
      'name': 'Malaba                            ንባብ: ማለባ',
    },
    {
      'id': 246,
      'ትርጉም': 'ጨው',
      'name': 'Qsabo                                 ንባብ: ዓስቦ',
    },
    {
      'id': 247,
      'ትርጉም': 'ዓሳ',
      'name': 'Kulluumu                       ንባብ: ኩልሉሞ',
    },
    {
      'id': 248,
      'ትርጉም': 'እንቁላል',
      'name': 'Naala                          ንባብ: ናላ',
    },
    {
      'id': 249,
      'ትርጉም': 'ዘይት',
      'name': 'Zeyti                         ንባብ: ዘይት',
    },
    {
      'id': 250,
      'ትርጉም': 'ሩዝ',
      'name': 'RUddi                           ንባብ: ሩድዲ',
    },
    {
      'id': 251,
      'ትርጉም': 'ፉል',
      'name': 'Fuulu                       ንባብ: ፉሉ',
    },
    {
      'id': 252,
      'ትርጉም': 'እርጎ',
      'name': 'Rigidda                              ንባብ: ራጊዲዳ',
    },
    {
      'id': 253,
      'ትርጉም': 'ሻይ',
      'name': 'Shaahi                            ንባብ: ሻሂ',
    },
    {
      'id': 254,
      'ትርጉም': 'ቡና',
      'name': 'Buna                    ንባብ: ቡና',
    },
    {
      'id': 255,
      'ትርጉም': 'ወጥ',
      'name': 'Saalo/idaama                    ንባብ: ሳሎ/ኢዳማ',
    },
    {
      'id': 256,
      'ትርጉም': 'ቁርስ',
      'name': 'Qeero kalo                               ንባብ: ኤርክ ካሎ',
    },
    {
      'id': 257,
      'ትርጉም': 'ምሳ',
      'name': 'Mayo/Bodda                              ንባብ: ማዬ/ቦድዳ',
    },
    {
      'id': 258,
      'ትርጉም': 'እራት',
      'name': 'Diraara/Afxago                              ንባብ: ዲሪራ/አፍደጎ',
    },
    {
      'id': 259,
      'ትርጉም': 'ቁርስ',
      'name': 'Miidi/Quusu                               ንባብ: ሚዲ/ኡሱ',
    },
    {
      'id': 260,
      'ትርጉም': 'ዱቄት',
      'name': 'Buri                               ንባብ: ቡሪ',
    },
    {
      'id': 261,
      'ትርጉም': 'ጥሬ',
      'name': 'Ammo                  ንባብ: አሞ',
    },
    {
      'id': 262,
      'ትርጉም': 'ገብስ',
      'name': 'Caffali                     ንባብ: ሃፍፋሊ',
    },
    {
      'id': 263,
      'ትርጉም': 'ስንዴ',
      'name': 'Sirrayya                   ንባብ: ሲርራያ',
    },
    {
      'id': 264,
      'ትርጉም': 'በቆሎ',
      'name': 'Gerbesilla                  ንባብ: ጌርቤሲልላ',
    },
    {
      'id': 265,
      'ትርጉም': 'ገበቴ',
      'name': 'Koora                       ንባብ: ኮኦራ',
    },
    {
      'id': 266,
      'ትርጉም': 'ሳጥን',
      'name': 'Sacni                   ንባብ: ሳህኒ',
    },
    {
      'id': 267,
      'ትርጉም': 'የወተት ማለቢያ',
      'name': 'Ayni                   ንባብ: አይኒ',
    },
    {
      'id': 268,
      'ትርጉም': 'የወተት አቅማዳ',
      'name': 'Koxxa/Canti          ንባብ: ኮድዳ',
    },
    {
      'id': 269,
      'ትርጉም': 'የወተት አቅማዳ',
      'name': 'Qokkasa                            ንባብ: ዖክካሳ',
    },
    {
      'id': 270,
      'ትርጉም': 'ሽንኩርት',
      'name': 'Basala                        ንባብ: በሳላ',
    },
    {
      'id': 271,
      'ትርጉም': 'ድንች',
      'name': 'Bataatsi/Bataate               ንባብ: ባታቲሲ/ባታ አታ',
    },
    {
      'id': 272,
      'ትርጉም': ' በርበሬ',
      'name': 'Barabare                    ንባብ: ባርባሬ',
    },
    {
      'id': 273,
      'ትርጉም': 'ድስት',
      'name': 'Buti                           ንባብ: ቡቲ',
    },
    {
      'id': 274,
      'ትርጉም': 'ብርድ ልብስ',
      'name': 'Guula                     ንባብ: ጎላ',
    },
    {
      'id': 275,
      'ትርጉም': 'አንሶላ',
      'name': 'Ansoola                          ንባብ: አንሶላ',
    },
    {
      'id': 276,
      'ትርጉም': 'ጭልፋ',
      'name': 'Sabu                            ንባብ: ሳቡ',
    },
    {
      'id': 277,
      'ትርጉም': 'አብሳይ',
      'name': 'Alayse                        ንባብ: አላይሴ',
    },
    {
      'id': 278,
      'ትርጉም': 'ልብስ',
      'name': 'Sartana                           ንባብ:ሳርታና',
    },
    {
      'id': 279,
      'ትርጉም': 'ጫማ',
      'name': 'Kabella                             ንባብ: ከቤልላ',
    },
    {
      'id': 280,
      'ትርጉም': 'ሱሪ',
      'name': 'Sirwaalla                           ንባብ: ሲርዋላ',
    },
    {
      'id': 281,
      'ትርጉም': 'ሸሚዝ',
      'name': 'Shamiizi                         ንባብ: ሰሚዚ',
    },
    {
      'id': 282,
      'ትርጉም': 'ሽርጥ',
      'name': 'Marto                           ንባብ: ማርቶ',
    },
    {
      'id': 283,
      'ትርጉም': 'ፍራሽ',
      'name': 'Raraytu                        ንባብ: ፍራሻ',
    },
    {
      'id': 284,
      'ትርጉም': 'ትራስ',
      'name': 'Barkuma               ንባብ: ባርኩማ',
    },
    {
      'id': 285,
      'ትርጉም': 'ፍራሽ',
      'name': 'Firaasha             ንባብ: ፍራሻ',
    },
    {
      'id': 286,
      'ትርጉም': 'ቀለበት',
      'name': 'Ferranto                     ንባብ: ፈርራንቶ',
    },
    {
      'id': 287,
      'ትርጉም': 'ሽቶ',
      'name': 'Qatri                     ንባብ: ዓትሪ',
    },
    {
      'id': 288,
      'ትርጉም': 'ሳሙና',
      'name': 'Saabunu                     ንባብ: ሳቡኑ',
    },
    {
      'id': 289,
      'ትርጉም': 'ቢላዋ',
      'name': 'Gile                   ንባብ: ጊሌ',
    },
    {
      'id': 290,
      'ትርጉም': 'መቀስ',
      'name': 'Makasa                 ንባብ: ማከሳ',
    },
    {
      'id': 291,
      'ትርጉም': 'ማንኪያ',
      'name': 'Maaka/malkaqa                ንባብ: ማካ/ማልካዓ',
    },
    {
      'id': 292,
      'ትርጉም': 'እሳት',
      'name': 'gira                     ንባብ: ጊራ',
    },
    {
      'id': 293,
      'ትርጉም': 'እንጨት',
      'name': 'Boco                        ንባብ: ቦሆ',
    },
    {
      'id': 294,
      'ትርጉም': 'ፍራፍሬ',
      'name': 'Caxfexxa                       ንባብ: ሃድፌድዳ',
    },
    {
      'id': 295,
      'ትርጉም': 'አትክልት',
      'name': 'Caxaaxuwa                         ንባብ: ሃራሩዋ',
    },
    {
      'id': 296,
      'ትርጉም': 'አትክልትና ፍራፍሬ',
      'name': 'Caxfexxak caxaaxuwa                 ንባብ: ሃድፌድዳ ሃራሩዋ',
    },
    {
      'id': 297,
      'ትርጉም': 'ፍይናንስ',
      'name': 'Maaliyya                   ንባብ: ማላይያ',
    },
    {
      'id': 298,
      'ትርጉም': 'ፍይናንስ',
      'name': 'Miizaniyyata                      ንባብ: ሚዛኒይያት',
    },
    {
      'id': 299,
      'ትርጉም': 'ባንክ',
      'name': 'Banki                   ንባብ: ባንኪ',
    },
    {
      'id': 300,
      'ትርጉም': 'ገንዘብ',
      'name': 'Lakqo                   ንባብ: ለክኦ',
    },
    {
      'id': 301,
      'ትርጉም': 'ውጭ ምንዛሬ',
      'name': 'Rata le lakqo                ንባብ: ራታ ሌ ላክዖ',
    },
    {
      'id': 302,
      'ትርጉም': 'ቀረጥ',
      'name': 'Meeri                   ንባብ: ሜሪ',
    },
    {'id': 303, 'ትርጉም': 'ግብር', 'name': 'qasbi                  ንባብ: ዒሶ'},
    {
      'id': 304,
      'ትርጉም': 'ኢኮኖሚ መጨመር',
      'name': 'maali fullu                 ንባብ: ማሊ ፉሉ',
    },
    {
      'id': 305,
      'ትርጉም': 'ኢኮኖሚ ውድቀት',
      'name': 'maali daaca                       ንባብ: ማሊ ዳሃ',
    },
    {
      'id': 306,
      'ትርጉም': 'ወጪ',
      'name': 'kabxa                 ንባብ: ካብራ',
    },
    {
      'id': 307,
      'ትርጉም': 'ገቢ',
      'name': 'kbxa abe              ንባብ: ካብራ አቤ',
    },
    {
      'id': 308,
      'ትርጉም': 'ብሔራዊ ገቢ',
      'name': 'miizaaniyya liggida         ንባብ: ሚዛኒይያ ሊግጊዳ',
    },
    {
      'id': 309,
      'ትርጉም': 'ደመወዝ',
      'name': 'mekla                    ንባብ: ሜክላ',
    },
    {
      'id': 310,
      'ትርጉም': 'ማሊሲራ',
      'name': 'mellebi                      ንባብ: ሜልለቢ',
    },
    {
      'id': 311,
      'ትርጉም': 'ካብራ',
      'name': 'melleb fayya                       ንባብ: ሜልለብ ፍይያ',
    },
    {
      'id': 312,
      'ትርጉም': 'ዝቅጠት',
      'name': 'nawwa                            ንባብ: ናውዋ ',
    },
    {
      'id': 313,
      'ትርጉም': 'የንግድ ልውውጥ',
      'name': 'tellemo                   ንባብ: ቴሌልሞ',
    },
    {
      'id': 314,
      'ትርጉም': 'ሽያጭ',
      'name': 'Limo      ንባብ: ሊሞ',
    },
    {
      'id': 315,
      'ትርጉም': 'ችርቻሮ',
      'name': 'Boqa                   ንባብ: ቦአ',
    },
    {
      'id': 316,
      'ትርጉም': 'ትርፍ',
      'name': 'Xeefo/tirfi                    ንባብ: ደፎ/ትርፍ',
    },
    {
      'id': 317,
      'ትርጉም': 'እጥረት',
      'name': 'Kamiimo                     ንባብ: ከሚም',
    },
    {
      'id': 318,
      'ትርጉም': 'ወለድ',
      'name': 'Xalot                       ንባብ: ዳሎት',
    },
    {
      'id': 319,
      'ትርጉም': 'መላላት',
      'name': 'Salaca                           ንባብ: ሳላሃ',
    },
    {
      'id': 320,
      'ትርጉም': 'መመዘን',
      'name': 'Keexo                          ንባብ: ኪሮ',
    },
    {
      'id': 321,
      'ትርጉም': 'ሚዛን',
      'name': 'kexxeena                        ንባብ: ኬረና',
    },
    {
      'id': 322,
      'ትርጉም': 'ሞኖፖል',
      'name': 'caglino                          ንባብ: ሃግሊኖ',
    },
    {
      'id': 323,
      'ትርጉም': 'ሸቀጥ',
      'name': 'Badaaqata                  ንባብ: በዳዓታ',
    },
    {
      'id': 324,
      'ትርጉም': 'ሃዋላ',
      'name': 'Mali tabsu                          ንባብ: ማሊታብሱ',
    },
    {
      'id': 325,
      'ትርጉም': 'ካፒታል',
      'name': 'Rassal maal                       ንባብ: ራሳልማል',
    },
    {
      'id': 326,
      'ትርጉም': 'ድርሻ',
      'name': 'Maglaba                         ንባብ: ማግላባ',
    },
    {
      'id': 327,
      'ትርጉም': 'እዳ',
      'name': 'Mago                              ንባብ: ማጎ',
    },
    {
      'id': 328,
      'ትርጉም': 'መግዛት',
      'name': 'Xaamiyya                          ንባብ: ዳሚይያ',
    },
    {
      'id': 329,
      'ትርጉም': 'መሸጥ',
      'name': 'Aylammiyya             ንባብ: አይላምሚይያ',
    },
    {
      'id': 330,
      'ትርጉም': 'ደንበኛ',
      'name': 'Madruuru                           ንባብ: ሚድሩሩ',
    },
    {
      'id': 331,
      'ትርጉም': 'ውድነት',
      'name': 'Kubqi                      ንባብ: ኩብዒ',
    },
    {
      'id': 332,
      'ትርጉም': 'መድህን',
      'name': 'Aamantisso                     ንባብ: አማንቲሲስ',
    },
    {
      'id': 333,
      'ትርጉም': 'ኢንቨስትመንት',
      'name': 'Daalisso             ንባብ: ዳሊስሶ',
    },
    {
      'id': 334,
      'ትርጉም': 'ጅምላ ሽያጭ',
      'name': 'Amolladi limo               ንባብ: አሞልላዲ ሊም',
    },
    {
      'id': 335,
      'ትርጉም': 'ገበያ',
      'name': 'Qadaaga                 ንባብ: አዳጋ',
    },
    {
      'id': 336,
      'ትርጉም': 'የወርቅ ገበያ',
      'name': 'Dahab qadaaga                    ንባብ: ዳሃብ አዳጋ',
    },
    {
      'id': 337,
      'ትርጉም': 'የከብት ገበይ',
      'name': 'Saqi qadaaga                       ንባብ: ሳዒ ዓዳጋ',
    },
    {
      'id': 338,
      'ትርጉም': 'የእህል ገበያ',
      'name': 'daro qadaaga                   ንባብ: ዳሮ አዳጋ',
    },
    {
      'id': 339,
      'ትርጉም': 'የልብስ ገበያ',
      'name': 'sari qadaaga                             ንባብ: ሳሪ አዳጋ',
    },
    {
      'id': 340,
      'ትርጉም': 'ፍይናንስ',
      'name': 'sansi/sirag le lee                   ንባብ: ሚዛኒይያት',
    },
    {
      'id': 341,
      'ትርጉም': 'ነዳጅ',
      'name': 'sansi/sirag le lee                  ንባብ: ሳንሲ/ሲራግለ ሌ',
    },
    {
      'id': 342,
      'ትርጉም': 'ወርቅ ሰሪ',
      'name': 'dahab bicse                          ንባብ: ዳሃብ ቤህሴ',
    },
    {
      'id': 343,
      'ትርጉም': 'ብረታ ብረት ሰሪ',
      'name': 'Biriitia bicse                        ንባብ: ቤሪታ ቢህሴ',
    },
    {
      'id': 344,
      'ትርጉም': 'ላኪ',
      'name': 'waaridat/baahenta                  ንባብ: ዋሪዳት፣ባሄንታ',
    },
    {
      'id': 345,
      'ትርጉም': 'አስመጪ',
      'name': 'saadirat/Ruubenta                            ንባብ: ሳዲራት/ሩቤንት',
    },
    {
      'id': 346,
      'ትርጉም': 'ወኪል',
      'name': 'wakiili                    ንባብ: ዋኪል',
    },
    {
      'id': 347,
      'ትርጉም': 'አምራች',
      'name': 'Murtiseena                ንባብ: ሙርቴሴይና',
    },
    {
      'id': 348,
      'ትርጉም': 'ሽማች',
      'name': 'Xagiteena                               ንባብ: ዳጊቴይና',
    },
    {
      'id': 349,
      'ትርጉም': 'መከላከያ',
      'name': 'Kalalu                    ንባብ: ካለሉ',
    },
    {
      'id': 350,
      'ትርጉም': 'ጦርነት',
      'name': 'carbi                   ንባብ: ሃርቢ',
    },
    {
      'id': 351,
      'ትርጉም': 'ውጊያ',
      'name': 'Maysataka               ንባብ: ማይሳታካ',
    },
    {
      'id': 352,
      'ትርጉም': 'ሰላም',
      'name': 'Wagari                 ንባብ: ዋጋሪ',
    },
    {
      'id': 353,
      'ትርጉም': 'ደጋን',
      'name': 'Gayse/lacaw                      ንባብ: ጋይሴ/ላሃው',
    },
    {
      'id': 354,
      'ትርጉም': 'ቀስት',
      'name': 'Gayse baxa                 ንባብ: ጋይሰብራ',
    },
    {
      'id': 355,
      'ትርጉም': 'ጦር',
      'name': 'qande/macaxu                       ንባብ: አንዳ/ማሃሩ',
    },
    {
      'id': 356,
      'ትርጉም': 'ጋሻ',
      'name': 'Goobu                       ንባብ: ጎቡ',
    },
    {
      'id': 357,
      'ትርጉም': ' ሰይፍ',
      'name': 'seefi                                              ንባብ: ሴፊ',
    },
    {
      'id': 358,
      'ትርጉም': 'ሽጉጥ',
      'name':
          'Fardi/xonko gira                                                   ንባብ:ፋርዲ/ዶንኮግ ጊራ   ',
    },
    {
      'id': 359,
      'ትርጉም': 'ታንክ',
      'name':
          'Dabbaaba                                                ንባብ ድብባባ',
    },
    {
      'id': 360,
      'ትርጉም': 'ሮኬት',
      'name':
          'Saaruuku                                                      ንባብ: ሳሩኩ',
    },
    {
      'id': 361,
      'ትርጉም': 'ወረራ',
      'name':
          ' Warara                                                    ንባብ:ዋራራ',
    },
    {
      'id': 362,
      'ትርጉም': 'መድፍ',
      'name':
          ' Madfaqa                                                       ንባብ: መዳፍዓ',
    },
    {
      'id': 362,
      'ትርጉም': 'ማጥቃት',
      'name':
          'Dadho                                                             ንባብ: ዳድሆ	 ',
    },
    {
      'id': 363,
      'ትርጉም': 'ማፈግፈግ',
      'name':
          ' Hirgimiyya                                                    ንባብ: ሂርጊሚይያ	',
    },
    {
      'id': 364,
      'ትርጉም': 'ድል',
      'name':
          ' Mayso                                                   ንባብ: ማይሶ	',
    },
    {
      'id': 365,
      'ትርጉም': 'ድል ማድረግ',
      'name':
          ' iysa                                                         ንባብ:ኢይሳ',
    },
    {
      'id': 366,
      'ትርጉም': 'መሸነፍ',
      'name':
          'Gaciyya/buka                                                     ንባብ:ጋሂይያ/ቡካ	 ',
    },
    {
      'id': 367,
      'ትርጉም': 'ምርኮኛ',
      'name': 'seewa                                                  ንባብ:ሴዋ ',
    },
    {
      'id': 369,
      'ትርጉም': 'የምርኮ ንብረት',
      'name':
          'Daanaba                                                   ንባብ:ደናባ',
    },
    {
      'id': 370,
      'ትርጉም': 'ተኩስ አቁም',
      'name':
          ' Bara                                                       ንባብ: ባራ',
    },
    {
      'id': 371,
      'ትርጉም': 'ሽምቅ ተዋጊ',
      'name':
          'Gaadule                                                 ንባብ:ጋዱሌ ',
    },
    {
      'id': 372,
      'ትርጉም': 'ግጭት',
      'name':
          ' Ganaasaqo                                                  ንባብ: ጋናሳዖ	 ',
    },
    {
      'id': 373,
      'ትርጉም': 'ጦር ሰፈር',
      'name':
          ' Salala                                                         ንባብ: ሳላላ',
    },
    {
      'id': 374,
      'ትርጉም': 'ጥይት',
      'name': 'Rusasa                                                 ንባብ: ሩሳሳ',
    },
    {
      'id': 375,
      'ትርጉም': 'መሳሪያ',
      'name':
          ' Silaaca                                                  ንባብ: ሲላሃ ',
    },
    {
      'id': 376,
      'ትርጉም': 'ሲቪል',
      'name':
          ' Gabqasa                                                      ንባብ: ጋብዓሳ	',
    },
    {
      'id': 377,
      'ትርጉም': 'ቃኚ',
      'name':
          'sibayba                                                  ንባብ: ሲባይባ	',
    },
    {
      'id': 378,
      'ትርጉም': 'ቃፊር',
      'name': ' Giba                                                  ንባብ: ጊባ	',
    },
    {
      'id': 379,
      'ትርጉም': 'ቁስል',
      'name': 'Dale                                                   ንባብ: ዳሌ',
    },
    {
      'id': 380,
      'ትርጉም': 'መቁሰል',
      'name': ' Mudulli        ንባብ: ሙዱልሊ	',
    },
    {
      'id': 381,
      'ትርጉም': 'ጀነራል',
      'name': 'jeneral     ንባብ: ጀነራል ',
    },
    {
      'id': 382,
      'ትርጉም': 'የጦር ካምፕ',
      'name': ' Maqasakara       ንባብ: ማዓስከራ',
    },
    {
      'id': 383,
      'ትርጉም': 'መሪ',
      'name': ' Miraaca    ንባብ: ሚራህ',
    },
    {
      'id': 384,
      'ትርጉም': 'ሃይል',
      'name': ' qande            ንባብ:    ዓንዴ ',
    },
    {
      'id': 385,
      'ትርጉም': 'ወታደር',
      'name': 'qaskartu  ንባብ: ዓስከርቱ	',
    },
    {
      'id': 386,
      'ትርጉም': 'አስር አለቃ',
      'name': ' Tabanaba    ንባብ: ታባንአአብባ',
    },
    {
      'id': 387,
      'ትርጉም': 'መቶ አለቃ',
      'name': 'Boolabba    ንባብ: ቦኦል አብባ',
    },
    {
      'id': 388,
      'ትርጉም': 'ዛምበል',
      'name': ' Shambala     ንባብ: ሻምባላ',
    },
    {
      'id': 389,
      'ትርጉም': 'ሻለቃ',
      'name': ' Fereyeli         ንባብ: ፈረይሊ',
    },
    {
      'id': 390,
      'ትርጉም': 'ኮሎኔል',
      'name': ' Konoyli      ንባብ: ኮኖይሊ',
    },
    {
      'id': 391,
      'ትርጉም': 'ጀነራል',
      'name': 'jeneral    ንባብ: ጀነራል	',
    },
    {
      'id': 392,
      'ትርጉም': 'ጦሩ ተጣላ（ተጋጨ）',
      'name': 'macxiyoomeh    ንባብ:   ማህሪ ዬሜህ',
    },
    {
      'id': 393,
      'ትርጉም': 'ጦሩ ታረቀ',
      'name': 'macxi yemeqeh  ንባብ: ማህሪ የምኤህ	 ',
    },
    {
      'id': 394,
      'ትርጉም': 'ቃል ተግባቡ',
      'name': 'qalla heen    ንባብ: አልላ ሄየን ',
    },
    {
      'id': 395,
      'ትርጉም': 'መወገን ',
      'name': 'kollih anyo    ንባብ: ኮልሊህ አንዬ',
    },
    {
      'id': 396,
      'ትርጉም': 'ተጋጩ',
      'name': 'yenkee lefen     ንባብ: ዬንኬሌፈን	',
    },
    {
      'id': 397,
      'ትርጉም': 'ተፈጥሮ',
      'name': ' Gino     ንባብ: ጊኖ	',
    },
    {
      'id': 398,
      'ትርጉም': 'መሬት',
      'name': 'Ardi      ንባብ:	አርዲ	 ',
    },
    {'id': 399, 'ትርጉም': 'ሰማይ', 'name': ' Qaran   ንባብ: ዓራን'},
    {
      'id': 400,
      'ትርጉም': 'ጸሃይ',
      'name': ' Ayro                 ንባብ: አይሮ',
    },
    {
      'id': 401,
      'ትርጉም': 'ጨረቃ',
      'name': ' Alsa      ንባብ: አልሳ',
    },
    {
      'id': 402,
      'ትርጉም': 'ባህር',
      'name': 'Bada             ንባብ: ባዳ',
    },
    {
      'id': 403,
      'ትርጉም': 'ውቅያኖስ',
      'name': 'Badiida     ንባብ: ባዲዳ	 ',
    },
    {
      'id': 404,
      'ትርጉም': 'ገጠር',
      'name': ' Barri             ንባብ: ባርሪ	',
    },
    {
      'id': 405,
      'ትርጉም': 'ሳር',
      'name': ' Qayso               ንባብ: ዓይሶ',
    },
    {
      'id': 406,
      'ትርጉም': 'ሜዳ',
      'name': ' Bacari                 ንባብ: ባሃሪ',
    },
    {
      'id': 407,
      'ትርጉም': 'ጫካ',
      'name': ' Garbo            ንባብ: ጋርቦ',
    },
    {
      'id': 408,
      'ትርጉም': 'ተራራ',
      'name': ' Qale            ንባብ: አሌ	  ',
    },
    {
      'id': 409,
      'ትርጉም': 'ጠጠር',
      'name': ' Bayyaaci         ንባብ: ባይያአሂ',
    },
    {
      'id': 410,
      'ትርጉም': 'አሸዋ',
      'name': ' Qidde           ንባብ: ዒድዴ',
    },
    {
      'id': 410,
      'ትርጉም': 'ውሃ  ',
      'name': ' Weeqaytu              ንባብ: ዌኤዓይቱ',
    },
    {
      'id': 411,
      'ትርጉም': 'ገባር ወንዝ/ወረዳ',
      'name': ' Daqaara           ንባብ: ዳዓራ',
    },
    {
      'id': 412,
      'ትርጉም': 'ዳመና ',
      'name': ' Roobu          ንባብ: ሮኦቡ',
    },
    {
      'id': 413,
      'ትርጉም': 'ዝናብ',
      'name': ' Barada                  ንባብ:ባራዳ',
    },
    {
      'id': 414,
      'ትርጉም': 'በረዶ',
      'name': ' Angada              ንባብ: አንጋዳ',
    },
    {
      'id': 415,
      'ትርጉም': 'ነጎድጓድ',
      'name': ' Cankara                    ንባብ: ሃንካራ',
    },
    {
      'id': 416,
      'ትርጉም': 'ኮከብ',
      'name': 'Cutukta                ንባብ: ሁቱክታ',
    },
    {
      'id': 417,
      'ትርጉም': 'ጭስ',
      'name': ' qeeri             ንባብ: ኤኤሪ',
    },
    {
      'id': 418,
      'ትርጉም': 'ጭጋግ',
      'name': ' Qubulu                ንባብ:  ዑቡሉ',
    },
    {
      'id': 419,
      'ትርጉም': 'አፈር',
      'name': ' Buuri                ንባብ: ቡኡሪ',
    },
    {
      'id': 420,
      'ትርጉም': 'ጭቃ',
      'name': ' Kalla                       ንባብ: ካልላ	',
    },
    {
      'id': 421,
      'ትርጉም': 'ጨለማ',
      'name': 'Dite                   ንባብ:   ዲቴ	  ',
    },
    {
      'id': 422,
      'ትርጉም': 'ጮራ፣ብርሃን',
      'name': ' Weeqa               ንባብ: ዊኤዓ',
    },
    {
      'id': 423,
      'ትርጉም': 'ንፋስ',
      'name': ' Caacaya               ንባብ: ሃአሃያ',
    },
    {
      'id': 424,
      'ትርጉም': 'አውሎ ንፋስ',
      'name': 'Qaanale                ንባብ:  ዓአናሌ	 ',
    },
    {
      'id': 425,
      'ትርጉም': 'የመሬት መንቀጥቀጥ',
      'name': ' Baaxoh angoyya                 ንባብ: ባአሮህ አንጎይያ ',
    },
    {
      'id': 426,
      'ትርጉም': 'የባህር ሞገድ',
      'name': ' ungaaxa                   ንባብ: ኡንጋአራ',
    },
    {
      'id': 427,
      'ትርጉም': 'ሃይቅ',
      'name': ' Kalu               ንባብ: ካሉ	 ',
    },
    {
      'id': 427,
      'ትርጉም': 'የአየር ሁኔታ',
      'name': ' Rosqa           ንባብ: ሮሰአ',
    },
    {
      'id': 428,
      'ትርጉም': 'አየር',
      'name': ' Hawa           ንባብ: ሃዋ	',
    },
    {
      'id': 429,
      'ትርጉም': 'ድንጋይ',
      'name': 'Xaa          ንባብ:  ዳአ	',
    },
    {
      'id': 430,
      'ትርጉም': 'ድር እንስሳት',
      'name': ' Alafkulli                               ንባብ: አልፋኩልሊ	',
    },
    {
      'id': 431,
      'ትርጉም': 'እንስሳት',
      'name': ' saqa             ንባብ: ሰዓ ',
    },
    {
      'id': 432,
      'ትርጉም': 'አውሬ',
      'name': ' Ala              ንባብ: አላ	',
    },
    {
      'id': 433,
      'ትርጉም': 'ፍየል፣ፍየሎች',
      'name': ' Reyta(Wadara)                   ንባብ: ሬይታ/ዋደራ 	',
    },
    {
      'id': 434,
      'ትርጉም': 'በግ፣በጎች',
      'name': 'Ida(illi)          ንባብ: ኢዳ/ኢልሊ/',
    },
    {
      'id': 435,
      'ትርጉም': 'ፈርስ',
      'name': ' farasa           ንባብ:ፋራሳ',
    },
    {
      'id': 436,
      'ትርጉም': 'አህያ',
      'name': ' Danana                        ንባብ: ዳናና	',
    },
    {
      'id': 437,
      'ትርጉም': 'ላም፣ላሞች',
      'name': ' Saga          ንባብ: ሳጋ/ላኣ	',
    },
    {
      'id': 438,
      'ትርጉም': 'በሬ',
      'name': ' Aguru               ንባብ: አጉሩ',
    },
    {
      'id': 439,
      'ትርጉም': 'ድመት',
      'name': ' Dummu              ንባብ: ዱምሙ	',
    },
    {
      'id': 440,
      'ትርጉም': 'አይጥ',
      'name': ' Ikiqyo(hantuuta)            ንባብ: ኢኪዕዮ/ሃንቱኡታ	',
    },
    {
      'id': 441,
      'ትርጉም': 'ጥንቸል',
      'name': ' Bakkeela             ንባብ: ባክኬኤላ',
    },
    {
      'id': 442,
      'ትርጉም': 'ተኩላ',
      'name': ' Suula             ንባብ: ሱኡላ',
    },
    {
      'id': 443,
      'ትርጉም': 'ጅብ',
      'name': ' yangula              ንባብ: ያንጉላ	',
    },
    {
      'id': 444,
      'ትርጉም': 'ነብር',
      'name': ' Kabqi           ንባብ: ካብኢ',
    },
    {
      'id': 445,
      'ትርጉም': 'ቀበሮ',
      'name': ' Waqri                  ንባብ: ዋክሪ',
    },
    {
      'id': 446,
      'ትርጉም': 'ዝንጀሮ',
      'name': 'Damaqtu               ንባብ: ማዕቱ',
    },
    {
      'id': 447,
      'ትርጉም': 'አንበሳ',
      'name': ' Lubaaka                 ንባብ: ሉባአካ',
    },
    {
      'id': 448,
      'ትርጉም': 'ዝሆን',
      'name': ' Dakanu                ንባብ: ደካኑ	',
    },
    {
      'id': 449,
      'ትርጉም': 'አውሬ',
      'name': ' Qangi              ንባብ: አንጊ',
    },
    {
      'id': 450,
      'ትርጉም': 'የዱር አውሬ',
      'name': ' Dubaala                  ንባብ: ዱባላ',
    },
    {
      'id': 451,
      'ትርጉም': 'ለማዳ እንስሳ',
      'name': ' Garaala               ንባብ: ጋራዓላ',
    },
    {
      'id': 452,
      'ትርጉም': 'ሰጎን',
      'name': ' Goroyya           ንባብ: ጎሮይያ	',
    },
    {
      'id': 453,
      'ትርጉም': 'ዶሮ',
      'name': ' Dorrahi              ንባብ: ዶርራሂ	',
    },
    {
      'id': 454,
      'ትርጉም': 'ውሻ',
      'name': ' Kuta            ንባብ: ኩታ ',
    },
    {
      'id': 455,
      'ትርጉም': 'ሴት ግመል',
      'name': ' Ranse           ንባብ:  አላ',
    },
    {
      'id': 456,
      'ትርጉም': 'ግመል（ወንድ）',
      'name': ' Rakuubu               ንባብ: ራኩኡቡ	 ',
    },
    {
      'id': 457,
      'ትርጉም': 'ግመሎች',
      'name': ' Gaala                 ንባብ: ጋአላ',
    },
    {
      'id': 458,
      'ትርጉም': 'የሜዳ አህያ',
      'name': ' Daqama           ንባብ: ዳዓማ	ሽልምልማም ',
    },
    {
      'id': 459,
      'ትርጉም': 'ሜዳ አህያ',
      'name': ' Wayxexxa            ንባብ:ዋይዴድዳ	',
    },
    {
      'id': 460,
      'ትርጉም': 'ቀጭኔ',
      'name': ' Gari               ንባብ:        ጋሪ	',
    },
    {
      'id': 461,
      'ትርጉም': 'ሳላ',
      'name': ' Biqida               ንባብ: ቢኢዳ',
    },
    {
      'id': 462,
      'ትርጉም': 'አዞ',
      'name': ' Xabaado            ንባብ: ዳባኦዳ	',
    },
    {
      'id': 463,
      'ትርጉም': 'አሳ',
      'name': ' Kullumta                ንባብ: ኩልሉምታ',
    },
    {
      'id': 464,
      'ትርጉም': 'ጉማሬ',
      'name': ' Dullu              ንባብ: ድኡሉ',
    },
    {
      'id': 465,
      'ትርጉም': 'እንቁራሪት',
      'name': ' Baxanna                ንባብ: ባራንና',
    },
    {
      'id': 466,
      'ትርጉም': 'አውራሪስ',
      'name': ' Gurqu           ንባብ: ጉርዑ',
    },
    {
      'id': 467,
      'ትርጉም': 'ጎሽ',
      'name': ' Gasi               ንባብ: ጊሲ	',
    },
    {
      'id': 468,
      'ትርጉም': 'ቁራ',
      'name': ' Kuraanu           ንባብ: ኩራአኑ',
    },
    {
      'id': 469,
      'ትርጉም': 'ወፍ',
      'name':
          ' Kimbiro                                                   ንባብ: ኪምቢሮ	',
    },
    {
      'id': 470,
      'ትርጉም': 'እርግብ',
      'name': ' Goomaqa                          ንባብ: ጎአማዓ',
    },
    {
      'id': 471,
      'ትርጉም': 'ጭልፊት',
      'name': ' Qawi(tiko)                                      ንባብ: ዓዊ/ቲኮ',
    },
    {
      'id': 472,
      'ትርጉም': 'አሞራ',
      'name':
          ' Gumaytu                                                   ንባብ:ጎማይቱ	ጆፌ 	',
    },
    {
      'id': 473,
      'ትርጉም': 'አባኮዳ',
      'name':
          ' Koxxali                                                     ንባብ:ኮድዳሌ',
    },
    {
      'id': 474,
      'ትርጉም': 'ትል',
      'name':
          ' Xaariyaytu                                                       ንባብ: ዳአሪያይቱ',
    },
    {
      'id': 475,
      'ትርጉም': 'ሸረሪት',
      'name': 'Qaro                                                    ንባብ:ዓሮ',
    },
    {
      'id': 476,
      'ትርጉም': 'ጉንዳን',
      'name': ' Xuune                                         ንባብ:ዱኡኔ',
    },
    {
      'id': 477,
      'ትርጉም': 'የወባ ትንኝ',
      'name':
          ' Kayniiqe                                                            ንባብ:ካይኒኢኤ	',
    },
    {
      'id': 478,
      'ትርጉም': 'አንበጣ',
      'name': ' Qanaytu                                     ንባብ:ዓናይቱ	'
    },
    {
      'id': 479,
      'ትርጉም': 'ንብ',
      'name': ' Diidaale                                    ንባብ: ዳኢዳአሌ',
    },
    {
      'id': 480,
      'ትርጉም': 'እባብ',
      'name': ' Abeesa                                  ንባብ: አቤኤሳ	',
    },
    {
      'id': 481,
      'ትርጉም': 'ጊንጥ',
      'name': ' Igixxa                                ንባብ: ኢጊድዳ	',
    },
    {
      'id': 482,
      'ትርጉም': 'አቅጣጫ',
      'name': ' Kaalibi                                           ንባብ:ካሊቢ',
    },
    {
      'id': 483,
      'ትርጉም': 'ምስራቅ',
      'name':
          'Maaca(mekki)                                              ንባብ:ማሃ/መክኪ	 ',
    },
    {
      'id': 484,
      'ትርጉም': 'ምዕራብ',
      'name':
          'Mekrifi(carra)                                                            ንባብ: ሜክሪፊ/ሃርራ/',
    },
    {
      'id': 485,
      'ትርጉም': 'ደቡብ',
      'name':
          'Gabbi                                                                 ንባብ:ጋብቢ',
    },
    {
      'id': 486,
      'ትርጉም': 'ሰሜን',
      'name':
          ' Kilbata                                                                ንባብ: ኪልበታ	',
    },
    {
      'id': 487,
      'ትርጉም': 'ሰሜን ምስራቅ',
      'name':
          ' Kilbatti maaca                                                     ንባብ:ኪልበትቲ ማሃ	',
    },
    {
      'id': 488,
      'ትርጉም': 'ደቡብ ምስራቅ',
      'name':
          'Gabbi maaca                                                           ንባብ: ጋብቢ ማሃ ',
    },
    {
      'id': 489,
      'ትርጉም': 'ሰሜን ምዕራብ',
      'name':
          'Kilbatti carra                                                            ንባብ:ኪልባቲት ሃርራ	',
    },
    {
      'id': 490,
      'ትርጉም': 'ፊት ለፊት',
      'name':
          ' Focca                                                           ንባብ:	ፎሃ	',
    },
    {
      'id': 491,
      'ትርጉም': 'ኋላ',
      'name':
          'Derre                                                             ንባብ: ዴርሬ ',
    },
    {
      'id': 492,
      'ትርጉም': 'ቀኝ',
      'name':
          'Migda                                                              ንባብ: ሚግዳ	',
    },
    {
      'id': 493,
      'ትርጉም': 'ግራ',
      'name':
          ' Gura                                                              ንባብ: ጉራ',
    },
    {
      'id': 494,
      'ትርጉም': 'ላይ',
      'name':
          ' Daga                                                              ንባብ: ዳጋ	',
    },
    {
      'id': 495,
      'ትርጉም': 'ታች',
      'name':
          ' Guba                                                                      ንባብ: ጉባ',
    },
    {
      'id': 496,
      'ትርጉም': 'ውስጥ',
      'name':
          ' Adda                                                                    ንባብ: አድዳ	',
    },
    {
      'id': 497,
      'ትርጉም': 'ውጭ',
      'name':
          'Iro                                                              ንባብ: ኢሮ	',
    },
    {
      'id': 498,
      'ትርጉም': 'ወደ',
      'name':
          ' Iffan                                                              ንባብ:	ኢፍፋን',
    },
    {
      'id': 499,
      'ትርጉም': 'ቅርብ',
      'name':
          ' Xayih                                                               ንባብ: ዳዬህ',
    },
    {
      'id': 500,
      'ትርጉም': 'ሩቅ፣ረጅም',
      'name':
          ' Xeerih                                                          ንባብ: ዴኤሪህ	 ',
    },
    {
      'id': 501,
      'ትርጉም': 'ጊዜ፣ወቅት',
      'name':
          'Wakti                                                          ንባብ: ዋክቲ ',
    },
    {
      'id': 502,
      'ትርጉም': 'ዓመት',
      'name':
          ' Liggida                                                              ንባብ: ሊግጊዳ	',
    },
    {
      'id': 503,
      'ትርጉም': '10 ዓመት',
      'name':
          ' Dubbi                                                               ንባብ: ዱብቢ',
    },
    {
      'id': 504,
      'ትርጉም': 'ትውልድ፣30 ዓመት',
      'name':
          ' Hora                                                                       ንባብ:	ሆራ',
    },
    {
      'id': 505,
      'ትርጉም': 'መቶ አመት፣ምዕተ ዓመት',
      'name':
          'Bool liggida                                                  ንባብ:  	ቦኦል ሊግጊድ	    ',
    },
    {
      'id': 506,
      'ትርጉም': 'አራት የዝናብ ወቅቶች',
      'name':
          ' Affara Adbana                                                           ንባብ: አፍፋራ አድባና  ',
    },
    {
      'id': 507,
      'ትርጉም': 'ክረምት',
      'name':
          ' Karama                                                            ንባብ: ካርማ	',
    },
    {
      'id': 508,
      'ትርጉም': 'ፀደይ',
      'name': ' Dadaqa                                              ንባብ: ዳደዓ',
    },
    {
      'id': 509,
      'ትርጉም': 'መኸር',
      'name':
          ' Dabayba                                                ንባብ: ደባይባ',
    },
    {
      'id': 510,
      'ትርጉም': 'በልግ',
      'name':
          ' Sugumu                                                          ንባብ: ሱጉሙ',
    },
    {
      'id': 511,
      'ትርጉም': 'በጋ',
      'name': ' Cagaya                                             ንባብ: ሃጋያ',
    },
    {
      'id': 512,
      'ትርጉም': 'የቅዝቃዜ ወቅት',
      'name': ' Gilala                                              ንባብ: ጊላላ',
    },
    {
      'id': 513,
      'ትርጉም': 'ወር',
      'name':
          ' xaagi mansoofa                                                ንባብ: ዳአጊ ማንሶአፋ',
    },
    {
      'id': 514,
      'ትርጉም': 'ሳምንት',
      'name':
          'Ayyaama(bacure)                                                      ንባብ: አይያኣማ ',
    },
    {
      'id': 515,
      'ትርጉም': 'ቀን',
      'name':
          ' Qaada                                                                ንባብ: ዓአዳ',
    },
    {
      'id': 516,
      'ትርጉም': 'ሌሊት',
      'name':
          ' Laqo                                                                        ንባብ: ለዖ	',
    },
    {
      'id': 517,
      'ትርጉም': 'ጧት',
      'name': ' Saaku                     ንባብ: ሳአኩ',
    },
    {
      'id': 518,
      'ትርጉም': 'ቀትር፣እኩለ ቀን',
      'name':
          ' Ghaara                                                                   ንባብ: ጋሃአራ',
    },
    {
      'id': 519,
      'ትርጉም': 'ማታ፣ከሰዓት በኋላ',
      'name':
          'Carra                                                                           ንባብ: ሃርራ	 ',
    },
    {
      'id': 520,
      'ትርጉም': 'እኩለሌሊት',
      'name':
          ' Gimo                                                             ንባብ: ጊሞ	',
    },
    {
      'id': 521,
      'ትርጉም': 'ንጋት',
      'name':
          ' Maaca(dibro)                                                                 ንባብ: ማአሃ	',
    },
    {
      'id': 522,
      'ትርጉም': 'ማምሽያ',
      'name':
          ' Kassoyna                                                                       ንባብ: ካስሶይና',
    },
    {
      'id': 523,
      'ትርጉም': 'ዛሬ',
      'name':
          ' Asaaku                                                                     ንባብ: አሳአኩ',
    },
    {
      'id': 524,
      'ትርጉም': 'ከነገ ወዲያ',
      'name':
          'Beeca                                                             ንባብ: ቤኤሪ',
    },
    {
      'id': 525,
      'ትርጉም': 'ትላንት',
      'name':
          ' Kimaala                                                              ንባብ: ኪማአላ',
    },
    {
      'id': 526,
      'ትርጉም': 'ከ ትላንት በስቲያ',
      'name':
          ' Ammmaaca                                                               ንባብ: አምማአሃ	',
    },
    {
      'id': 527,
      'ትርጉም': 'ሰዓት',
      'name':
          ' Waqla                                                                    ንባብ: ዋዕላ',
    },
    {
      'id': 528,
      'ትርጉም': 'ሃይማኖት',
      'name':
          ' Diini                                                        ንባብ: ዲኢኒ',
    },
    {
      'id': 530,
      'ትርጉም': 'አልላህ',
      'name':
          ' Yalla(Allah)                                                          ንባብ: አልላሃ	 ',
    },
    {
      'id': 531,
      'ትርጉም': 'መልዕክተኛ',
      'name':
          ' Farmoyta                                                          ንባብ: ፋርሞይታ',
    },
    {
      'id': 532,
      'ትርጉም': 'ነቢይ',
      'name':
          ' Nabiyyi                                                          ንባብ: ናቢይ',
    },
    {
      'id': 533,
      'ትርጉም': 'ዕስልምና',
      'name':
          ' Islam                                                            ንባብ: እስላማ',
    },
    {
      'id': 534,
      'ትርጉም': 'ክርስትና',
      'name':
          ' Korosu                                                            ንባብ: ኮሮሱ',
    },
    {
      'id': 536,
      'ትርጉም': 'አይሁዳዊ',
      'name':
          ' yahuudu                                                          ንባብ: ያሁኡዱ',
    },
    {
      'id': 537,
      'ትርጉም': 'ሙስሊም',
      'name':
          ' Muslimtu                                                      ንባብ: ሙስሊምቱ',
    },
    {
      'id': 538,
      'ትርጉም': 'ክርስቲያን',
      'name': ' Korosta              ንባብ: ኮሮስታ	',
    },
    {
      'id': 539,
      'ትርጉም': 'አይሁድ',
      'name': ' yahuudiita                    ንባብ: ያሁኡዲታ',
    },
    {
      'id': 540,
      'ትርጉም': 'መስጊድ',
      'name': ' Masgiidi                  ንባብ: ማስጊድ	',
    },
    {
      'id': 541,
      'ትርጉም': 'ቤተ ክርስቲያን',
      'name': ' sinagoog               ንባብ: ሲናአጎኦጉ	',
    },
    {
      'id': 542,
      'ትርጉም': 'ቤተ አይሁድ',
      'name': ' Kaniisa                     ንባብ: ካኒዒሲ',
    },
    {
      'id': 543,
      'ትርጉም': 'ኦሪት',
      'name': ' Tawraat        ንባብ: ታውራአታ	',
    },
    {
      'id': 544,
      'ትርጉም': 'ወንጌል',
      'name': ' Injiili                  ንባብ: ኢንጂኢሊ	',
    },
    {
      'id': 545,
      'ትርጉም': 'ቁርአን',
      'name': ' Qhuraana               ንባብ: ንባብቁርአና',
    },
    {
      'id': 546,
      'ትርጉም': 'ጀነት',
      'name': 'Jannata                ንባብ: ጀናንታ ',
    },
    {
      'id': 547,
      'ትርጉም': 'ሲኦል',
      'name': ' ghanannama          ንባብ: ጋሃንናማ',
    },
    {
      'id': 548,
      'ትርጉም': 'ተአምር',
      'name': ' Karaama(muqjiza)           ንባብ: ካራአማ/ሙዕጂዛ	',
    },
    {
      'id': 549,
      'ትርጉም': 'ሶላት፣ስግደት',
      'name': 'Salaata           ንባብ: ሳላአታ	',
    },
    {
      'id': 550,
      'ትርጉም': 'ጾም',
      'name': ' Soomu                ንባብ: ሶኦሙ	',
    },
    {
      'id': 551,
      'ትርጉም': 'ሐጅ',
      'name': ' cajji                 ንባብ: ሐጂ',
    },
    {
      'id': 552,
      'ትርጉም': 'ምፅዋት',
      'name': ' Zakaata                ንባብ: ዛካአታ',
    },
    {
      'id': 553,
      'ትርጉም': 'ምፃት',
      'name': ' Kiyaamah ayro                    ንባብ: ኪያአማህ አይሮ ',
    },
    {
      'id': 554,
      'ትርጉም': 'ቅጣት',
      'name': ' Galato           ንባብ: ጋላቶ',
    },
    {
      'id': 555,
      'ትርጉም': 'አማኝ',
      'name': ' Digaala                        ንባብ: ዲጋአላ	',
    },
    {
      'id': 556,
      'ትርጉም': 'ከሀዲ',
      'name': ' Moomintu                  ንባብ: ሞኦሚንቱ	',
    },
    {
      'id': 557,
      'ትርጉም': 'ልደት',
      'name': ' kaafirtu                 ንባብ: ካአፊርቱ	',
    },
    {
      'id': 558,
      'ትርጉም': 'የአረፋ በአል',
      'name': ' Mawliidi                          ንባብ: ማውሊኢዲ	',
    },
    {
      'id': 559,
      'ትርጉም': 'የፆም ፍቺ በአል',
      'name': 'Qarfa qiidi                        ንባብ:   አርፋ ዒኢዲ ',
    },
    {
      'id': 560,
      'ትርጉም': 'ድንግል',
      'name': ' soom qiidi                   ንባብ: ሶኦም ዒኢዲ	 ',
    },
    {
      'id': 561,
      'ትርጉም': 'መላእክት',
      'name': ' Baxuwwa                      ንባብ: ባሩውዋ	',
    },
    {
      'id': 562,
      'ትርጉም': 'ትንሳኤ',
      'name': ' 2toh ugutu                     ንባብ: ነምማሃይቶ ኡጉቱ',
    },
    {
      'id': 563,
      'ትርጉም': 'እምነት',
      'name': ' Imaana                          ንባብ: ኢማአና',
    },
    {
      'id': 564,
      'ትርጉም': 'ሃጥያት',
      'name': ' Zambi                     ንባብ: ዘምቢ',
    },
    {
      'id': 565,
      'ትርጉም': 'ምህረት',
      'name': ' Qafuuta (cabti)               ንባብ: አፍኡቲ/ሃብቲ	',
    },
    {
      'id': 566,
      'ትርጉም': 'የትያትር መድረክ',
      'name': 'Ranse booxa              ንባብ: ራንሴ ቦአራ	',
    },
    {
      'id': 567,
      'ትርጉም': 'መካከለኛ ሞገድ',
      'name': ' fanti makra                    ንባብ: ፋንቲ ማክራ',
    },
    {
      'id': 568,
      'ትርጉም': 'ከያኒ',
      'name': ' Ranse abeyna                     ንባብ: ራንሴ አቤና',
    },
    {
      'id': 569,
      'ትርጉም': 'ፎቶግራፍ',
      'name': ' Taswiiri                         ንባብ: ታስዊኢሪ',
    },
    {
      'id': 570,
      'ትርጉም': 'ፎቶ አንሺ',
      'name': ' Taswiir ugse                      ንባብ: ታስዊኢር ኡግሴ	',
    },
    {
      'id': 571,
      'ትርጉም': 'ሬዲዮ',
      'name': ' Raadiyo                ንባብ: ራአድዮ	',
    },
    {
      'id': 572,
      'ትርጉም': 'ቴፕ',
      'name': ' Musajjlala                        ንባብ: ሙስጅጃላ        '
    },
    {
      'id': 573,
      'ትርጉም': 'የቴፕ ክር',
      'name': ' Qaglata                      ንባብ: ግጋላታ',
    },
    {
      'id': 574,
      'ትርጉም': 'ሬድዮ ጣቢያ',
      'name': ' Radiyo maglla                           ንባብ: ራአዲዮ ማግልላላ	',
    },
    {
      'id': 575,
      'ትርጉም': 'ቴሌቭዚን',
      'name': ' Televiziyoonu                  ንባብ: ቴሌቪዚዮአኒ',
    },
    {
      'id': 576,
      'ትርጉም': 'ቪዲዮ',
      'name': 'Viidiyo                 ንባብ: ቪዲዮ	 ',
    },
    {
      'id': 577,
      'ትርጉም': 'አጭር ሞገድ',
      'name': ' ux makra                      ንባብ: ኡድ ማክራ	',
    },
    {
      'id': 578,
      'ትርጉም': 'ረጅም ሞገድ',
      'name': ' xer makra             ንባብ: ዴር ማክራ	',
    },
    {
      'id': 579,
      'ትርጉም': 'ዜና',
      'name': ' xaagu                       ንባብ: ዳአጉ',
    },
    {
      'id': 580,
      'ትርጉም': 'ጋዜጠኛ',
      'name': ' xaagu qawe              ንባብ: ዳአጉ አዌ',
    },
    {
      'id': 581,
      'ትርጉም': 'የውጭ ዜና',
      'name': ' iro xaaagu                      ንባብ: ኢሮ ዳአጉ	',
    },
    {
      'id': 582,
      'ትርጉም': 'የሐገር ውስጥ ዜና',
      'name': ' baaxoh addah xaagu                        ንባብ: ባአሮህ አድዳህ ዳጉ	',
    },
    {
      'id': 583,
      'ትርጉም': 'ፕሮግራም',
      'name': ' Taddiira                       ንባብ: ታዱዲኢራ',
    },
    {
      'id': 584,
      'ትርጉም': 'ጋዜጣ',
      'name': ' Maybalaalaqa          ንባብ: ማይባላአላዓ',
    },
    {
      'id': 585,
      'ትርጉም': 'መጽሄት',
      'name': ' Majallata                           ንባብ: ማጃልላታ	',
    },
    {
      'id': 586,
      'ትርጉም': 'አንቀጽ',
      'name': ' Ammunta                      ንባብ: አምሙንታ	ርዕስ ',
    },
    {
      'id': 587,
      'ትርጉም': 'የዜና ምንጭ',
      'name': ' Xaagi  raceyna              ንባብ: ዳአጊ ራሄይና	',
    },
    {
      'id': 588,
      'ትርጉም': 'ዜና አስተላላፊ',
      'name': 'xaagu ruube                         ንባብ: ዳጉ ሩኡቤ ',
    },
    {
      'id': 589,
      'ትርጉም': 'ባህሪይ',
      'name': ' Weelo                   ንባብ: ዌኤሎ',
    },
    {
      'id': 590,
      'ትርጉም': 'ቀለም',
      'name': ' Bisu                    ንባብ: ቢሱ	',
    },
    {
      'id': 591,
      'ትርጉም': 'ጥቁር',
      'name': ' Diti                     ንባብ: ዲቲ',
    },
    {
      'id': 592,
      'ትርጉም': 'ነጭ',
      'name': ' Qidi              ንባብ: ኢዲ',
    },
    {
      'id': 593,
      'ትርጉም': 'ቀይ',
      'name': ' Qisi                                   ንባብ:ኢሲ'
    },
    {
      'id': 594,
      'ትርጉም': 'አረንጓዴ',
      'name': ' Inxixi                      ንባብ: ኢንዲዲ'
    },
    {
      'id': 595,
      'ትርጉም': 'ሰማያዊ',
      'name': ' Kuclinaana                    ንባብ: ኩህሊናና',
    },
    {
      'id': 596,
      'ትርጉም': 'ጠይም',
      'name': ' Caawinaana                 ንባብ: ሃዊናአና',
    },
    {
      'id': 597,
      'ትርጉም': 'ቢጫ',
      'name': ' Walqinaana                   ንባብ: ዋልኢናአና',
    },
    {
      'id': 598,
      'ትርጉም': 'ደደብ',
      'name': ' Saxxana                     ንባብ: ሳድዳና	',
    },
    {
      'id': 599,
      'ትርጉም': 'ብልህ',
      'name': ' Bayyana                ንባብ: ባይያና	',
    },
    {
      'id': 600,
      'ትርጉም': 'ረሃብ',
      'name': ' Qululu                 ንባብ: ዑሉሉ',
    },
    {
      'id': 601,
      'ትርጉም': 'የተጠማ',
      'name': ' Bakarli               ንባብ: ባካርሊ',
    },
    {
      'id': 602,
      'ትርጉም': 'ቆንጆ',
      'name': ' Qarmoqo                    ንባብ: ዓርምዖ	',
    },
    {
      'id': 603,
      'ትርጉም': 'አስቀያሚ',
      'name': ' Qaxuumo                ንባብ: ዓራኡም',
    },
    {
      'id': 604,
      'ትርጉም': 'ጠማማ',
      'name': 'Gabcu               ንባብ: ጋብሁ',
    },
    {
      'id': 605,
      'ትርጉም': 'ቀጥተኛ',
      'name': ' kareero                    ንባብ: ካራኤሮ	',
    },
    {
      'id': 606,
      'ትርጉም': 'ጠላት',
      'name': ' Naqboyta            ንባብ: ናዕቦይታ',
    },
    {
      'id': 607,
      'ትርጉም': 'ወዳጅ',
      'name': ' Kacnoyta                          ንባብ: ካህኖይታ',
    },
    {
      'id': 608,
      'ትርጉም': 'ታማኝ',
      'name': ' Aamantili                  ንባብ: አማንቲሊ',
    },
    {
      'id': 609,
      'ትርጉም': 'ሌባ',
      'name': ' Garqa                                 ንባብ: ገርዓ	',
    },
    {
      'id': 610,
      'ትርጉም': 'ጀግና	',
      'name': ' Agiru                      ንባብ: አጊሩ',
    },
    {
      'id': 611,
      'ትርጉም': 'ፈሪ',
      'name': ' Qabal                    ንባብ: 	ዓባል ',
    },
    {
      'id': 612,
      'ትርጉም': 'ዕውነተኛ',
      'name': ' Nummeena                      ንባብ: ኑሞሜይና	',
    },
    {
      'id': 613,
      'ትርጉም': 'ውሸታም',
      'name': ' Dirabli                                   ንባብ: ዲራብሊ',
    },
    {
      'id': 614,
      'ትርጉም': 'ምሁር',
      'name': ' Mixigi                             ንባብ: ሚዲጊ	',
    },
    {
      'id': 615,
      'ትርጉም': 'አትታላይ',
      'name': ' Lawisi                        ንባብ: ላዊሲ',
    },
    {
      'id': 616,
      'ትርጉም': 'አዋቂ',
      'name': ' Kasloyta                         ንባብ: ካስሎይታ',
    },
    {
      'id': 617,
      'ትርጉም': 'እብድ',
      'name': ' cabuli                              ንባብ: ሃቡሊ',
    },
    {
      'id': 618,
      'ትርጉም': 'ፈጣን',
      'name': ' sissiko                       ንባብ: ሲሲኮ',
    },
    {
      'id': 619,
      'ትርጉም': 'ዘገምተኛ',
      'name': ' Qilso(Dokkoowe)                          ንባብ:	ዒልሶ（ዶክኮዌ）',
    },
    {
      'id': 620,
      'ትርጉም': 'ቀልጣፋ',
      'name': ' Faranili(Gabtafili)                           ንባብ: ፋራኒሊ（ጋብታፍሊ）',
    },
    {
      'id': 621,
      'ትርጉም': 'ሰነፍ',
      'name': ' Tutaanuli                         ንባብ: ቱታኑሊ	',
    },
    {
      'id': 622,
      'ትርጉም': 'ኩራተኛ',
      'name': ' Kaxxiinaytu                 ንባብ: ካድድናይቱ	 ',
    },
    {
      'id': 623,
      'ትርጉም': 'ትሁት',
      'name': ' Caddili(Cismatli)                   ንባብ: ሃድዲዳሊ（ሂስማትሊ）',
    },
    {
      'id': 624,
      'ትርጉም': 'ንጹህ',
      'name': ' Saytun                       ንባብ: ሰይቱን',
    },
    {
      'id': 625,
      'ትርጉም': 'ቆሻሻ',
      'name': ' Xaqata(Wasaka)                ንባብ: ዳዓታ（ዋሳክ/ኡጉፉ）',
    },
    {
      'id': 626,
      'ትርጉም': 'ደስተኛ',
      'name': ' Ruffali                    ንባብ: ሩፍፋሊ',
    },
    {
      'id': 627,
      'ትርጉም': 'ሐዘንተኛ',
      'name': ' Rookali               ንባብ: ሮኮሊ	',
    },
    {
      'id': 628,
      'ትርጉም': 'ከባድ',
      'name': ' Qilsi(Gibidi)                ንባብ: ኢልሲ（ጊቢዲ）',
    },
    {
      'id': 629,
      'ትርጉም': 'ቀላል',
      'name': ' Qilsamali(Xoctili)              ንባብ: ዒልሳመሊ（ዶህቲሊ）',
    },
    {
      'id': 631,
      'ትርጉም': 'ግልፍተኛ',
      'name':
          ' Naqabixaynali(Bagcarrale)                   ንባብ: ነዕቢዳይነሊ（ባግሃርራሊ）',
    },
    {
      'id': 632,
      'ትርጉም': 'ቆንቋና፣ንፉግ',
      'name': ' Cillaaleli                ንባብ: ሂልላሌሊ',
    },
    {
      'id': 633,
      'ትርጉም': 'ቸር',
      'name': ' Macawa(cindali)                   ንባብ: ማሃዋ（ሂንዳሊ）',
    },
    {
      'id': 634,
      'ትርጉም': 'ጠንካራ',
      'name': ' Maqarli(Diggali/Ligdoli)               ንባብ: ማዓርሊ（ድግጋ/ሊግዶሊ）',
    },
    {
      'id': 635,
      'ትርጉም': 'ደካማ',
      'name': ' Boolali(Taanoyta)           ንባብ: ቦኦላሊ（ታአኖይታ）',
    },
    {
      'id': 636,
      'ትርጉም': 'ትልቅ',
      'name': 'Naba             ንባብ: ነባ	',
    },
    {
      'id': 637,
      'ትርጉም': 'ትንሽ',
      'name': ' Qunxa              ንባብ: ኡንዳ',
    },
    {
      'id': 638,
      'ትርጉም': 'አጭር',
      'name': ' uxxi              ንባብ: ኡድዲ',
    },
    {
      'id': 639,
      'ትርጉም': ' ረዝም',
      'name': ' Xer               ንባብ: ዴር	',
    },
    {
      'id': 640,
      'ትርጉም': 'ሰፊ',
      'name': ' Fidin            ንባብ: ፊዲን',
    },
    {
      'id': 641,
      'ትርጉም': 'ጠባብ',
      'name': ' ceyina             ንባብ: ሄይና',
    },
    {
      'id': 642,
      'ትርጉም': 'ባዶ',
      'name': ' foyya           ንባብ: ፎይያ',
    },
    {
      'id': 643,
      'ትርጉም': 'ሙሉ',
      'name': ' Kibu             ንባብ: ኪቡ',
    },
    {
      'id': 644,
      'ትርጉም': 'ወፍራም',
      'name': ' Gabulle(Masule)                   ንባብ: ጉቡልሊ（ሙሱሌ）',
    },
    {
      'id': 645,
      'ትርጉም': 'ቀጭን',
      'name': 'Cabbole(Qakule)                ንባብ: ሃብቦሊ（ዓኩሊ）',
    },
    {
      'id': 646,
      'ትርጉም': 'ወንዴ ',
      'name': ' Lab                ንባብ:	ላብ  ',
    },
    {
      'id': 647,
      'ትርጉም': 'ሴቴ',
      'name': ' say                 ንባብ: ሰይ	',
    },
    {
      'id': 648,
      'ትርጉም': 'ሶስት ማዕዘን',
      'name': ' Sidiica gona            ንባብ: ሲዲኢሃ ጎና',
    },
    {
      'id': 649,
      'ትርጉም': 'አራት ማዕዘን',
      'name': ' Affara gona              ንባብ: አፋራ ጎና ',
    },
    {
      'id': 650,
      'ትርጉም': 'መስማት የተሳነው',
      'name': ' Xangi mali                   ንባብ: ደንጊ መሊ	',
    },
    {
      'id': 651,
      'ትርጉም': 'ማየት የተሳነው',
      'name': 'Gonnna(Intimali)                    ንባብ: ጎንና（ኢንቲ መሊ）',
    },
    {
      'id': 652,
      'ትርጉም': 'ዱዳ',
      'name': ' Duuda                      ንባብ: ዱኡዳ	',
    },
    {
      'id': 653,
      'ትርጉም': 'መላጣ',
      'name': ' Bidaaru                   ንባብ: ቢዳሩ',
    },
    {
      'id': 654,
      'ትርጉም': 'ሽራፊ',
      'name': ' Gaafu                    ንባብ: ጋአፋ	',
    },
    {
      'id': 655,
      'ትርጉም': 'ዕርጉም',
      'name': ' Abaaroli                            ንባብ: አባሮሊ',
    },
    {
      'id': 656,
      'ትርጉም': 'ጤና',
      'name': ' Qaafiyata                                      ንባብ: ዓአፊያት',
    },
    {
      'id': 657,
      'ትርጉም': '	ሕመም',
      'name': ' Biyak                     ንባብ: ቢያክ',
    },
    {
      'id': 658,
      'ትርጉም': 'በሽታ',
      'name': ' Lakima                  ንባብ: ላኪማ ',
    },
    {
      'id': 659,
      'ትርጉም': 'መድሐኒት（ሕክምና）',
      'name': ' Dayla                              ንባብ: ዳይላ',
    },
    {
      'id': 660,
      'ትርጉም': 'ምርመራ（ሕክምና）',
      'name':
          ' Aqayyaare(Fookkaqo)                                  ንባብ: አዓይያአሬ（ፎክካዖ）',
    },
    {
      'id': 661,
      'ትርጉም': 'ምርመራ（ትንተና）',
      'name': ' Makeelo                               ንባብ: ማኬኤሎ ',
    },
    {
      'id': 662,
      'ትርጉም': ' መድኃኒት ቤት（ፋርማሲ）',
      'name': ' Diwa                         ንባብ: ድዋ	',
    },
    {
      'id': 663,
      'ትርጉም': 'ላቦራቶሪ',
      'name': ' Diwa dukkaana                    ንባብ: ደዋ ዱክካና	',
    },
    {
      'id': 664,
      'ትርጉም': 'ቀዶ ህክምና',
      'name': ' Makeelo daasa                      ንባብ: ማኬኤ ዳአስ',
    },
    {
      'id': 665,
      'ትርጉም': 'ሃኪም',
      'name': ' Ricdek cixxa                        ንባብ: ሪህዴክ ሂድዳ ',
    },
    {
      'id': 666,
      'ትርጉም': '（ለሴት）',
      'name': ' Madliina                       ንባብ: ሂኪሚ	አስታማሚ',
    },
    {
      'id': 667,
      'ትርጉም': 'ራጅ(x-ray)',
      'name': ' Raaji                    ንባብ: ራአጂ	',
    },
    {
      'id': 667,
      'ትርጉም': 'ቀዶ ጠጋኝ',
      'name': ' Qanxiseena                   ንባብ: ዓንዲሴይና	',
    },
    {
      'id': 668,
      'ትርጉም': 'ማገገም',
      'name': ' Angadaada                     ንባብ: አንገዳኣዳ',
    },
    {
      'id': 669,
      'ትርጉም': 'ራስ ምታት',
      'name': ' Amo beera                     ንባብ: አሞቤርራ	',
    },
    {
      'id': 670,
      'ትርጉም': 'ዕብጠት',
      'name': ' Dudduba                           ንባብ: ዱድዱባ	',
    },
    {
      'id': 671,
      'ትርጉም': 'ጉንፋን',
      'name': ' Gosonu                   ንባብ: ጎሱኑ',
    },
    {
      'id': 672,
      'ትርጉም': 'ወባ',
      'name': ' Qaso                    ንባብ: ዓሶ	',
    },
    {
      'id': 673,
      'ትርጉም': 'ቁስል',
      'name': ' dale                   ንባብ: ዳሌ',
    },
    {
      'id': 674,
      'ትርጉም': 'ተቅማጥ',
      'name': ' Baggexo              ንባብ: ባግጌፎ	',
    },
    {
      'id': 675,
      'ትርጉም': '（ኪንታሮት）',
      'name':
          ' Baasuuru(Boooraqi)                            ንባብ: ባኣሱር（ቦኦራዲ）	ሬባ',
    },
    {
      'id': 676,
      'ትርጉም': 'ልብ ምት（ሕመም）',
      'name': ' Lubbidabala                ንባብ: ሉቢዳባላ',
    },
    {
      'id': 677,
      'ትርጉም': 'ሳንባ ነቀርሳ',
      'name': ' Labha                        ንባብ: doore	ላብሃ ዶኦሬ ',
    },
    {
      'id': 678,
      'ትርጉም': 'ሳል',
      'name': ' Kacuw                     ንባብ: ካሁው	',
    },
    {
      'id': 679,
      'ትርጉም': '	መዳን',
      'name': ' Uriyya(Waddiimiyya)                 ንባብ: ኡሪይያ（ዋድዲሚይያ）',
    },
    {
      'id': 680,
      'ትርጉም': ' ሆስፒታል',
      'name': ' Kaxxa daktra              ንባብ: ካድዳ ደክታራ',
    },
    {
      'id': 681,
      'ትርጉም': 'ክሊኒክ',
      'name': 'Kiliiniki       ንባብ: ክሊኒኪ',
    },
    {
      'id': 682,
      'ትርጉም': 'ክትባት',
      'name': ' Ixo(Aftabu)                       ንባብ: ኢዶ（አፍተቡ）	',
    },
    {
      'id': 683,
      'ትርጉም': 'አዋላጅ',
      'name': 'Ullatina               ንባብ: ኡልላትኢና  ',
    },
    {
      'id': 684,
      'ትርጉም': 'መርፌ',
      'name': ' Ibra(Erba)                 ንባብ: ኢርባ（ኤርባ）',
    },
    {
      'id': 685,
      'ትርጉም': 'ኪኒን',
      'name': ' Kaniina                        ንባብ: ካኒኢና',
    },
    {
      'id': 686,
      'ትርጉም': 'ጉሉኮስ',
      'name': ' Koxxa                      ንባብ: ኮድዳ ',
    },
    {
      'id': 687,
      'ትርጉም': 'ፋሻ（የቁስል）',
      'name': 'Baasima            ንባብ: ባሲማ	',
    },
    {
      'id': 688,
      'ትርጉም': 'መጠገን（የ አጥንት）',
      'name': ' MAygarrama(xakaba)                 ንባብ: ማይገርራማ（ዳካባ）',
    },
    {
      'id': 689,
      'ትርጉም': 'መመርቀዝ（ኢንፌክሽን）',
      'name': ' Umaala                           ንባብ: ኡማላ',
    },
    {
      'id': 690,
      'ትርጉም': 'ወረርሽኝ',
      'name': ' Quduri             ንባብ: ኡዱሪ',
    },
    {
      'id': 691,
      'ትርጉም': 'መከላከል',
      'name': ' Tocbuda                    ንባብ: ቶህቡዳ',
    },
    {
      'id': 692,
      'ትርጉም': 'መታቀብ',
      'name': ' Tiiru                  ንባብ: ቲኢሩ',
    },
    {
      'id': 693,
      'ትርጉም': 'መተማመን',
      'name': ' Balqiinu                 ንባብ: ባልዒኢኑ',
    },
    {
      'id': 694,
      'ትርጉም': 'ከትዳር ውጪ ወሲብ አለመፈፀም',
      'name': ' Balqo                   ንባብ: ባልዖ	',
    },
    {
      'id': 695,
      'ትርጉም': 'ኮንዶም',
      'name': ' Labana siba                  ንባብ: ላብና ሲባ	',
    },
    {
      'id': 696,
      'ትርጉም': 'ሕግ',
      'name': ' Madqa              ንባብ: ማድዓ',
    },
    {
      'id': 697,
      'ትርጉም': 'ፍትህ',
      'name': ' Qadli                     ንባብ: ዓድሊ',
    },
    {
      'id': 698,
      'ትርጉም': 'ፍርድ ቤት፣ዛፍ',
      'name': ' Caxa                        ንባብ: ሐራ	',
    },
    {
      'id': 699,
      'ትርጉም': 'ዳኛ',
      'name': ' Garkure              ንባብ: ገር ኩሬ  ',
    },
    {
      'id': 700,
      'ትርጉም': 'ክስ',
      'name': 'Wayto(Malkiti)                  ንባብ: ዋይቶ（ማልኪቲ）    ',
    },
    {
      'id': 701,
      'ትርጉም': 'ክርክር',
      'name': ' Xaawa(Gaaroowu)               ንባብ: ዳኣዋ（ጋኣሮው）',
    },
    {
      'id': 702,
      'ትርጉም': 'ወንጀለኛ',
      'name': ' Baatileena                 ንባብ: ባአቲሌይና ',
    },
    {
      'id': 703,
      'ትርጉም': 'ነፃ（ከወንጀል）',
      'name': ' Bari(Aslaga)                 ንባብ: ባሪ（አስለገ）',
    },
    {
      'id': 704,
      'ትርጉም': 'ተጠርጣሪ',
      'name': ' Daremsime                   ንባብ: ዳሬምሲሜ ',
    },
    {
      'id': 705,
      'ትርጉም': 'ሐኪም',
      'name': ' Cakiimi            ንባብ: ሃኪሚ',
    },
    {
      'id': 706,
      'ትርጉም': 'የልጅ ልጅ（ሴት）',
      'name': ' absuma                   ንባብ: a	አብሱማእ	',
    },
    {
      'id': 707,
      'ትርጉም': 'የ አባት እህት ልጅ（ሴት）',
      'name': 'Absuma`a	              ንባብ: አብሱማእ',
    },
    {
      'id': 708,
      'ትርጉም': 'ወንጀል',
      'name': ' Baatili            ንባብ: ባቲሊ',
    },
    {
      'id': 709,
      'ትርጉም': 'ፍርድ',
      'name': ' Garkuro(Kurma)               ንባብ: ገርኩሮ（ኩርማ） 	  ',
    },
    {
      'id': 710,
      'ትርጉም': 'የመወሰን ድንበር',
      'name': ' Garkuro xikka            ንባብ: ገርኩሮህድክካ ',
    },
    {
      'id': 711,
      'ትርጉም': 'ይግባኝ',
      'name': ' Qagfaxiti (caxakkoro)              ንባብ: ዓግፋሪቲ（ሃራክኮሮ）',
    },
    {
      'id': 712,
      'ትርጉም': 'ጠበቃ',
      'name': ' Abbokaato            ንባብ: አቦካቶ',
    },
    {
      'id': 713,
      'ትርጉም': 'ምስክር',
      'name': ' Sumaaqa             ንባብ: ሱመዓ',
    },
    {
      'id': 714,
      'ትርጉም': 'ውሳኔ',
      'name': ' Margaqa                 ንባብ: ማርገዓ ',
    },
    {
      'id': 715,
      'ትርጉም': 'ስርዓት',
      'name': ' Siira            ንባብ: ሲኢራ',
    },
    {
      'id': 716,
      'ትርጉም': 'ድንጋጌ',
      'name': ' Wano               ንባብ: ዋኖ',
    },
    {
      'id': 717,
      'ትርጉም': 'ማስረጃ',
      'name': ' Wadu             ንባብ: ዋዱ	',
    },
    {
      'id': 718,
      'ትርጉም': 'ፍትሐ ብሄር',
      'name': ' Mqem               ንባብ: bara	ሜኤም ባራ ',
    },
    {
      'id': 719,
      'ትርጉም': 'ገደብ',
      'name': ' Waado                                    ንባብ: ዋዶ',
    },
    {
      'id': 720,
      'ትርጉም': 'ዕርከን',
      'name': ' Raawa                 ንባብ: ራአዊ',
    },
    {
      'id': 721,
      'ትርጉም': 'ትዕዛዝ',
      'name': ' Amri                 ንባብ: አምሪ ',
    },
    {
      'id': 722,
      'ትርጉም': 'ፍቃድ',
      'name': ' Idini                 ንባብ: ኢድኒ',
    },
    {
      'id': 723,
      'ትርጉም': 'ሓላፊነት',
      'name': ' Mixxaaginnu             ንባብ: ሚድዳጊንኑ	',
    },
    {
      'id': 724,
      'ትርጉም': 'ጥምረት',
      'name': ' Xammaala                   ንባብ: ደምማአላ	',
    },
    {
      'id': 725,
      'ትርጉም': 'ሰበር ችሎት',
      'name': ' Buruk caxa                     ንባብ: ቡሩክ ሃራ  ',
    },
    {
      'id': 726,
      'ትርጉም': '	የ አስቸኳይ ጊዜ አዋጅ',
      'name':
          ' Xacaacekali caalata                                ንባብ: ዳሃአሄካሊ ሃላታ',
    },
    {
      'id': 727,
      'ትርጉም': 'መሰረት',
      'name': ' Sido                                ንባብ: ሲዶ',
    },
    {
      'id': 728,
      'ትርጉም': 'ሰነድ',
      'name': ' Sannda                               ንባብ: ሰንዳ',
    },
    {
      'id': 729,
      'ትርጉም': 'ማንፀባረቅ',
      'name': ' Abaabisiyya                        ንባብ: አባአቢሲይያ',
    },
    {
      'id': 730,
      'ትርጉም': 'መስፈርት',
      'name': ' Keexeena                   ንባብ: ኬኤሬኤና',
    },
    {
      'id': 731,
      'ትርጉም': 'ክፍያ',
      'name': ' Gidiyi                    ንባብ: ጊዲይ ',
    },
    {
      'id': 732,
      'ትርጉም': 'ቅጅ',
      'name': ' qulo                     ንባብ: ዑሎ  ',
    },
    {
      'id': 733,
      'ትርጉም': 'ጥሎሽ',
      'name': ' Alkumu                     ንባብ: አልኩሙ',
    },
    {
      'id': 734,
      'ትርጉም': 'ማጨት',
      'name': ' Fayxi               ንባብ: ፊይሪ',
    },
    {
      'id': 735,
      'ትርጉም': 'ቃል ኪዳን',
      'name': ' Gennaqo                       ንባብ: ጌንናዖ	ኒካሕ፣ ',
    },
    {
      'id': 736,
      'ትርጉም': 'ሰርግ',
      'name': ' Digibi                     ንባብ: ዲጊቢ',
    },
    {
      'id': 737,
      'ትርጉም': 'ሙሽራ',
      'name': ' Qaruusu                      ንባብ: ዓሩሱ',
    },
    {
      'id': 738,
      'ትርጉም': 'ሙሽሪት',
      'name': 'Qbna	                    ንባብ: ዒብና  ',
    },
    {
      'id': 739,
      'ትርጉም': 'ማዓንዳ	ሚዜ',
      'name': ' Aligge/Qarus maqanxa                      ንባብ: አሊጌ/ዓሩስ ',
    },
    {
      'id': 740,
      'ትርጉም': 'ሴት ሚዜ',
      'name': ' Aliggeyta/Akutta                 ንባብ: አሊጌይታ አኩትታ ',
    },
    {
      'id': 741,
      'ትርጉም': 'ሙሽሪትን መውሰድ',
      'name': 'Orobi          ንባብ: አሮብ',
    },
    {
      'id': 742,
      'ትርጉም': 'መልስ',
      'name': ' Koofaxa gacsa         ንባብ: ኮኦፍራክ  ጋሃሳ',
    },
    {
      'id': 743,
      'ትርጉም': 'ሠርገኛ',
      'name': 'Balla/Qarusso                ንባብ: ባልላ/ዓሩስሦ	',
    },
    {
      'id': 744,
      'ትርጉም': 'ከሙሽራ ወገን ሰርገኛ',
      'name': ' Waradddi                ንባብ: ዋራድዲ ',
    },
    {
      'id': 745,
      'ትርጉም': 'ከሙሽሪት ወገን ሰርገኛ',
      'name': ' Kanaddi            ንባብ: ካናድዲ',
    },
    {
      'id': 746,
      'ትርጉም': 'የሰርግ አስተዋጾ',
      'name': ' Cali                ንባብ: ሃሊ	 ',
    },
    {
      'id': 747,
      'ትርጉም': 'ፍቺ',
      'name': ' Cabti           ንባብ: ሃብቲ',
    },
    {
      'id': 748,
      'ትርጉም': 'ቅናት',
      'name': ' Aysuna/Aysinu                ንባብ: አይሱና（አይሱኑ）',
    },
    {
      'id': 749,
      'ትርጉም': 'ሬሳ',
      'name': ' Raysa/Lafa/              ንባብ: ራይሳ/ለፋ',
    },
    {
      'id': 750,
      'ትርጉም': 'ሬሳን ማጠብ',
      'name': ' Raysi kaqaylo           ንባብ: ራይሲ ከዓይሎ',
    },
    {
      'id': 751,
      'ትርጉም': 'ከፈን',
      'name': ' Kafana          ንባብ: ከፋና',
    },
    {
      'id': 752,
      'ትርጉም': 'ቀብር',
      'name': 'Maagaqa              ንባብ: ማአጋዓ',
    },
    {
      'id': 753,
      'ትርጉም': 'ቀብር ስነስርዓት',
      'name': ' Maagaqa           ንባብ: ማአጋዓ ፊድሶ',
    },
    {
      'id': 754,
      'ትርጉም': 'ፊድሶ	ለቅሶ',
      'name': 'Fiddima fidso                    ንባብ: ፊድዲማ',
    },
    {
      'id': 755,
      'ትርጉም': 'ተዝካር',
      'name': ' Rabeyna               ንባብ: ራብይና ',
    },
    {
      'id': 756,
      'ትርጉም': 'የለቅሶ ጊዜ አስተዋጾ',
      'name': ' Kura                ንባብ: ኩራ',
    },
    {
      'id': 757,
      'ትርጉም': 'ባል የሞተባት ሴት',
      'name': ' Gubna                      ንባብ: ጉብና',
    },
    {
      'id': 758,
      'ትርጉም': 'አንገል',
      'name': ' Agala                  ንባብ: አጋላ',
    },
    {
      'id': 759,
      'ትርጉም': 'የቲሞች',
      'name': 'Qayxiixa                    ንባብ: ዓይዴድ',
    },
    {
      'id': 760,
      'ትርጉም': 'ውርስ',
      'name': ' Nagra                 ንባብ: ናግራ ',
    },
    {
      'id': 761,
      'ትርጉም': 'ለቅሶ ማልቀስ',
      'name': 'Buuke(booge)             ንባብ: ቡኡኬ（ቦጌ）',
    },
    {
      'id': 762,
      'ትርጉም': 'ሐዘን',
      'name': 'Arka                 ንባብ: አርከ',
    },
    {
      'id': 763,
      'ትርጉም': 'ማፅናናት',
      'name': 'Taqziyya                 ንባብ: ታዕዚይያ  ',
    },
    {
      'id': 764,
      'ትርጉም': 'ፍታት',
      'name': ' Ginaaza salaata               ንባብ:	ጊናዛ ሳላት',
    },
    {
      'id': 765,
      'ትርጉም': 'ዕርሻ',
      'name': ' Buqre             ንባብ: ቡዕሬ',
    },
    {
      'id': 766,
      'ትርጉም': 'አዝመራ',
      'name': ' Gawra                 ንባብ: ጋዕሬ ',
    },
    {
      'id': 767,
      'ትርጉም': 'ማሳ',
      'name': ' Xage                     ንባብ:ዳጌ	',
    },
    {
      'id': 768,
      'ትርጉም': 'ቦይ',
      'name': ' Baayuru                    ንባብ: ባዮሩ',
    },
    {
      'id': 769,
      'ትርጉም': 'ወሃ ማቆሪያ',
      'name': ' Duuga/Dabiri/         ንባብ: ዱጋ /ዳቢሪ',
    },
    {
      'id': 770,
      'name':
          ' Saddi/bicsenkalu/                    ንባብ: ሳዳዲ/ቢህሴንኩሉ                ',
    },
    {
      'id': 771,
      'ትርጉም': 'ምርት',
      'name': 'Murti    ንባብ: ሙርቲ  ',
    },
    {
      'id': 772,
      'ትርጉም': 'ገበሬ',
      'name': ' Buqraabe            ንባብ: ቡዕራቤ',
    },
    {
      'id': 773,
      'ትርጉም': 'ድርቅ',
      'name': ' Qabaara                    ንባብ: ዓባራ',
    },
    {
      'id': 774,
      'ትርጉም': 'ውሃ ማጥለቅለቅ',
      'name': ' Leekora               ንባብ: ሌኮራ  ',
    },
    {
      'id': 775,
      'ትርጉም': 'መንግስት እርሻ',
      'name': ' Doolat buqre           ንባብ: ደላት ቡኡሬ',
    },
    {
      'id': 776,
      'ትርጉም': 'የማህበር እርሻ',
      'name': ' Egla buqre                   ንባብ: ኤግላ ቡኡሬ ',
    },
    {
      'id': 777,
      'ትርጉም': 'ማረስ ማለስለስ',
      'name': ' Cagay buqre                   ንባብ: ሃጋይ ቡዕሬ	',
    },
    {
      'id': 778,
      'ትርጉም': 'መዝራት',
      'name': 'Kooqaaro             ንባብ: ኮዓሮ ',
    },
    {
      'id': 779,
      'ትርጉም': 'የ እርሻ መሳሪያዎች',
      'name': ' Buqre mqnsoofa               ንባብ: ቡኡሬ ማንሶፋ ',
    },
    {
      'id': 780,
      'ትርጉም': 'ምርት መሰብሰብ',
      'name': ' Murti orba             ንባብ: ሙርቲ ኦርባ	',
    },
    {
      'id': 781,
      'ትርጉም': 'ጎተራ',
      'name': ' Riigi                  ንባብ: ሪኢጊ',
    },
    {
      'id': 782,
      'ትርጉም': 'ማዳበሪያ',
      'name': ' Sasnisa           ንባብ: ሳስኒሳ',
    },
    {
      'id': 783,
      'ትርጉም': 'አርብቶ አደርነት ',
      'name': ' Dacarsitto          ንባብ: ዳሃርሲትቶ',
    },
    {
      'id': 784,
      'ትርጉም': 'ዕንስሳት',
      'name': ' Saqa          ንባብ: ሳአ',
    },
    {
      'id': 785,
      'ትርጉም': 'ለም መሬት',
      'name': ' Kalo        ንባብ: ካሎ',
    },
    {
      'id': 786,
      'ትርጉም': 'ለግጦሽ ስምሪት',
      'name': ' Duwa/Dacara              ንባብ: ድውእ/ዳሃራ',
    },
    {
      'id': 787,
      'ትርጉም': 'እረኛ',
      'name': ' Saqduwe                          ንባብ: ሳዕዱዌ ',
    },
    {
      'id': 788,
      'ትርጉም': 'ማርባት',
      'name': ' Aydorra                    ንባብ: አይዶርራ',
    },
    {
      'id': 789,
      'ትርጉም': 'አራጅ',
      'name': ' Niyyayse                  ንባብ: ኒያይሴ ',
    },
    {
      'id': 790,
      'ትርጉም': 'ማለብ',
      'name': ' Xiglo         ንባብ: ዲግሎ',
    },
    {
      'id': 791,
      'ትርጉም': 'መናጥ',
      'name': ' Ruko              ንባብ: ሩኮ	',
    },
    {
      'id': 792,
      'ትርጉም': 'ሌጋ ቅቤ',
      'name': ' Mutuku               ንባብ: ሙትኮ',
    },
    {
      'id': 793,
      'ትርጉም': 'ማረድ',
      'name': ' Niyya                  ንባብ: ኒይያ',
    },
    {
      'id': 794,
      'ትርጉም': 'ልምላሜ',
      'name': ' Akada              ንባብ: አክዳ',
    },
    {
      'id': 795,
      'ትርጉም': 'ጥጋብ',
      'name': ' Cayi               ንባብ: ሃይ',
    },
    {
      'id': 796,
      'ትርጉም': 'ወጪ',
      'name': ' awqenta                    ንባብ: አውኤንተ',
    },
    {
      'id': 797,
      'ትርጉም': ' ኢንዱስትሪ',
      'name': ' Kuuru                 ንባብ: ኩኡሩ',
    },
    {
      'id': 798,
      'ትርጉም': 'እንድስትሪ ማስፋፋት',
      'name': ' Kuuriino            ንባብ: ኩሪኖ      ',
    },
    {
      'id': 799,
      'ትርጉም': 'ወዛደር',
      'name': ' xoooquh xiina            ንባብ: ዶዓህ ዲና',
    },
    {
      'id': 800,
      'ትርጉም': 'ሰራተኛ ማህበር',
      'name': ' Sandiika                    ንባብ: ሳንዲካ',
    },
    {
      'id': 801,
      'ትርጉም': 'ኢንጅነር',
      'name': ' Mahandis                   ንባብ: ማሃንዲሳ',
    },
    {
      'id': 802,
      'ትርጉም': 'ቴክኒክ',
      'name': ' Mattebannu                       ንባብ: ማቴባንኑ',
    },
    {
      'id': 803,
      'ትርጉም': 'ፋብሪካ',
      'name': ' Kuurtiina                         ንባብ: ኩርቲና ',
    },
    {
      'id': 804,
      'ትርጉም': 'ሙያ',
      'name': ' Mehrata                    ንባብ: ሜህራታ',
    },
    {
      'id': 805,
      'ትርጉም': 'የሞያ ብቃት',
      'name': ' Naggarinna                   ንባብ: ናግጋሪና',
    },
    {
      'id': 806,
      'ትርጉም': 'ባለሙያ',
      'name': ' Naggaara                    ንባብ: ናግጋራ',
    },
    {
      'id': 807,
      'ትርጉም': 'ጥሬ ዕቃ',
      'name': ' Qasin duyye                   ንባብ: ዓሲን ዱያዬ',
    },
    {
      'id': 808,
      'ትርጉም': 'ሮቦት',
      'name': ' Robootu                  ንባብ: ሮቦቱ',
    },
    {
      'id': 809,
      'ትርጉም': 'ጋራዝ',
      'name': ' Garaaja                            ንባብ: ጋራዝ',
    },
    {
      'id': 810,
      'ትርጉም': 'ጋዝ',
      'name': ' Gaaza                 ንባብ: ጋዛ	',
    },
    {
      'id': 811,
      'ትርጉም': 'መንግስት',
      'name': ' Doolata                       ንባብ: ዶአላታ',
    },
    {
      'id': 812,
      'ትርጉም': 'መስተዳድር',
      'name': ' Cokoomata                          ንባብ: ሆኮኦማታ'
    },
    {
      'id': 812,
      'ትርጉም': 'ፓርላማ',
      'name': ' Agat miglisi               ንባብ: አጋት ሚግሊሲ',
    },
    {
      'id': 813,
      'ትርጉም': 'ሕገ መንግስት',
      'name': ' Doolat Madqa/Dastuuru                 ንባብ: ዶላት ማድዓ/ዳስቱሩ',
    },
    {
      'id': 814,
      'ትርጉም': 'ሚኒስትር',
      'name': ' Malaaka                   ንባብ: ማላካ',
    },
    {
      'id': 815,
      'ትርጉም': 'ጠ/ሚኒስተር',
      'name': ' Malokti malaaka                     ንባብ: ማሎክቲ ማላካ',
    },
    {
      'id': 816,
      'ትርጉም': 'ሚኒስትሮች ም/ቤት',
      'name': 'Malokti miglisi                 ንባብ: ማሎክቲ ሚግሊሲ',
    },
    {
      'id': 817,
      'ትርጉም': 'ምክትል',
      'name': 'Banoya                     ንባብ: ባይኖያ	 ',
    },
    {
      'id': 818,
      'ትርጉም': 'ችሎት ብቃት',
      'name': ' Duddo                       ንባብ: ዱድዶ',
    },
    {
      'id': 819,
      'ትርጉም': 'ሉአላዊነት',
      'name': ' muddaqiyannu                        ንባብ: ሙድዳዒያንኑ ',
    },
    {
      'id': 820,
      'ትርጉም': 'ንጉስ',
      'name': ' Nagusu                  ንባብ: ናጉሱ ',
    },
    {
      'id': 821,
      'ትርጉም': 'ንጉሳዊ አገዛዝ',
      'name': ' Naguusannu                 ንባብ: ናጉሳንኑ',
    },
    {
      'id': 822,
      'ትርጉም': 'ንጉሰ ነገስት',
      'name': ' Illata            ንባብ: ኢልላልታ',
    },
    {
      'id': 823,
      'ትርጉም': 'የአፄ ግዛት',
      'name': ' Illati                   ንባብ: ኢልላልቲ ራሱ',
    },
    {
      'id': 824,
      'ትርጉም': 'ሹመት',
      'name': ' Reeda                  ንባብ: ሬዳ',
    },
    {
      'id': 825,
      'ትርጉም': 'ሪፐብሊክ',
      'name': ' Ummuuno                  ንባብ: ኡምሙኖ ',
    },
    {
      'id': 826,
      'ትርጉም': 'ተወካይ',
      'name': ' Awlaytu              ንባብ: አውላይቱ',
    },
    {
      'id': 827,
      'ትርጉም': 'እጩ',
      'name': ' Faxteyna                   ንባብ: ፍርቴይና ',
    },
    {
      'id': 828,
      'ትርጉም': 'አባል',
      'name': ' Adoyta                ንባብ: አዶይታ',
    },
    {
      'id': 829,
      'ትርጉም': 'መወሰን',
      'name': 'Madqiyya              ንባብ: ሚድዒይያ',
    },
    {
      'id': 830,
      'ትርጉም': 'ሕግ አውጪ',
      'name': ' Madqa tayyaqo          ንባብ: ማድዓ ታይያዖ',
    },
    {
      'id': 831,
      'ትርጉም': 'ሕግ አስፈፃሚ',
      'name': ' Madqa Arcisa             ንባብ: ማድዓ አርሂሳ',
    },
    {
      'id': 832,
      'ትርጉም': 'ፍትህ አካላት',
      'name': 'Madqaaloynisa                 ንባብ: ማድዓ ሎይኒሳ   ',
    },
    {
      'id': 833,
      'ትርጉም': 'ፓርቲ',
      'name': ' Parti                    ንባብ: ፓርቲ',
    },
    {
      'id': 834,
      'ትርጉም': 'ጉባኤ',
      'name': ' Kobxu             ንባብ: ኮቦሩ ',
    },
    {
      'id': 835,
      'ትርጉም': 'ሰብሰባ',
      'name': ' Daffeyna          ንባብ: ዳፍፈይና',
    },
    {
      'id': 836,
      'ትርጉም': 'ማዕከል',
      'name': ' Inayta    ንባብ: ኢናይታ',
    },
    {
      'id': 837,
      'ትርጉም': 'ቅርጫፍ',
      'name': ' Ludda               ንባብ: ሉድዳ',
    },
    {
      'id': 838,
      'ትርጉም': 'ምደባ',
      'name': ' Mugaaqisso              ንባብ: ሙግጋዒስሶ	',
    },
    {
      'id': 839,
      'ትርጉም': 'ክልል',
      'name': ' Rakaakaya                 ንባብ: ራካካያ	',
    },
    {
      'id': 840,
      'ትርጉም': 'ዞን',
      'name': ' Rasu               ንባብ: ራሱ	',
    },
    {
      'id': 841,
      'ትርጉም': 'ወረዳ',
      'name': ' Hoxsiyya              ንባብ: ዳዓራ',
    },
    {
      'id': 842,
      'ትርጉም': 'ቀበሌ',
      'name': ' Awda               ንባብ: አውደእ',
    },
    {
      'id': 843,
      'ትርጉም': 'ሰፈር',
      'name': ' Makefta             ንባብ: ማኬፍታ ',
    },
    {
      'id': 844,
      'ትርጉም': 'ፖሊስ',
      'name': 'Poliisi           ንባብ: ፖሊሲ ',
    },
    {
      'id': 845,
      'ትርጉም': 'እስር',
      'name': ' casibi               ንባብ: ሃሲቢ',
    },
    {
      'id': 846,
      'ትርጉም': 'እስር ቤት',
      'name': ' Casibi qari           ንባብ: ሃሲቢ አሪ	',
    },
    {
      'id': 847,
      'ትርጉም': 'ዜጋ',
      'name': ' Baaxo baxa            ንባብ: ባዶበዳ',
    },
    {
      'id': 848,
      'ትርጉም': 'ዜግነት',
      'name': ' Baaxo baxiinu              ንባብ: ባአሮብባሪኑ',
    },
    {
      'id': 849,
      'ትርጉም': 'ከተማ',
      'name': ' Magaala        ንባብ: ማጋአላ',
    },
    {
      'id': 850,
      'ትርጉም': 'ገጠር',
      'name': ' Qalta               ንባብ: ዓልታ',
    },
    {
      'id': 851,
      'ትርጉም': 'ማዘጋጃ ቤት',
      'name': ' Kallaytu           ንባብ: ከልላይቱ',
    },
    {
      'id': 852,
      'ትርጉም': 'አብላጫ',
      'name': 'Mangaba/Mula            ንባብ: ማንገባ/ሙላእ ',
    },
    {
      'id': 853,
      'ትርጉም': 'አናሳ',
      'name': ' Dago gaba           ንባብ: ዳጎ ጋባ	',
    },
    {
      'id': 854,
      'ትርጉም': 'ተቃርኖ',
      'name': ' Hilliki          ንባብ: ሂልሊኪ  ',
    },
    {
      'id': 855,
      'ትርጉም': 'ተቃራኒ',
      'name': ' sadu              ንባብ: ሳዱ  ',
    },
    {
      'id': 856,
      'ትርጉም': 'ተቃውሞ',
      'name': ' Sadiinu               ንባብ: ሳዱኒ',
    },
    {
      'id': 857,
      'ትርጉም': 'እድገት',
      'name': ' Dadala                   ንባብ: ዳዱሊ',
    },
    {
      'id': 858,
      'ትርጉም': 'ኋላ ቀርነት',
      'name': ' Wadirraqa               ንባብ: ዋዲርራዓ',
    },
    {
      'id': 859,
      'ትርጉም': 'ነፃነት',
      'name': 'Amo baxxaqqa                        ንባብ:  አሞባድዳዓ	',
    },
    {
      'id': 860,
      'ትርጉም': 'ቀኝ ግዛትነት',
      'name': ' Ku amolayyo                         ንባብ: ኳ ኦሞልአይዬ',
    },
    {
      'id': 861,
      'ትርጉም': 'ሰብአዊነት',
      'name': ' Sahdaytiino                 ንባብ: ሳህዳይቲኖ	',
    },
    {
      'id': 862,
      'ትርጉም': 'ፌደራሊዝም',
      'name': ' Federaal xinto                   ንባብ: ፌዴራሊኖ ዲንቶ',
    },
    {
      'id': 863,
      'ትርጉም': 'አሃዳዊነት',
      'name': ' Inkaafa xinto            ንባብ: ኢንካአፋድዲንቶ	',
    },
    {
      'id': 864,
      'ትርጉም': 'ግንኙነት',
      'name': ' Qalla                 ንባብ: ዓልላ	ዝምድና፣',
    },
    {
      'id': 865,
      'ትርጉም': 'የዲፕሎማሲ ግንኙነት',
      'name': ' Diplomaasi qalla               ንባብ: ዲፕሎማሲ አልላ',
    },
    {
      'id': 866,
      'ትርጉም': 'ኤምባሲ',
      'name': ' Safaarata               ንባብ: ሳፋራታ',
    },
    {
      'id': 868,
      'ትርጉም': 'አምባሳደር',
      'name': ' Safiiri                  ንባብ: ሳፍሪ',
    },
    {
      'id': 869,
      'ትርጉም': 'ልኡክ',
      'name': ' Irga                   ንባብ: ኢርጋ',
    },
    {
      'id': 870,
      'ትርጉም': 'ድርድር',
      'name': ' Mablo                 ንባብ: ማብሎ',
    },
    {
      'id': 871,
      'ትርጉም': 'አዋጅ',
      'name': ' Kukta                ንባብ: ኩክታ',
    },
    {
      'id': 872,
      'ትርጉም': 'ምስጢር',
      'name': ' Sirri/Cummi/                 ንባብ: ሲርሪ',
    },
    {
      'id': 873,
      'ትርጉም': 'ስራ ማቆም',
      'name': ' Taama soolo                      ንባብ: ታማሰሶሎ ',
    },
    {
      'id': 874,
      'ትርጉም': 'ሰላማዊ ሰልፍ',
      'name': ' Uluuluka                               ንባብ: ኡሉሉካ ',
    },
    {
      'id': 875,
      'ትርጉም': 'ስቃይ',
      'name': ' Adaadarisso                            ንባብ: አዳዳሪስሶ',
    },
    {
      'id': 876,
      'ትርጉም': 'ጓደኝነት',
      'name': ' Kataysiinu                        ንባብ: ካታይሱኒ  ',
    },
    {
      'id': 877,
      'ትርጉም': 'ወገናዊነት',
      'name': ' Hawi                             ንባብ: ሃዊ	',
    },
    {
      'id': 878,
      'ትርጉም': 'አመልካች',
      'name': ' Qaxxaagite                    ንባብ: ዓድዳጊቴ',
    },
    {
      'id': 879,
      'ትርጉም': 'ወግ አጥባቂ',
      'name': ' Hirrigiye                    ንባብ: ሂሪግዬ',
    },
    {
      'id': 880,
      'ትርጉም': 'የሞት ቅጣት',
      'name': ' Amo kalti                          ንባብ: አሞክካልቲ',
    },
    {
      'id': 881,
      'ትርጉም': 'ስቅላት',
      'name': ' Fannisiyya                          ንባብ: ፋንኒሲይያ ',
    },
    {
      'id': 882,
      'ትርጉም': 'ቀጣይነት',
      'name': 'Gaasisenta                                ንባብ: ጋዲስንታ',
    },
    {
      'id': 883,
      'ትርጉም': 'ረዳት ማሳጣት',
      'name': ' Fillat gaco                              ንባብ: ፊልላት ጋሃ',
    },
    {
      'id': 884,
      'ትርጉም': 'አክራሪነት',
      'name': ' Kaririqisso                               ንባብ: ካሪሪኢሶ',
    },
    {
      'id': 885,
      'ትርጉም': 'አፈንጋጭ',
      'name': ' Makkoowiyya                ንባብ: ማከኮዊይያ  ',
    },
    {
      'id': 886,
      'ትርጉም': 'በአንድ ዓላማ የማይረጋ',
      'name': ' Bodambood                     ንባብ: ቦዳምቦኦድ',
    },
    {
      'id': 887,
      'ትርጉም': 'ድንገተኛ',
      'name': ' Garcabbaxa                           ንባብ: ጋራ ሃብባራ',
    },
    {
      'id': 888,
      'ትርጉም': 'ህልውና',
      'name': ' afqado                ንባብ: አፍ ዓዶ ',
    },
    {
      'id': 889,
      'ትርጉም': 'መሻሻል',
      'name': ' Aysisso                 ንባብ: አይስሶ ',
    },
    {
      'id': 890,
      'ትርጉም': 'መባባስ',
      'name': ' Gacsiso                ንባብ: ጋህሲስሶ',
    },
    {
      'id': 891,
      'ትርጉም': 'ትግል',
      'name': 'geedana/Giclo                             ንባብ: ጌዳና/ጊህሎ ',
    },
    {
      'id': 892,
      'ትርጉም': 'ዘመቻ',
      'name': ' Gaadu                 ንባብ: ጋዱ',
    },
    {
      'id': 893,
      'ትርጉም': 'ስልጠና',
      'name': ' Aydakaakana                         ንባብ: አይዳካከና ',
    },
    {
      'id': 894,
      'ትርጉም': 'ወታደራዊ ስልጠና ',
      'name':
          ' Qaskariinoh aydakaakana                      ንባብ: ዓስካሪኖህ አይዳካከና',
    },
    {
      'id': 896,
      'ትርጉም': 'ቢሮ',
      'name': ' Biiro                                ንባብ: ቢሮ',
    },
    {
      'id': 897,
      'ትርጉም': 'መምሪያ',
      'name': ' Mirracsenta                       ንባብ: ሚራህስንታ',
    },
    {
      'id': 898,
      'ትርጉም': 'እስፖርት',
      'name': ' Isporti                                  ንባብ: ኢስፖርቲ ',
    },
    {
      'id': 899,
      'ትርጉም': 'ውድድር',
      'name': 'buxa                          ንባብ: በራ ',
    },
    {
      'id': 900,
      'ትርጉም': 'እግር ኳስ',
      'name': 'Ibi koqoso                        ንባብ: ኢቢ ኮዕሶ	   ',
    },
    {
      'id': 901,
      'ትርጉም': 'እጅ ኳስ',
      'name': ' Gaba koqoso                   ንባብ: ገባ ኮዕሶ',
    },
    {
      'id': 902,
      'ትርጉም': 'ቅርጫት ኳስ',
      'name': ' kafaq koqoso                    ንባብ: ካፋዕ ኮዕሶ',
    },
    {
      'id': 903,
      'ትርጉም': 'ኳስ',
      'name': ' koqso                    ንባብ: ኮዕሶ	',
    },
    {
      'id': 904,
      'ትርጉም': 'ሩጫ',
      'name': ' Arda                     ንባብ: አርዳ',
    },
    {
      'id': 905,
      'ትርጉም': 'ዝላይ',
      'name': ' Kaqo                        ንባብ: ካዖ	 ',
    },
    {
      'id': 906,
      'ትርጉም': 'ውርወራ',
      'name': ' Qambo                        ንባብ: አምቦ',
    },
    {
      'id': 907,
      'ትርጉም': 'ዋና',
      'name': ' Giiru                 ንባብ: ጊሩ	',
    },
    {
      'id': 908,
      'ትርጉም': 'ሂሳብ',
      'name': ' Cisaaba           ንባብ: ሂሳባ',
    },
    {
      'id': 909,
      'ትርጉም': 'መደመር',
      'name': 'osssa                           ንባብ: ኦስሳ',
    },
    {
      'id': 910,
      'ትርጉም': 'መቀነስ',
      'name': ' Kalta                      ንባብ: ካልታ',
    },
    {
      'id': 911,
      'ትርጉም': 'ማብዛት',
      'name': ' Atka                      ንባብ: አትካ',
    },
    {
      'id': 912,
      'ትርጉም': 'ማካፈል',
      'name': ' Kurta                       ንባብ: ኩርታ',
    },
    {
      'id': 913,
      'ትርጉም': 'ቁጥር',
      'name': ' Ixxu                   ንባብ: ኢድዱ	',
    },
    {
      'id': 914,
      'ትርጉም': 'አሃዝ',
      'name': ' Ixxima                ንባብ: ኢድድማ  ',
    },
    {
      'id': 915,
      'ትርጉም': 'ዐረፍተነገር',
      'name': ' Maxca maafo               ንባብ: መድሃምማፎ	  ',
    },
    {
      'id': 916,
      'ትርጉም': 'ክፍልፋይ',
      'name': ' Digloytah ixxima                  ንባብ:	ዲግሎይታህ ኢድዲማ	',
    },
    {
      'id': 917,
      'ትርጉም': 'ደረጃ',
      'name': ' Caddoh Ixxima              ንባብ: ሃዶህኢድድማ',
    },
    {
      'id': 918,
      'ትርጉም': 'ገቢ',
      'name': ' culenta                 ንባብ: ሁለንታ ',
    },
    {
      'id': 919,
      'ትርጉም': 'ስር',
      'name': ' Ramidi             ንባብ: ራሚዲ	',
    },
    {
      'id': 920,
      'ትርጉም': 'ግንድ',
      'name': ' Daaba                ንባብ: ዳባ	',
    },
    {
      'id': 921,
      'ትርጉም': 'ብሄራዊ ገቢ',
      'name': 'Agat culenta                      ንባብ: አጋት ሁለንታ',
    },
    {
      'id': 922,
      'ትርጉም': 'ቅጠል',
      'name': ' Ayyufta              ንባብ: አይዮፋታ  ',
    },
    {
      'id': 923,
      'ትርጉም': 'አበባ',
      'name': ' Qoborta             ንባብ: ዖቦርታ ',
    },
    {
      'id': 924,
      'ትርጉም': 'ፍሬ',
      'name': ' Mixaxu                  ንባብ: ሚራሩ',
    },
    {
      'id': 925,
      'ትርጉም': 'ጥሬ',
      'name': ' Gaydu                    ንባብ: ጋይዱ',
    },
    {
      'id': 926,
      'ትርጉም': 'ጥናት',
      'name': ' cubbuso                  ንባብ: ሁብቡሶ	',
    },
    {
      'id': 927,
      'ትርጉም': 'ባህር ጠረፍ',
      'name': ' Baddafa         ንባብ: ባዳድፋ',
    },
    {
      'id': 928,
      'ትርጉም': 'ንፋስ（ከ ባህር ወደ የብስ）',
      'name': ' Baddiita                   ንባብ: ባዳዲታ	 ',
    },
    {
      'id': 929,
      'ትርጉም': 'ንፋስ（ከ  የብስ ወደ ባህር）',
      'name': ' Barriita               ንባብ: ባርሪታ',
    },
    {
      'id': 930,
      'ትርጉም': 'ደሴት',
      'name': 'Gadiri                   ንባብ: ጋዳሪ',
    },
    {
      'id': 931,
      'ትርጉም': 'የባህር ወሽመጥ',
      'name': ' Kaddi                            ንባብ: ካድዲ	',
    },
    {
      'id': 932,
      'ትርጉም': ' የባህር ሰላጤ',
      'name': ' Baddi caraata                      ንባብ: በድዲ ሃራታ	',
    },
    {
      'id': 933,
      'ትርጉም': 'ጥልቀት（የባህር）',
      'name': ' Gayya                 ንባብ: ጋይያ  ',
    },
    {
      'id': 934,
      'ትርጉም': 'ጥልቀት የ ሌለው（ለባህር）',
      'name': ' Qira             ንባብ: ዒራ',
    },
    {
      'id': 935,
      'ትርጉም': 'የ ባህር ሞገድ',
      'name': ' Haffo                 ንባብ: ሃፍፎ',
    },
    {
      'id': 936,
      'ትርጉም': 'የውሃ አካል',
      'name': ' Lelwa                ንባብ: ሌልዋ	',
    },
    {
      'id': 937,
      'ትርጉም': 'ጨው የሌለው ውሃ',
      'name': ' Galaaca                 ንባብ: ጋላሃ',
    },
    {
      'id': 938,
      'ትርጉም': ' የዝናብ ውሃ ',
      'name': ' Coboyu                  ንባብ: ሆቦዩ',
    },
    {
      'id': 939,
      'ትርጉም': 'ድፍርስ ውሃ',
      'name': 'Daraqa                      ንባብ: ዳራዓ ',
    },
    {
      'id': 940,
      'ትርጉም': 'ጨዋማ ውሃ ',
      'name': ' Badliita                        ንባብ: ባድሊታ ',
    },
    {
      'id': 941,
      'ትርጉም': 'ቅራሪ ውሃ',
      'name': ' Caro             ንባብ: ሃሮ	',
    },
    {
      'id': 942,
      'ትርጉም': 'ምንጭ',
      'name': ' Dara                   ንባብ: ዳራአ',
    },
    {
      'id': 943,
      'ትርጉም': 'ጭሮሽ',
      'name': ' Buyyi                  ንባብ: ቡድሊታ',
    },
    {
      'id': 944,
      'ትርጉም': 'የውሃ ገንዳ',
      'name': ' Muude             ንባብ: ሙዴ',
    },
    {
      'id': 945,
      'ትርጉም': 'የውሃ ጉድጓድ',
      'name': ' Qeela                      ንባብ: ዓኤላ',
    },
    {
      'id': 946,
      'ትርጉም': 'የ እንፋሎት ውሃ',
      'name': ' Boynalle                             ንባብ: ቦይናሌ',
    },
    {
      'id': 947,
      'ትርጉም': 'ምግብ ፣እህል',
      'name': 'Maaqoh/Daro                    ንባብ:	ማዖ/ዳሮ ',
    },
    {
      'id': 948,
      'ትርጉም': ' ጥሬ',
      'name': ' Ambo                     ንባብ: አምቦ',
    },
    {
      'id': 949,
      'ትርጉም': 'ክርክር፣ክክ',
      'name': ' Diglu                                   ንባብ: ዲግሉ',
    },
    {
      'id': 950,
      'ትርጉም': 'ሊጥ',
      'name': ' Unduru/qagina                                    ንባብ:	ኡንድሩ/ዓጊና',
    },
    {
      'id': 951,
      'ትርጉም': 'የጉድጓድ ዳቦ',
      'name': ' Muufeyta                                     ንባብ: ሙፈይታ',
    },
    {
      'id': 952,
      'ትርጉም': 'ተቦክቶ የተጋገረ ',
      'name': ' Buuqeyta                               ንባብ: ቡኤይታ ',
    },
    {
      'id': 953,
      'ትርጉም': 'ሳይቦካ የተጋገረ',
      'name': ' Naadiita                          ንባብ: ናዲታ',
    },
    {
      'id': 954,
      'ትርጉም': 'እንጀራ',
      'name': ' Luclucu                             ንባብ: ሉህሉህ	',
    },
    {
      'id': 955,
      'ትርጉም': 'ወፍጮ',
      'name': ' Eceyya                          ንባብ: ኤሄይያ	 ',
    },
    {
      'id': 956,
      'ትርጉም': 'መፍጨት',
      'name': ' Riyo                       ንባብ: ሪዮ	',
    },
    {
      'id': 957,
      'ትርጉም': 'እርግዝና',
      'name': ' Gida                                 ንባብ: ጊዳ',
    },
    {
      'id': 958,
      'ትርጉም': 'የወር አበባ',
      'name':
          'Mayanagali/Wasakatu                                ንባብ: መያንገሊ/ወስክቱ	',
    },
    {
      'id': 959,
      'ትርጉም': 'ማቅለሽለሽ',
      'name': ' Luwaata                           ንባብ: ሉዋታ ',
    },
    {
      'id': 960,
      'ትርጉም': 'እርግዝና',
      'name': ' Soonibiinu                   ንባብ: ሶንቢኑ	',
    },
    {
      'id': 961,
      'ትርጉም': 'ምጥ',
      'name': ' Dabbaqaana/Lacawa            ንባብ: ዳበበዓና/ለሃዋ',
    },
    {
      'id': 962,
      'ትርጉም': 'መውለድ',
      'name': ' Xalaaya               ንባብ: ዳላያ',
    },
    {
      'id': 963,
      'ትርጉም': 'አራስ',
      'name': ' Ulla                   ንባብ: ኡልላ',
    },
    {
      'id': 964,
      'ትርጉም': 'የልጅ እናት',
      'name': ' Alqiina                        ንባብ: አልዒኢና',
    },
    {
      'id': 965,
      'ትርጉም': 'ሞኒተር',
      'name': ' Monititar                 ንባብ: ሞኒተር',
    },
    {
      'id': 966,
      'ትርጉም': 'ክለሳ',
      'name': ' qasirgacsa                      ንባብ: አሲርገህሳ',
    },
    {
      'id': 967,
      'ትርጉም': 'የሰንደቃ ዓላማ መዝሙር',
      'name': ' Digiriiri                      ንባብ: በንዲራ ሳሬ',
    },
    {
      'id': 968,
      'ትርጉም': 'ደመወዝ',
      'name': ' Qasbi                 ንባብ: ዓስቢ',
    },
    {
      'id': 969,
      'ትርጉም': 'የገንዘብ ስርዓት',
      'name': ' maali siira                    ንባብ: ማሊ ሲራ',
    },
    {
      'id': 970,
      'ትርጉም': 'አስተዋጽኦ',
      'name': ' cali                  ንባብ: ሃሊ',
    },
    {
      'id': 971,
      'ትርጉም': 'ግንባር(የጦር)',
      'name': ' qarsa                     ንባብ: አርሳ',
    },
    {
      'id': 972,
      'ትርጉም': 'መቁሰል',
      'name': ' mudumu               ንባብ: ሙዱሙ',
    },
    {
      'id': 973,
      'ትርጉም': 'ውሃ',
      'name': ' lee                ንባብ: ሌኤ	',
    },
    {
      'id': 974,
      'ትርጉም': 'ጮራ/ብርሃን',
      'name': ' Ifu                  ንባብ: ኢፉ ',
    },
    {
      'id': 975,
      'ትርጉም': 'ሌሊት',
      'name': ' bara                      ንባብ: ባራ',
    },
    {
      'id': 976,
      'ትርጉም': 'ሌሊት',
      'name': 'bara                    ንባብ: ባራ	 ',
    },
    {
      'id': 977,
      'ትርጉም': 'ቤተክርስቲያን ',
      'name': 'kaniisa                  ንባብ: ካኒኢሳ',
    },
    {
      'id': 978,
      'ትርጉም': 'ሌሊት',
      'name': ' bara                  ንባብ: ባራ ',
    },
    {
      'id': 979,
      'ትርጉም': 'ኳስ ሜዳ',
      'name': ' koqso booxa                ንባብ: ኮዕሶኦ ቦኦራ',
    },
    {
      'id': 980,
      'ትርጉም': 'ድርሻ',
      'name': ' maglaba              ንባብ: ማግላባ',
    },
    {
      'id': 981,
      'ትርጉም': 'ፐርሰንት',
      'name': ' booltah ixxima                ንባብ: ቦልታህ ኢድዲማ	 ',
    },
    {
      'id': 982,
      'ትርጉም': 'መቶኛ/ዴሲማል',
      'name': ' ximmoytha ixxima               ንባብ: ድምሞይታህ ኢድዲማ	',
    },
    {
      'id': 983,
      'ትርጉም': 'ሴት ልጅ',
      'name': ' baxa`a                    ንባብ: በራእ',
    },
    {
      'id': 984,
      'ትርጉም': 'አጎት/ከ አባት በኩል',
      'name': 'tobokoyt`a               ንባብ: ቶቦኮይታእ '
    },
    {
      'id': 985,
      'ትርጉም': 'መኪና	የጭነት መኪና',
      'name': ' qari makiina                ንባብ: ዓሪ          ',
    },
    {
      'id': 986,
      'ትርጉም': 'አስተዋጾ',
      'name': ' cali                             ንባብ: ሓሊ ',
    },
    {
      'id': 987,
      'ትርጉም': 'የብር ገበያ',
      'name': ' Lakqo qadaaga                   ንባብ: ላክዖ አዳጋ',
    },
    {
      'id': 988,
      'ትርጉም': 'ብረታ ብረት ገበያ',
      'name': ' Briita qadaaga               ንባብ: ቢሪታ አዳጋ',
    },
    {
      'id': 989,
      'ትርጉም': 'ደቡብ ምዕራብ',
      'name': ' gabbi carra                   ንባብ: ጋብቢ ሓርራ',
    },
    {
      'id': 990,
      'ትርጉም': 'እስልምና',
      'name': ' Islaam                       ንባብ: ኢስላም',
    },
    {
      'id': 991,
      'ትርጉም': 'ክርስትና',
      'name': ' korosu                        ንባብ: ኮሮሱ',
    },
    {
      'id': 992,
      'ትርጉም': 'ዜና አንባቢ',
      'name': ' xaagu tatruse                     ንባብ:ዳጉ ታትሩሴ',
    },
    {
      'id': 993,
      'ትርጉም': 'ኤሌክትሪክ',
      'name': ' koraanna                       ንባብ: ኮራአና',
    },
    {
      'id': 994,
      'ትርጉም': 'ማፈንገጥ ',
      'name': 'makkoowiyya                     ንባብ: ማክኮዊይያ',
    },
  ];
  List<Map<String, dynamic>> _foundWords = [];
  @override
  void initState() {
    // TODO: implement initState
    super.initState();
    _foundWords = _allWords;
  }

  void _filter(String key) {
    List<Map<String, dynamic>> results = [];
    if (key.isEmpty) {
      results = _allWords;
    } else {
      results = _allWords
          .where((element) =>
              element['ትርጉም'].toLowerCase().contains(key.toLowerCase()))
          .toList();
    }
    setState(() {
      _foundWords = results;
    });
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.white,
        appBar: AppBar(
          title: Text('በአማርኛ በመፃፍ የፈልጉ'),
          centerTitle: true,
          actions: [
            Theme(
              data: Theme.of(context).copyWith(
                dividerColor: Colors.white,
                iconTheme: IconThemeData(color: Colors.white),
                textTheme: TextTheme().apply(bodyColor: Colors.white),
              ),
              child: PopupMenuButton<int>(
                color: Colors.indigo,
                onSelected: (item) => onSelected(context, item),
                itemBuilder: (context) => [
                  PopupMenuItem<int>(
                    value: 0,
                    child: Text('amharic Search'),
                  ),
                  PopupMenuItem<int>(
                    value: 1,
                    child: Text('afarigna search'),
                  ),
                ],
              ),
            ),
          ],
        ),
        body: Padding(
          padding: const EdgeInsets.all(15.0),
          child: Column(
            children: [
              TextField(
                onChanged: (value) => _filter(value),
                cursorColor: Colors.white,
                decoration: const InputDecoration(
                    labelText: 'Search...',
                    labelStyle: TextStyle(
                        color: Colors.black,
                        letterSpacing: 3,
                        fontWeight: FontWeight.bold,
                        fontSize: 17),
                    suffixIcon: Icon(
                      Icons.search,
                      color: Colors.black,
                    ),
                    icon: Icon(
                      Icons.list,
                      color: Colors.black,
                    )),
              ),
              const SizedBox(
                height: 5,
              ),
              Expanded(
                  child: _foundWords.isNotEmpty
                      ? ListView.builder(
                          itemCount: _foundWords.length,
                          itemBuilder: (context, index) {
                            return Card(
                              key: ValueKey(_foundWords[index]['id']),
                              color: Colors.lightBlueAccent.shade200,
                              elevation: 4,
                              margin: const EdgeInsets.symmetric(vertical: 10),
                              child: ListTile(
                                leading: FavoriteButton(
                                  isFavorite: false,
                                  iconSize: 40,
                                  // iconDisabledColor: Colors.white,
                                  valueChanged: (_isFavorite) {
                                    print('Is Favorite : $_isFavorite');
                                  },
                                ),
                                title: Text(
                                  _foundWords[index]['ትርጉም'],
                                  style: const TextStyle(
                                      fontWeight: FontWeight.bold,
                                      letterSpacing: 1,
                                      color: Colors.black,
                                      fontSize: 18),
                                ),
                                subtitle: Text(_foundWords[index]['name'],
                                    style: const TextStyle(
                                        fontWeight: FontWeight.bold,
                                        letterSpacing: 1,
                                        color: Colors.black,
                                        fontSize: 16)),
                                trailing: Text(
                                    _allWords[index]['id'].toString(),
                                    style: const TextStyle(
                                        fontWeight: FontWeight.bold,
                                        letterSpacing: 1,
                                        color: Colors.black,
                                        fontSize: 15,
                                        backgroundColor: Colors.white)),
                              ),
                            );
                          })
                      : const Center(
                          child: Text('ተመሳሳይ ቃል አልተገኘም'),
                        ))
            ],
          ),
        ));
  }

  void onSelected(BuildContext context, int item) {
    switch (item) {
      case 0:
        Navigator.of(context).push(
          MaterialPageRoute(builder: (context) => amharicsearch()),
        );
        break;
      case 1:
        Navigator.of(context).push(
          MaterialPageRoute(builder: (context) => HomePage()),
        );
      //   break;
      // case 2:
      //   Navigator.of(context).pushAndRemoveUntil(
      //     MaterialPageRoute(builder: (context) => LoginPage()),
      //     (route) => false,
      //   );
    }
  }
}
