import 'package:flutter/material.dart';
import 'package:untitled9/amharicsearch.dart';
import 'package:favorite_button/favorite_button.dart';

class HomePage extends StatefulWidget {
  const HomePage({Key? key}) : super(key: key);

  @override
  State<HomePage> createState() => _HomePageState();
}

class _HomePageState extends State<HomePage> {
  List<String> items = ['item1', 'item2'];
  String? SelectedItem = 'item1';

  final List<Map<String, dynamic>> _allWords = [
    {
      'id': 1,
      'name': 'Qarsa',
      'ንባብ':
          'ንባብ :- ዓርሳ                                                              ትርጉም:- ማጥባት',
    },
    {
      'id': 2,
      'name': 'ixxiga',
      'ንባብ':
          'እድድጋ                                                              ትርጉም: እውቅት',
    },
    {
      'id': 3,
      'name': 'Baritto buxa',
      'ንባብ':
          'በረትቶበ ቡራ                                                    ትርጉም: ትምህርት ቤት',
    },
    {
      'id': 4,
      'name': 'Qimbo barittoh buxa',
      'ንባብ':
          'ኢምቢቦ በረትቶህ ቡራ                                                                              ትርጉም: የ መጀመሪያ ደረጃ ትምህርት ቤት',
    },
    {
      'id': 5,
      'name': '2haytoh caddoh b.buxa ',
      'ንባብ':
          'ነምቦብ በረትቶህ ሃድዲህ በርትቶህ ቡራ                                                                          ትርጉም: ሁለተኛ ደረጃ ትምህርት ቤት',
    },
    {'id': 6, 'name': 'kulliyata', 'ንባብ': 'ኩልሊይታ'},
    {
      'id': 7,
      'name': 'Cagalu',
      'ንባብ':
          'ሃገሉ                                                                              ትርጉም: እስፔሻላዜሽን',
    },
    {
      'id': 8,
      'name': 'Duqayso',
      'ንባብ':
          'ዱዓይሶ                                                                              ትርጉም: ምረቃ',
    },
    {
      'id': 9,
      'name': 'Kabiiri',
      'ንባብ':
          'ከቢሪ                                                                              ትርጉም: መምህር',
    },
    {
      'id': 10,
      'name': 'Barseena',
      'ንባብ':
          'በርሴና                                                                              ትርጉም: አስተማሪ',
    },
    {
      'id': 11,
      'name': 'Darsaytu',
      'ንባብ':
          'ደርሰይቱ                                                                              ትርጉም: ተማሪ/1ኛ ደረጃ/',
    },
    {
      'id': 12,
      'name': 'Barteena ',
      'ንባብ':
          'በርቴና                                                                              ትርጉም: ተማሪ/2ኛ ደረጃ/',
    },
    {
      'id': 13,
      'name': 'Aqayyaare',
      'ንባብ':
          'አዓይያሬ                                                                              ትርጉም: ፈተና',
    },
    {
      'id': 14,
      'name': 'Aqakkaane',
      'ንባብ':
          'አዐክካኔ                                                                              ትርጉም: ሙከራ',
    },
    {
      'id': 15,
      'name': 'Aslugiyaa',
      'ንባብ':
          'አዐክካኔ                                                                              ትርጉም: ማለፍ/ፈተና/',
    },
    {
      'id': 16,
      'name': 'Elleliya',
      'ንባብ':
          'ኤልሌሊይያ                                                                              ትርጉም: መውደቅ',
    },
    {
      'id': 17,
      'name': 'Kitaaba',
      'ንባብ':
          'ኪታባ                                                                              ትርጉም: መጽሃፍ',
    },
    {
      'id': 18,
      'name': 'Data luucu',
      'ንባብ':
          'ደታ ሉሁ                                                                              ትርጉም: ጥቁር ሰሌዳ',
    },
    {
      'id': 19,
      'name': 'Diiliseena',
      'ንባብ':
          'ዲሊሴና                                                                              ትርጉም: ማስመሪያ',
    },
    {
      'id': 20,
      'name': 'Bilsime',
      'ንባብ':
          'ቢልሲሜ                                                                              ትርጉም: እርሳስ, '
    },
    {
      'id': 21,
      'name': 'Duugeena',
      'ንባብ':
          'ዱጌና                                                                              ትርጉም: ላጲስ',
    },
    {
      'id': 22,
      'name': 'Saniseyna',
      'ንባብ':
          'ሳኒሰይና                                                                              ትርጉም: መቅረጫ',
    },
    {
      'id': 23,
      'name': 'Barda',
      'ንባብ':
          'በርዳ                                                                              ትርጉም: ቾክ',
    },
    {
      'id': 24,
      'name': 'Kiryaati',
      'ንባብ':
          'ኪርያቲ                                                                              ትርጉም: ንባብ',
    },
    {
      'id': 25,
      'name': 'Kutbe',
      'ንባብ':
          'ኩትቤ                                                                              ትርጉም: ጽሁፍ',
    },
    {
      'id': 26,
      'name': 'Qasiiri',
      'ንባብ':
          'ዐሲሪ                                                                              ትርጉም: ትምህርት',
    },
    {
      'id': 27,
      'name': 'Mutalaqa',
      'ንባብ':
          'ሙታለዓ                                                                                                ትርጉም: ጥናት/ማጥናት	',
    },
    {
      'id': 28,
      'name': 'Fella/Darsi',
      'ንባብ':
          'ፌልላ/ደርሲ                                                                                           ትርጉም: ክፍለ ትምህርት',
    },
    {
      'id': 29,
      'name': 'Maxca',
      'ንባብ':
          'መድሃ                                                                                                     ትርጉም: አባባል',
    },
    {
      'id': 30,
      'name': 'Maaqiita',
      'ንባብ':
          'ማኢታ                                                                                                      ትርጉም: ጥቅስ',
    },
    {
      'id': 31,
      'name': 'Esseri',
      'ንባብ':
          'ማኢታ                                                                                                        ትርጉም: ጥቅስ',
    },
    {
      'id': 32,
      'name': 'Aydobba',
      'ንባብ':
          'አይዶብባ                                                                                                        ትርጉም: መልስ',
    },
    {
      'id': 33,
      'name': 'Daftara',
      'ንባብ':
          ' ደፍተራ                                                                                                     ትርጉም: ደብተር',
    },
    {
      'id': 34,
      'name': 'Kalama',
      'ንባብ':
          ' ከላማ                                                                                                     ትርጉም: እስክርቢቶ',
    },
    {
      'id': 35,
      'name': 'Aylalokka',
      'ንባብ':
          'አይላሎክ                                                                                                 ትርጉም: ስህተት',
    },
    {
      'id': 36,
      'name': 'Gittoyso',
      'ንባብ':
          'ጊትቶይሶ                                                                                                  ትርጉም: መሳት',
    },
    {
      'id': 37,
      'name': 'Gita',
      'ንባብ':
          'ጊታ                                                                                                         ትርጉም: እርማት',
    },
    {
      'id': 38,
      'name': 'Garqiino Korsa',
      'ንባብ':
          ' ገርዒኖ ኮርሳ                                                                                          ትርጉም: መኮረጅ',
    },
    {
      'id': 39,
      'name': 'Maqinisso',
      'ንባብ':
          'መዕኒስሶ                                                                                                   ትርጉም: መተርጎም',
    },
    {
      'id': 40,
      'name': 'Ellebarito',
      'ንባብ':
          'ኤልሌበረትቶ                                                                                              ትርጉም: መኮረጅ',
    },
    {
      'id': 41,
      'name': 'kaado',
      'ንባብ':
          'ከዶ                                                                                                          ትርጉም: ሽልማት',
    },
    {
      'id': 42,
      'name': 'Digala',
      'ንባብ':
          'ዲጋላ                                                                                                          ትርጉም: ቅጣት',
    },
    {
      'id': 43,
      'name': 'Ramaqqa/Oftoyu',
      'ንባብ':
          'ረማዕዓ/ኦፍቶዩ                                                                                           ትርጉም: እረፍት',
    },
    {
      'id': 44,
      'name': 'Hallaala',
      'ንባብ':
          ' ሃልላላ                                                                                                      ትርጉም: መዝናናት',
    },
    {
      'id': 45,
      'name': 'Abbuukfirsa',
      'ንባብ':
          'አብቡክፍርሳ                                                                                               ትርጉም: የቃል ጽሁፍ',
    },
    {
      'id': 46,
      'name': 'Fedella',
      'ንባብ':
          'ፍዲልላ                                                                                                      ትርጉም: ድርሰት',
    },
    {
      'id': 47,
      'name': 'Muura',
      'ንባብ':
          'ሙራ                                                                                                          ትርጉም: ነጥብ',
    },
    {
      'id': 48,
      'name': 'Aftigacasa',
      'ንባብ':
          'አፍቲገህጎ                                                                                                    ትርጉም: ትርጉም',
    },
    {
      'id': 49,
      'name': 'Qalayli',
      'ንባብ':
          'አላይሊ                                                                                                        ትርጉም: ውድድር',
    },
    {
      'id': 50,
      'name': 'Anaakara',
      'ንባብ':
          'አናከራ                                                                                                                                                                                     ትርጉም: ፍክክር',
    },
    {
      'id': 51,
      'name': 'Kawsenta ',
      'ንባብ':
          'ከውሴንታ                                                                                                                              ትርጉም: ከውሴንታ',
    },
    {
      'id': 52,
      'name': 'Mincat',
      'ንባብ':
          'ሚኒሐታ                                                                                                                                  ትርጉም: ምንባብ ',
    },
    {
      'id': 53,
      'name': 'Baritto sirra ',
      'ንባብ':
          'በረትቶስ ሲራ                                                                                                                                  ትርጉም: ስርዓተ ትምህርት',
    },
    {
      'id': 54,
      'name': 'Baddonta',
      'ንባብ':
          'ባዶንታ                                                                                                                          ትርጉም: ደውል',
    },
    {
      'id': 55,
      'name': 'Rooru',
      'ንባብ':
          ' ሮሩ                                                                                                                              ትርጉም: ሰልፍ',
    },
    {
      'id': 56,
      'name': 'Sumaqta',
      'ንባብ':
          'ሱመዕታ                                                                                                                           ትርጉም: ሰርተፍኬት',
    },
    {
      'id': 57,
      'name': 'Loynisso',
      'ንባብ':
          'ሎይኒሲሶ                                                                                                                          ትርጉም: ቁጥጥር ',
    },
    {
      'id': 58,
      'name': 'Amo-wagiti',
      'ንባብ':
          'አሞው ወጊቲ                                                                                                                      ትርጉም: ክለሳ',
    },
    {
      'id': 59,
      'name': 'Bandiira saare',
      'ንባብ':
          'በንዲራ ሳሬ                                                                                                                               ትርጉም: የሰንደቃ አላማ መዝሙር',
    },
    {
      'id': 60,
      'name': 'Digiiri',
      'ንባብ':
          'ዲገር                                                                                                                               ትርጉም: ጨዋታ',
    },
    {
      'id': 61,
      'name': 'Xagardig',
      'ንባብ':
          'ደገርዲግ                                                                                                                            ትርጉም: ስፖርት',
    },
    {
      'id': 62,
      'name': 'Amo',
      'ንባብ':
          'ኦሞ                                                                                                                                    ትርጉም: ራስ/ጸጉር',
    },
    {
      'id': 63,
      'name': 'Moyya',
      'ንባብ':
          'ሞይያ                                                                                                                                  ትርጉም: ጭንቅላት',
    },
    {
      'id': 64,
      'name': 'Moniitar',
      'ንባብ':
          'ሞኒተር                                                                                                                              ትርጉም: ሞኒተር',
    },
    {
      'id': 65,
      'name': 'Missinkica',
      'ንባብ':
          ' ሚሲንኪሃ                                                                                                                         ትርጉም: አእምሮ/አንጎል',
    },
    {
      'id': 66,
      'name': 'Cangal-xala',
      'ንባብ':
          'ሃንገል ዳላ                                                                                                                        ትርጉም: የራስ ቅል',
    },
    {
      'id': 67,
      'name': 'Xagooru',
      'ንባብ':
          'ዳጉሩ                                                                                                                                ትርጉም: ጸጉር',
    },
    {
      'id': 68,
      'name': 'Qairgacsa',
      'ንባብ':
          'አሲርገህሳ                                                                                                                           ትርጉም: ክለሳ',
    },
    {
      'id': 70,
      'name': 'Inti',
      'ንባብ':
          'ኢንቲ                                                                                                                                  ትርጉም: ዓይን',
    },
    {
      'id': 71,
      'name': 'Minini',
      'ንባብ':
          'ሚኒኒ                                                                                                                                 ትርጉም: ቅንድብ',
    },
    {
      'id': 72,
      'name': 'Sana',
      'ንባብ':
          'ሰና                                                                                                                                     ትርጉም: አፍንጫ',
    },
    {
      'id': 73,
      'name': 'Ayti',
      'ንባብ':
          'አይቲ                                                                                                                                    ትርጉም: ጆሮ',
    },
    {
      'id': 74,
      'name': 'afa',
      'ንባብ':
          'አፍ                                                                                                                                       ትርጉም: አፍ',
    },
    {
      'id': 75,
      'name': 'Arraba',
      'ንባብ':
          'አርራባ                                                                                                                                  ትርጉም: ምላስ',
    },
    {
      'id': 76,
      'name': 'Moddina',
      'ንባብ':
          'ሞድዲና                                                                                                                                ትርጉም: ጥርስ',
    },
    {
      'id': 77,
      'name': 'Sokto',
      'ንባብ':
          'ሳክቶ                                                                                                                                     ትርጉም: ከንፈር',
    },
    {
      'id': 78,
      'name': 'Debeni',
      'ንባብ':
          'ዴቤን                                                                                                                                    ትርጉም: አገጭ',
    },
    {
      'id': 79,
      'name': 'Raadida',
      'ንባብ':
          'ራዲድዳ                                                                                                                                  ትርጉም: ጺም',
    },
    {
      'id': 80,
      'name': 'Feera',
      'ንባብ':
          'ፌራ                                                                                                                                       ትርጉም:ጣት',
    },
    {
      'id': 81,
      'name': 'Qunti',
      'ንባብ':
          ' ንቲ                                                                                                                                       ትርጉም: አንገት',
    },
    {
      'id': 82,
      'name': 'Labka',
      'ንባብ':
          'ላብካ                                                                                                                                       ትርጉም: ትከሻ',
    },
    {
      'id': 83,
      'name': 'Caraya',
      'ንባብ':
          'ሃራያ                                                                                                                                      ትርጉም: ክንድ',
    },
    {
      'id': 84,
      'name': 'Gaba',
      'ንባብ':
          'ገባ                                                                                                                                         ትርጉም: እጅ',
    },
    {
      'id': 85,
      'name': 'Mogoyu',
      'ንባብ':
          'ሞጉዮ                                                                                                                                     ትርጉም: ክርን',
    },
    {
      'id': 86,
      'name': 'Lifiqi',
      'ንባብ':
          'ሊፊኢ                                                                                                                                     ትርጉም: ጥፍር',
    },
    {
      'id': 87,
      'name': 'Fiiqi',
      'ንባብ':
          'ፊኢ                                                                                                                                        ትርጉም: መልስ',
    },
    {
      'id': 88,
      'name': 'Aliili',
      'ንባብ':
          'አሊሊ                                                                                                                                      ትርጉም: ደረት',
    },
    {
      'id': 89,
      'name': 'Bagu',
      'ንባብ':
          'በጉ                                                                                                                                          ትርጉም: ሆድ',
    },
    {
      'id': 90,
      'name': 'Seeccaya ',
      'ንባብ':
          'ሴህያ                                                                                                                                    ትርጉም: ጀርባ',
    },
    {
      'id': 91,
      'name': 'Iba ',
      'ንባብ':
          'ኢባ                                                                                                                                        ትርጉም: እግር'
    },
    {
      'id': 92,
      'name': 'sarba',
      'ንባብ':
          'ሰርባ                                                                                                                                         ትርጉም: ባት',
    },
    {
      'id': 93,
      'name': 'Xoggale',
      'ንባብ':
          'ዶግገሌ                                                                                                                                     ትርጉም: ዳሌ',
    },
    {
      'id': 94,
      'name': 'xiiqare',
      'ንባብ':
          'ዲኢሬ                                                                                                                                      ትርጉም: ጭን',
    },
    {
      'id': 95,
      'name': 'Kamuusa',
      'ንባብ':
          'ከሙሱ                                                                                                                                      ትርጉም: መቀመጫ',
    },
    {
      'id': 96,
      'name': 'Labna',
      'ንባብ':
          'ለብና                                                                                                                                          ትርጉም: የወንድ ብልት',
    },
    {
      'id': 97,
      'name': 'Gamada ',
      'ንባብ':
          'ገመዳ                                                                                                                                        ትርጉም: መቀመጫ',
    },
    {
      'id': 98,
      'name': 'Sayna ',
      'ንባብ':
          'ሳይና                                                                                                                                          ትርጉም: የሴት ብልት',
    },
    {
      'id': 99,
      'name': 'Xabqe',
      'ንባብ':
          'ደብኤ                                                                                                                                           ትርጉም: ብብት',
    },
    {
      'id': 100,
      'name': 'Danbara',
      'ንባብ':
          'ደንበራ                                                                                                                                       ትርጉም: የዓይን ሺፍሽፍት',
    },
    {
      'id': 101,
      'name': 'mayxaya',
      'ንባብ':
          'ማይዴያ                                                                                                                                      ትርጉም: ሽንጥ',
    },
    {
      'id': 102,
      'name': 'Mayinto ',
      'ንባብ':
          'መዬንቶ                                                                                                                                      ትርጉም: ቅልጥም',
    },
    {
      'id': 103,
      'name': 'dadaba ',
      'ንባብ':
          'ደደባ                                                                                                                                        ትርጉም: የእግር ወርች',
    },
    {
      'id': 104,
      'name': 'Filla ',
      'ንባብ':
          'ፊልላ                                                                                                                                         ትርጉም: አንገት',
    },
    {
      'id': 105,
      'name': 'Addaqasa',
      'ንባብ':
          'አድዳዓሳ                                                                                                                                     ትርጉም:ውስጥ እግር',
    },
    {
      'id': 106,
      'name': 'gennqata ',
      'ንባብ':
          'ጌንናዕታ                                                                                                                                     ትርጉም: መዳፍ',
    },
    {
      'id': 107,
      'name': 'Qabala ',
      'ንባብ':
          'አባላ                                                                                                                                         ትርጉም: ደም',
    },
    {
      'id': 108,
      'name': 'Araba',
      'ንባብ':
          'አረባ                                                                                                                                           ትርጉም: ቆዳ',
    },
    {
      'id': 109,
      'name': 'Lafa',
      'ንባብ':
          'ለፋ                                                                                                                                             ትርጉም: አጥንት',
    },
    {
      'id': 110,
      'name': 'Ayti qokka',
      'ንባብ':
          'አይቲዕ ዖክካ                                                                                                                                 ትርጉም: ኩክ',
    },
    {
      'id': 111,
      'name': 'inti ximo',
      'ንባብ':
          'ኢንቲድ ዲሞ                                                                                                                                  ትርጉም: እምባ',
    },
    {
      'id': 112,
      'name': 'Bagi daaco',
      'ንባብ':
          'በጊ ዶሃ                                                                                                                                    ትርጉም: ሰገራ',
    },
    {
      'id': 113,
      'name': 'Santi Surraaqa ',
      'ንባብ':
          'ሳንቲ ሱርራዓ                                                                                                                            ትርጉም: ንፍጥ',
    },
    {
      'id': 114,
      'name': 'Afti caaka ',
      'ንባብ':
          'አፍቲ ሃአካ                                                                                                                                 ትርጉም: አክታ',
    },
    {
      'id': 115,
      'name': 'Sammo daaco',
      'ንባብ':
          'ሰምሞ ዳሆ                                                                                                                                 ትርጉም: ሽንት',
    },
    {
      'id': 116,
      'name': 'Afqado/Lubbi',
      'ንባብ':
          'አፍዓዶ/ሉብቢ                                                                                                                              ትርጉም: ልብ',
    },
    {
      'id': 117,
      'name': 'Cunudubu',
      'ንባብ':
          'ሁንዱቡ                                                                                                                                      ትርጉም: እምብርት',
    },
    {
      'id': 118,
      'name': 'Ramada',
      'ንባብ':
          'ረመዳ                                                                                                                                         ትርጉም: ደም ስር',
    },
    {
      'id': 119,
      'name': 'Tiro',
      'ንባብ':
          'ትሮ                                                                                                                                            ትርጉም: ጉበት',
    },
    {
      'id': 120,
      'name': 'xactusso',
      'ንባብ':
          'ዳህቱስሶ                                                                                                                                     ትርጉም: ሃሞት ከረጢት',
    },
    {
      'id': 121,
      'name': 'Ulqi',
      'ንባብ':
          'ኡልኢ                                                                                                                                           ትርጉም: አንጀት',
    },
    {
      'id': 122,
      'name': 'Angu',
      'ንባብ':
          'አንጉ                                                                                                                                            ትርጉም: ጡት',
    },
    {
      'id': 123,
      'name': 'Gogooni',
      'ንባብ':
          'ጎጎኒ                                                                                                                                          ትርጉም: ዓጽም',
    },
    {
      'id': 124,
      'name': 'Tobdo',
      'ንባብ':
          'ቶብዶ                                                                                                                                           ትርጉም: ጡንቻ',
    },
    {
      'id': 125,
      'name': 'Xukuunto/Kulcunto',
      'ንባብ':
          'ዶክሁንቶ/ኩልህንቶ/                                                                                                                          ትርጉም: ቁርጭምጭሚት',
    },
    {
      'id': 126,
      'name': 'Daala',
      'ንባብ':
          'ዳላ                                                                                                                                    ትርጉም: ቤተሰብ',
    },
    {
      'id': 127,
      'name': 'Buxa mara',
      'ንባብ':
          'ቡራም መራ                                                                                                                           ትርጉም: ቅርስ ቤተሰብ',
    },
    {
      'id': 128,
      'name': 'Abba',
      'ንባብ':
          'አብባ                                                                                                                                     ትርጉም: አባት',
    },
    {
      'id': 129,
      'name': 'Ina',
      'ንባብ':
          'ኢና                                                                                                                                       ትርጉም: እናት',
    },
    {
      'id': 130,
      'name': 'Aboyya',
      'ንባብ':
          'አብይያ                                                                                                                                  ትርጉም: ሴት አያት',
    },
    {
      'id': 131,
      'name': 'Baxa',
      'ንባብ':
          'በራእ                                                                                                                                      ትርጉም: ሴት ልጅ',
    },
    {
      'id': 132,
      'name': 'Tobokoyta',
      'ንባብ':
          'ቶቦኮይታ                                                                                                                               ትርጉም: ወንድም ',
    },
    {
      'id': 133,
      'name': 'KAxxaaba',
      'ንባብ':
          'ከድዳብባ                                                                                                                                ትርጉም: ወንድ አያት',
    },
    {
      'id': 134,
      'name': 'Qammi',
      'ንባብ':
          'አምሚ                                                                                                                                     ትርጉም: አጎት/ከ አባት በኩል',
    },
    {
      'id': 135,
      'name': 'Aboyya',
      'ንባብ':
          'አብይያ                                                                                                                                    ትርጉም: ሴት አያት',
    },
    {
      'id': 136,
      'name': 'Baxa',
      'ንባብ':
          'በራእ                                                                                                                                        ትርጉም: ሴት ልጅ',
    },
    {
      'id': 137,
      'name': 'Abu',
      'ንባብ':
          'አቡ                                                                                                                                         ትርጉም: አጎት/ከእናት በኩል',
    },
    {
      'id': 138,
      'name': 'Anna',
      'ንባብ':
          'አንና                                                                                                                                        ትርጉም: አክስት',
    },
    {
      'id': 139,
      'name': 'Absuma',
      'ንባብ':
          'አብሱማ                                                                                                                                     ትርጉም: አክስት',
    },
    {
      'id': 140,
      'name': 'Baqala',
      'ንባብ':
          'በዕላ                                                                                                                                        ትርጉም: ባል',
    },
    {
      'id': 141,
      'name': 'Barra',
      'ንባብ':
          ' በርራ                                                                                                                                    ትርጉም: ባል',
    },
    {
      'id': 142,
      'name': 'Ballu',
      'ንባብ':
          ' በልሉ                                                                                                                                    ትርጉም: አማች',
    },
    {
      'id': 143,
      'name': 'Ballo',
      'ንባብ':
          ' በልሎ                                                                                                                                    ትርጉም: የጡት ልጅ',
    },
    {
      'id': 144,
      'name': 'Arqo baxa',
      'ንባብ':
          ' አርኦ በራ                                                                                                                              ትርጉም: ጉዲፈቻ ',
    },
    {
      'id': 145,
      'name': 'baqli baxa',
      'ንባብ':
          ' በዕሊ በራ                                                                                                ትርጉም: የእንጀራ ልጅ',
    },
    {
      'id': 146,
      'name': 'Dama',
      'ንባብ':
          ' ደማ                                                                                                                               ትርጉም: የእህት ባል',
    },
    {
      'id': 147,
      'name': 'canno ',
      'ንባብ':
          'ሃንኖ                                                                                                                              ትርጉም: የእህትማማች ባሎች',
    },
    {
      'id': 148,
      'name': 'lamayna',
      'ንባብ':
          ' ለመይና                                                                                                                           ትርጉም: የእህትማማች ባሎች',
    },
    {
      'id': 149,
      'name': 'Qarseena',
      'ንባብ':
          ' አርሴና                                                                                                                            ትርጉም: የጡት ልጅ',
    },
    {
      'id': 150,
      'name': 'maababa',
      'ንባብ':
          ' መብባ                                                                                                                             ትርጉም: መስማት',
    },
    {
      'id': 151,
      'name': 'Mabla',
      'ንባብ':
          ' ማብላ                                                                                                                               ትርጉም: ማየት',
    },
    {
      'id': 152,
      'name': 'Doniki',
      'ንባብ':
          ' ዶይኒኪ                                                                                                                              ትርጉም: ጀልባ',
    },
    {
      'id': 153,
      'name': 'Tamu',
      'ንባብ':
          ' ተሙ                                                                                                                                  ትርጉም: መቅመስ',
    },
    {
      'id': 154,
      'name': 'Adbiysiyyo',
      'ንባብ':
          ' አድቢሲይዬ                                                                                                                        ትርጉም: በስነ ስርአት ማሳደግ'
    },
    {
      'id': 155,
      'name': 'Wadba',
      'ንባብ':
          ' ወድባ                                                                                                                             ትርጉም: ትራንስፖርት',
    },
    {
      'id': 156,
      'name': 'Angaararwa',
      'ንባብ':
          ' አንጋሪዋ                                                                                                                       ትርጉም: መገናኛ',
    },
    {
      'id': 157,
      'name': 'arho gita',
      'ንባብ':
          ' አርህጎ ጊታ                                                                                                                                                       ትርጉም: አውራ ጎዳና /የአርሆ መንገድ',
    },
    {
      'id': 158,
      'name': 'Makiina',
      'ንባብ':
          ' መኪና                                                                                                                              ትርጉም: መኪና',
    },
    {
      'id': 159,
      'name': 'Qari ',
      'ንባብ':
          ' አሪ                                                                                                                                  ትርጉም: ጭነት/ቤት',
    },
    {
      'id': 160,
      'name': 'Tayyara  boxxa',
      'ንባብ':
          ' ተይያራ በራ                                                                                                                                                    ትርጉም: አየር ማረፊያ',
    },
    {
      'id': 161,
      'name': 'wilqeena',
      'ንባብ':
          '  ዊልዔና                                                                                ትርጉም: ተሳቢ',
    },
    {
      'id': 162,
      'name': 'Tayyara  boxxa',
      'ንባብ':
          ' ተይያራ በራ                                                                                                                      ትርጉም: አየር ማረፊያ',
    },
    {
      'id': 163,
      'name': 'Attabusu',
      'ንባብ':
          ' አትተቡሱ                                                                                            ትርጉም: አውቶቢስ',
    },
    {
      'id': 164,
      'name': 'Tayyyara',
      'ንባብ':
          ' ተይያራ                                                                                               ትርጉም: አውሮፕላን',
    },
    {
      'id': 165,
      'name': 'Baaburu',
      'ንባብ':
          ' ባቡሩ                                                                                                 ትርጉም: ባቡር',
    },
    {
      'id': 166,
      'name': 'Baaburu horda',
      'ንባብ':
          ' ባቡሩ ሆርዳ                                                                                        ትርጉም: ባቡር ሐዲድ',
    },
    {
      'id': 167,
      'name': 'Markaba',
      'ንባብ':
          ' መርከባ                                                                                                 ትርጉም: መርካባ',
    },
    {
      'id': 168,
      'name': 'Furda',
      'ንባብ':
          ' ፋርዳ                                                                                                    ትርጉም: ወደብ/port/',
    },
    {
      'id': 169,
      'name': 'Marso',
      'ንባብ':
          ' መርሶ                                                                                                    ትርጉም: ወደብ/harbor/',
    },
    {
      'id': 170,
      'name': 'Meeraytu',
      'ንባብ':
          ' ሜርራይቶ                                                                                               ትርጉም: መጫኛ',
    },
    {
      'id': 171,
      'name': 'Farmo siba/Zarfi',
      'ንባብ':
          ' ፈርሞስ ሲባ/ዛርፊ                                                                                                            ትርጉም: ፖስታ',
    },
    {
      'id': 172,
      'name': 'Farmoh ayyufta',
      'ንባብ':
          ' ፈርሞህ አይዮፍታ                                                                                                    ትርጉም: ደብዳቤ',
    },
    {
      'id': 173,
      'name': 'Telefoonu',
      'ንባብ':
          ' ቴሌፎኑ                                                                                                                ትርጉም: ስልክ',
    },
    {
      'id': 174,
      'name': 'Telegraafa',
      'ንባብ':
          ' ቴሌግራፋ                                                                                                              ትርጉም: ቴሌግራፍ',
    },
    {
      'id': 175,
      'name': 'Teleksi',
      'ንባብ':
          'ቴሌክሲ                                                                                                                   ትርጉም: ቴሌክስ',
    },
    {
      'id': 176,
      'name': 'Safara',
      'ንባብ':
          ' ሰፈራ                                                                                                                    ትርጉም: ጉዞ',
    },
    {
      'id': 177,
      'name': 'Kompuyuteri ',
      'ንባብ':
          ' ኮምፒዩቴሪ                                                                                                           ትርጉም: ኮምፒዩተር',
    },
    {
      'id': 178,
      'name': 'Madaara',
      'ንባብ':
          'መዳራ                                                                                                                    ትርጉም: መመለስ',
    },
    {
      'id': 179,
      'name': 'Shufeeri',
      'ንባብ':
          'ሹፌሪ                                                                                                                         ትርጉም: ሹፌር',
    },
    {
      'id': 180,
      'name': 'Haadise/Payleeti',
      'ንባብ':
          'ሃዲሲ/ፐይሌቲ                                                                                       ትርጉም: ፓይለት',
    },
    {
      'id': 181,
      'name': 'Naakuda',
      'ንባብ':
          'ናኩዳ                                                                                               ትርጉም: የመርከብ ካፕቴን',
    },
    {
      'id': 182,
      'name': 'Bacriyaytu',
      'ንባብ':
          'በህሪያይቱ                                                                                            ትርጉም: ባህረኛ',
    },
    {
      'id': 183,
      'name': 'TIkeeti ',
      'ንባብ':
          'ትኬቱ                                                                                               ትርጉም: ትኬት',
    },
    {
      'id': 184,
      'name': 'Gexo ',
      'ንባብ':
          'ጌሮ                                                                                                    ትርጉም: ጉዞ',
    },
    {
      'id': 185,
      'name': 'Ossokooko moyta',
      'ንባብ':
          'ኦስሶ ኮኮሞይታ                                                                                                  ትርጉም: መቀዳደም',
    },
    {
      'id': 186,
      'name': 'Wacaysiri',
      'ንባብ':
          'ወሃይሲሪ                                                                                                            ትርጉም: ቱሪዝም',
    },
    {
      'id': 187,
      'name': 'Wacaysire/a',
      'ንባብ':
          'ወሃሰይሬ/ራ                                                                                                         ትርጉም: ቱሪስት/ቱሪስቶች',
    },
    {
      'id': 188,
      'name': 'Hoteeli',
      'ንባብ':
          'ሆቴላ                                                                                                              ትርጉም: ሆቴል',
    },
    {
      'id': 189,
      'name': 'Gufne/Ziyaara',
      'ንባብ':
          'ጉፍኔ                                                                                                            ትርጉም: ጉብኝት',
    },
    {
      'id': 190,
      'name': 'Qibnaytu',
      'ንባብ':
          'ዒብናይቱ                                                                                                              ትርጉም: እንግዳ',
    },
    {
      'id': 191,
      'name': 'Goqonta',
      'ንባብ':
          'ጎዖንታ                                                                                                                  ትርጉም: ማረፊያ',
    },
    {
      'id': 192,
      'name': 'Pazaporti',
      'ንባብ':
          'ፓዝፖርቲ                                                                                                                ትርጉም: ፓስፖርት',
    },
    {
      'id': 193,
      'name': 'tatur asta',
      'ንባብ':
          'ታቱር አስታ                                                                                                              ትርጉም: የይለፍ ምልክት',
    },
    {
      'id': 194,
      'name': 'culma',
      'ንባብ':
          'ሁልማ                                                                                                                   ትርጉም: ሁልማ',
    },
    {
      'id': 195,
      'name': 'insipid',
      'ንባብ':
          'ሁልማ                                                                                                                      ትርጉም: ሁልማ',
    },
    {
      'id': 196,
      'name': 'Ellesugah ikaama',
      'ንባብ':
          'ኤልሌሱጋሃ ኢካማ                                                                                                     ትርጉም: ኤልሌሱጋህ ኢካማ',
    },
    {
      'id': 197,
      'name': 'Daaran',
      'ንባብ':
          'ዳራን                                                                                               ትርጉም: ቅርስ',
    },
    {
      'id': 198,
      'name': 'intermediary',
      'ንባብ':
          'ሁልማ                                                                                               ትርጉም: ሁልማ',
    },
    {
      'id': 199,
      'name': 'Diyaaran',
      'ንባብ':
          'ዲያራን                                                                                                 ትርጉም: ሙዝየም',
    },
    {
      'id': 200,
      'name': 'Siinima',
      'ንባብ':
          'ሲኒማ                                                                                                   ትርጉም: ሲኒማ',
    },
    {
      'id': 201,
      'name': 'parki',
      'ንባብ':
          'ፓርኪ                                                                                                     ትርጉም: ፓርክ',
    },
    {
      'id': 202,
      'name': 'Kalaata',
      'ንባብ':
          'ከላታ                                                                                                    ትርጉም: ክልክል',
    },
    {
      'id': 203,
      'name': 'idini',
      'ንባብ':
          'ኢዲኒ                                                                                                      ትርጉም: ፈቃድ',
    },
    {
      'id': 204,
      'name': 'Cina',
      'ንባብ':
          'ሒና                                                                                                        ትርጉም: አለመቀበል',
    },
    {
      'id': 205,
      'name': 'Ayfaafaya',
      'ንባብ':
          'አይፍፍያ                                                                                                ትርጉም: አገልግሎት',
    },
    {
      'id': 206,
      'name': 'Cugayyo',
      'ንባብ':
          'ሁጋይዬ                                                                                                  ትርጉም: ፕሮጀክት',
    },
    {
      'id': 207,
      'name': 'cuggaane',
      'ንባብ':
          'ሁግጋኔ                                                                                                  ትርጉም: ጎረቤት',
    },
    {
      'id': 208,
      'name': 'Deraafi',
      'ንባብ':
          'ድራፊ                                                                                                    ትርጉም: አካባቢ',
    },
    {
      'id': 209,
      'name': 'Caydu',
      'ንባብ':
          'ሃይዱ                                                                                                      ትርጉም: ዲንበር',
    },
    {
      'id': 210,
      'name': 'farrimtu',
      'ንባብ':
          'ፋርረሚቱ                                                                                                 ትርጉም: ኑዛዜ',
    },
    {
      'id': 211,
      'name': 'viiza',
      'ንባብ':
          'ቪዛ                                                                                                        ትርጉም: ቪዛ',
    },
    {
      'id': 212,
      'name': 'safar mixxaageyna',
      'ንባብ':
          'ሰፈር ሚድዳጌይና                                                                                                          ትርጉም: የጉዞ ወኪል',
    },
    {
      'id': 213,
      'name': 'uwwa',
      'ንባብ':
          'ኡውዋ                                                                                           ትርጉም: እቃ',
    },
    {
      'id': 214,
      'name': 'Gaba tirik',
      'ንባብ':
          'ገባት ቲሪክ                                                                                                  ትርጉም: የእጅ ባትሪ',
    },
    {
      'id': 215,
      'name': 'Aflitia',
      'ንባብ':
          'አፍሊታ                                                                                                        ትርጉም: እቃ',
    },
    {
      'id': 216,
      'name': 'Shanta',
      'ንባብ':
          'ሽንታ                                                                                                           ትርጉም: ጃንጥላ',
    },
    {
      'id': 217,
      'name': 'Giti karta',
      'ንባብ':
          'ጊታ ካርታ                                                                                                    ትርጉም: የመንገድ ካርታ',
    },
    {
      'id': 218,
      'name': 'Buxa/qari',
      'ንባብ':
          'ቡራ፣ዓሪ                                                                                                       ትርጉም: ቤት',
    },
    {
      'id': 219,
      'name': 'Sigo buxa',
      'ንባብ':
          'ሲጎ ቡራ                                                                                                      ትርጉም: መኖሪያ ቤት',
    },
    {
      'id': 220,
      'name': 'kabxa buxa',
      'ንባብ':
          'ካብራ ቡራ                                                                                                    ትርጉም: ንግድ ቤት',
    },
    {
      'id': 221,
      'name': 'Goli',
      'ንባብ':
          'ጎሊ                                                                                                               ትርጉም: ክፍል',
    },
    {
      'id': 222,
      'name': 'qibni goli',
      'ንባብ':
          'ኢበኒ ጎሊ                                                                                                     ትርጉም: የንግድ ክፍል',
    },
    {
      'id': 223,
      'name': 'xintima goli',
      'ንባብ':
          'ዲንቲማ ጎሊ                                                                                                  ትርጉም: መኝታ ክፍል',
    },
    {
      'id': 224,
      'name': 'Gira dabu',
      'ንባብ':
          'ጊራ ዳቡ                                                                                                        ትርጉም: ማዕድ ቤት',
    },
    {
      'id': 225,
      'name': 'kadco dabu',
      'ንባብ':
          'ካድሆ ዳቡ                                                                                                      ትርጉም: ሽንት ቤት',
    },
    {
      'id': 226,
      'name': 'Baaxa',
      'ንባብ':
          'ባኣራ                                                                                                                ትርጉም: ወለል',
    },
    {
      'id': 227,
      'name': 'mundane',
      'ንባብ':
          'ገባት ቲሪክ                                                                                                         ትርጉም: እቃ',
    },
    {
      'id': 228,
      'name': 'munificent',
      'ንባብ':
          'ታርማን                                                                                                        ትርጉም: ጣራ',
    },
    {
      'id': 229,
      'name': 'Guna',
      'ንባብ':
          'ጎና                                                                                                                 ትርጉም: ጓዳ',
    },
    {
      'id': 230,
      'name': 'Dassa',
      'ንባብ':
          'ዳስ                                                                                                               ትርጉም: ሳር ቤት',
    },
    {
      'id': 231,
      'name': 'Kalqata',
      'ንባብ':
          'ከልዓታ                                                                                                          ትርጉም: ግንብ ቤት',
    },
    {
      'id': 232,
      'name': 'handaga',
      'ንባብ':
          'ሃንዳጋ                                                                                                           ትርጉም: አዳራሽ',
    },
    {
      'id': 233,
      'name': 'Alfenta/baaba',
      'ንባብ':
          'አልፈንታ/ባባ                                                                                                 ትርጉም: በር',
    },
    {
      'id': 234,
      'name': 'Taagata',
      'ንባብ':
          'ታጋታ                                                                                                            ትርጉም: መስኮት',
    },
    {
      'id': 235,
      'name': 'Miizi',
      'ንባብ':
          'ሚዝ                                                                                                               ትርጉም: ጠረጴዛ',
    },
    {
      'id': 236,
      'name': 'Kursi',
      'ንባብ':
          'ኩርሲ                                                                                                                ትርጉም: ወንበር',
    },
    {
      'id': 237,
      'name': 'Doolaaba',
      'ንባብ':
          'ዶኦላባ                                                                                                            ትርጉም: ቁም ሳጥን',
    },
    {
      'id': 238,
      'name': 'Qarkayto',
      'ንባብ':
          'ዓርከይቶ                                                                                                          ትርጉም: አልጋ',
    },
    {
      'id': 239,
      'name': 'Maaqo',
      'ንባብ':
          'ማኦ                                                                                                                 ትርጉም: ምግብ',
    },
    {
      'id': 240,
      'name': 'Lee',
      'ንባብ':
          'ሌይ                                                                                                                   ትርጉም: ውሃ',
    },
    {
      'id': 241,
      'name': 'Cana',
      'ንባብ':
          'ሃና                                                                                                                  ትርጉም: ወተት',
    },
    {
      'id': 242,
      'name': 'Cado',
      'ንባብ':
          'ሃዶ                                                                                                                  ትርጉም: ስጋ',
    },
    {
      'id': 243,
      'name': 'Goqammo/Goggo',
      'ንባብ':
          'ጋዓምሞ/ጎግጎ                                                                                                   ትርጉም: ዳቦ',
    },
    {
      'id': 244,
      'name': 'Subaaca',
      'ንባብ':
          'ሱባሃ                                                                                                              ትርጉም: ቅቤ',
    },
    {
      'id': 245,
      'name': 'Malaba',
      'ንባብ':
          'ማለባ                                                                                                               ትርጉም: ማር',
    },
    {
      'id': 246,
      'name': 'Qsabo',
      'ንባብ':
          'ዓስቦ                                                                                                                 ትርጉም: ጨው',
    },
    {
      'id': 247,
      'name': 'Kulluumu',
      'ንባብ':
          'ኩልሉሞ                                                                                                            ትርጉም: ዓሳ',
    },
    {
      'id': 248,
      'name': 'Naala',
      'ንባብ':
          'ናላ                                                                                                                  ትርጉም: እንቁላል',
    },
    {
      'id': 249,
      'name': 'Zeyti',
      'ንባብ':
          'ዘይት                                                                                                                 ትርጉም: ዘይት',
    },
    {
      'id': 250,
      'name': 'RUddi',
      'ንባብ':
          'ሩድዲ                                                                                                                 ትርጉም: ሩዝ',
    },
    {
      'id': 251,
      'name': 'Fuulu',
      'ንባብ':
          'ፉሉ,                                                                                                                ትርጉም: ፉል'
    },
    {
      'id': 252,
      'name': 'Rigidda',
      'ንባብ':
          'ራጊዲዳ                                                                                                              ትርጉም: እርጎ',
    },
    {
      'id': 253,
      'name': 'Shaahi',
      'ንባብ':
          'ሻሂ                                                                                                                 ትርጉም: ሻይ',
    },
    {
      'id': 254,
      'name': 'Buna',
      'ንባብ':
          'ቡና                                                                                                                   ትርጉም: ቡና',
    },
    {
      'id': 255,
      'name': 'Saalo/idaama',
      'ንባብ':
          'ሳሎ/ኢዳማ                                                                                                      ትርጉም: ወጥ',
    },
    {
      'id': 256,
      'name': 'Qeero kalo',
      'ንባብ':
          'ኤርክ ካሎ                                                                                                        ትርጉም: ቁርስ',
    },
    {
      'id': 257,
      'name': 'Mayo/Bodda',
      'ንባብ':
          'ማዬ/ቦድዳ                                                                                                        ትርጉም: ምሳ',
    },
    {
      'id': 258,
      'name': 'Diraara/Afxago',
      'ንባብ':
          'ዲሪራ/አፍደጎ                                                                                                   ትርጉም: እራት',
    },
    {
      'id': 259,
      'name': 'Miidi/Quusu',
      'ንባብ':
          'ሚዲ/ኡሱ                                                                                                        ትርጉም: ቁርስ',
    },
    {
      'id': 260,
      'name': 'Buri',
      'ንባብ':
          'ቡሪ                                                                                                                   ትርጉም: ዱቄት',
    },
    {
      'id': 261,
      'name': 'Ammo',
      'ንባብ':
          'አሞ                                                                                                                   ትርጉም: ጥሬ',
    },
    {
      'id': 262,
      'name': 'Caffali',
      'ንባብ':
          'ሃፍፋሊ                                                                                                              ትርጉም: ገብስ',
    },
    {
      'id': 263,
      'name': 'Sirrayya',
      'ንባብ':
          'ሲርራያ                                                                                                             ትርጉም: ስንዴ',
    },
    {
      'id': 264,
      'name': 'Gerbesilla',
      'ንባብ':
          'ጌርቤሲልላ                                                                                                         ትርጉም: በቆሎ',
    },
    {
      'id': 265,
      'name': 'Koora',
      'ንባብ':
          'ኮኦራ                                                                                                                 ትርጉም: ገበቴ',
    },
    {
      'id': 266,
      'name': 'Sacni',
      'ንባብ':
          'ሳህኒ                                                                                                                  ትርጉም: ሳጥን',
    },
    {
      'id': 267,
      'name': 'Ayni',
      'ንባብ':
          'አይኒ                                                                                                                   ትርጉም: የወተት ማለቢያ',
    },
    {
      'id': 268,
      'name': 'Koxxa/Canti',
      'ንባብ':
          'ኮድዳ                                                                                                            ትርጉም: የወተት አቅማዳ',
    },
    {
      'id': 269,
      'name': 'Qokkasa',
      'ንባብ':
          'ዖክካሳ                                                                                                               ትርጉም: የወተት አቅማዳ',
    },
    {
      'id': 270,
      'name': 'Basala',
      'ንባብ':
          'በሳላ                                                                                                                 ትርጉም: ሽንኩርት',
    },
    {
      'id': 271,
      'name': 'Bataatsi/Bataate',
      'ንባብ':
          'ባታቲሲ/ባታ አታ                                                                                               ትርጉም: ድንች',
    },
    {
      'id': 272,
      'name': 'Barabare',
      'ንባብ':
          'ባርባሬ                                                                                                              ትርጉም: በርበሬ',
    },
    {
      'id': 273,
      'name': 'Buti',
      'ንባብ':
          'ቡቲ                                                                                                                    ትርጉም: ድስት',
    },
    {
      'id': 274,
      'name': 'Guula',
      'ንባብ':
          'ጎላ                                                                                                                    ትርጉም: ብርድ ልብስ',
    },
    {
      'id': 275,
      'name': 'Ansoola',
      'ንባብ':
          'አንሶላ                                                                                                                ትርጉም: አንሶላ',
    },
    {
      'id': 276,
      'name': 'Sabu',
      'ንባብ':
          'ሳቡ                                                                                                                     ትርጉም: ጭልፋ',
    },
    {
      'id': 277,
      'name': 'Alayse',
      'ንባብ':
          'አላይሴ                                                                                                                 ትርጉም: አብሳይ',
    },
    {
      'id': 278,
      'name': 'Sartana',
      'ንባብ':
          'ሳርታና                                                                                                                ትርጉም: ልብስ',
    },
    {
      'id': 279,
      'name': 'Kabella',
      'ንባብ':
          'ከቤልላ                                                                                                                ትርጉም: ጫማ',
    },
    {
      'id': 280,
      'name': 'Sirwaalla',
      'ንባብ':
          'ሲርዋላ                                                                                                              ትርጉም:ሱሪ',
    },
    {
      'id': 281,
      'name': 'Shamiizi',
      'ንባብ':
          'ሰሚዚ                                                                                                                ትርጉም: ሸሚዝ',
    },
    {
      'id': 282,
      'name': 'Marto',
      'ንባብ':
          'ማርቶ                                                                                                                   ትርጉም: ሽርጥ',
    },
    {
      'id': 283,
      'name': 'Raraytu',
      'ንባብ':
          'ፍራሻ                                                                                                                 ትርጉም: ፍራሽ',
    },
    {
      'id': 284,
      'name': 'Barkuma',
      'ንባብ':
          'ባርኩማ                                                                                                                ትርጉም: ትራስ',
    },
    {
      'id': 285,
      'name': 'Firaasha',
      'ንባብ':
          'ፍራሻ                                                                                                                ትርጉም: ፍራሽ',
    },
    {
      'id': 286,
      'name': 'Ferranto',
      'ንባብ':
          'ፈርራንቶ                                                                                                               ትርጉም: ቀለበት',
    },
    {
      'id': 287,
      'name': 'Qatri',
      'ንባብ':
          'ዓትሪ                                                                                                                    ትርጉም: ሽቶ',
    },
    {
      'id': 288,
      'name': 'Saabunu',
      'ንባብ':
          'ሳቡኑ                                                                                                                  ትርጉም: ሳሙና',
    },
    {
      'id': 289,
      'name': 'Gile',
      'ንባብ':
          'ጊሌ                                                                                                                      ትርጉም: ቢላዋ',
    },
    {
      'id': 290,
      'name': 'Makasa',
      'ንባብ':
          'ማከሳ                                                                                                                   ትርጉም: መቀስ',
    },
    {
      'id': 291,
      'name': 'Maaka/malkaqa',
      'ንባብ':
          'ማካ/ማልካዓ                                                                                                        ትርጉም: ማንኪያ',
    },
    {
      'id': 292,
      'name': 'gira',
      'ንባብ':
          'ጊራ                                                                                                                       ትርጉም: እሳት',
    },
    {
      'id': 293,
      'name': 'Boco',
      'ንባብ':
          'ቦሆ                                                                                                                       ትርጉም: እንጨት',
    },
    {
      'id': 294,
      'name': 'Caxfexxa',
      'ንባብ':
          'ሃድፌድዳ                                                                                                                ትርጉም: ፍራፍሬ',
    },
    {
      'id': 295,
      'name': 'Caxaaxuwa',
      'ንባብ':
          'ሃራሩዋ                                                                                                                ትርጉም: አትክልት',
    },
    {
      'id': 296,
      'name': 'Caxfexxak caxaaxuwa',
      'ንባብ':
          'ሃድፌድዳ ሃራሩዋ                                                                                                                    ትርጉም: አትክልትና ፍራፍሬ',
    },
    {
      'id': 297,
      'name': 'Maaliyya',
      'ንባብ':
          'ማላይያ                                                                                                   ትርጉም: ፍይናንስ',
    },
    {
      'id': 298,
      'name': 'Miizaniyyata',
      'ንባብ':
          'ሚዛኒይያት                                                                                                             ትርጉም: ፍይናንስ',
    },
    {
      'id': 299,
      'name': 'Banki',
      'ንባብ':
          'ባንኪ                                                                                                                    ትርጉም: ባንክ',
    },
    {
      'id': 300,
      'name': 'Lakqo',
      'ንባብ':
          'ለክኦ                                                                                                                     ትርጉም: ገንዘብ',
    },
    {
      'id': 301,
      'name': 'Rata le lakqo',
      'ንባብ':
          'ራታ ሌ ላክዖ                                                                                                        ትርጉም: ውጭ ምንዛሬ',
    },
    {
      'id': 302,
      'name': 'Meeri',
      'ንባብ':
          'ሜሪ                                                                                                                       ትርጉም: ቀረጥ',
    },
    {
      'id': 303,
      'name': 'qasbi',
      'ንባብ':
          'ዒሶ                                                                                                                         ትርጉም: ግብር',
    },
    {
      'id': 304,
      'name': 'maali fullu',
      'ንባብ':
          'ማሊ ፉሉ                                                                                                             ትርጉም: ኢኮኖሚ መጨመር',
    },
    {
      'id': 305,
      'name': 'maali daaca',
      'ንባብ':
          'ማሊ ዳሃ                                                                                                              ትርጉም: ኢኮኖሚ ውድቀት',
    },
    {
      'id': 306,
      'name': 'kabxa',
      'ንባብ':
          'ካብራ                                                                                                                      ትርጉም: ወጪ',
    },
    {
      'id': 307,
      'name': 'kbxa abe',
      'ንባብ':
          'ካብራ አቤ                                                                                                                ትርጉም: ገቢ',
    },
    {
      'id': 308,
      'name': 'miizaaniyya liggida ',
      'ንባብ':
          'ሚዛኒይያ ሊግጊዳ                                                                                                           ትርጉም: ብሔራዊ ገቢ',
    },
    {
      'id': 309,
      'name': 'mekla',
      'ንባብ':
          'ሜክላ                                                                                                           ትርጉም: ደመወዝ',
    },
    {
      'id': 310,
      'name': 'mellebi',
      'ንባብ':
          'ሜልለቢ                                                                                                        ትርጉም: ማሊሲራ',
    },
    {
      'id': 311,
      'name': 'melleb fayya',
      'ንባብ':
          'ሜልለብ ፍይያ                                                                                                ትርጉም: ካብራ',
    },
    {
      'id': 312,
      'name': 'nawwa ',
      'ንባብ':
          'ናውዋ                                                                                                           ትርጉም: ዝቅጠት',
    },
    {
      'id': 313,
      'name': 'tellemo',
      'ንባብ':
          'ቴሌልሞ                                                                                                         ትርጉም: የንግድ ልውውጥ',
    },
    {
      'id': 314,
      'name': 'Limo',
      'ንባብ':
          'ሊሞ                                                                                                              ትርጉም: ሽያጭ',
    },
    {
      'id': 315,
      'name': 'Boqa',
      'ንባብ':
          'ቦአ                                                                                                               ትርጉም: ችርቻሮ',
    },
    {
      'id': 316,
      'name': 'Xeefo/tirfi',
      'ንባብ':
          'ደፎ/ትርፍ                                                                                                    ትርጉም: ትርፍ',
    },
    {
      'id': 317,
      'name': 'Kamiimo',
      'ንባብ':
          'ከሚም                                                                                                           ትርጉም: እጥረት',
    },
    {
      'id': 318,
      'name': 'Xalot',
      'ንባብ':
          'ዳሎት                                                                                                             ትርጉም: ወለድ',
    },
    {
      'id': 319,
      'name': 'Salaca',
      'ንባብ':
          'ሳላሃ                                                                                                             ትርጉም: መላላት',
    },
    {
      'id': 320,
      'name': 'Keexo',
      'ንባብ':
          'ኪሮ                                                                                                               ትርጉም:መመዘን',
    },
    {
      'id': 321,
      'name': 'kexxeena',
      'ንባብ':
          'ኬረና                                                                                                           ትርጉም: ሚዛን',
    },
    {
      'id': 322,
      'name': 'caglino',
      'ንባብ':
          'ሃግሊኖ                                                                                                           ትርጉም: ሞኖፖል',
    },
    {
      'id': 323,
      'name': 'Badaaqata',
      'ንባብ':
          'በዳዓታ                                                                                                         ትርጉም: ሸቀጥ',
    },
    {
      'id': 324,
      'name': 'Mali tabsu',
      'ንባብ':
          'ማሊታብሱ                                                                                                      ትርጉም: ሃዋላ',
    },
    {
      'id': 325,
      'name': 'Rassal maal',
      'ንባብ':
          'ራሳልማል                                                                                                      ትርጉም: ካፒታል',
    },
    {
      'id': 326,
      'name': 'Maglaba',
      'ንባብ':
          'ማግላባ                                                                                                            ትርጉም: ድርሻ',
    },
    {
      'id': 327,
      'name': 'Mago',
      'ንባብ':
          'ማጎ                                                                                                                ትርጉም: እዳ',
    },
    {
      'id': 328,
      'name': 'Xaamiyya',
      'ንባብ':
          'ዳሚይያ                                                                                                          ትርጉም: መግዛት',
    },
    {
      'id': 329,
      'name': 'Aylammiyya',
      'ንባብ':
          'አይላምሚይያ                                                                                                     ትርጉም: መሸጥ',
    },
    {
      'id': 330,
      'name': 'Madruuru',
      'ንባብ':
          'ሚድሩሩ                                                                                                          ትርጉም: ደንበኛ',
    },
    {
      'id': 331,
      'name': 'Kubqi',
      'ንባብ':
          'ኩብዒ                                                                                                               ትርጉም: ውድነት',
    },
    {
      'id': 332,
      'name': 'Aamantisso',
      'ንባብ':
          'አማንቲሲስ                                                                                                        ትርጉም: መድህን',
    },
    {
      'id': 333,
      'name': 'Daalisso',
      'ንባብ':
          'ዳሊስሶ                                                                                                             ትርጉም: ኢንቨስትመንት',
    },
    {
      'id': 334,
      'name': 'Amolladi limo',
      'ንባብ':
          'አሞልላዲ ሊም                                                                                                   ትርጉም: ጅምላ ሽያጭ',
    },
    {
      'id': 335,
      'name': 'Qadaaga',
      'ንባብ':
          'አዳጋ                                                                                                               ትርጉም: ገበያ',
    },
    {
      'id': 336,
      'name': 'Dahab qadaaga',
      'ንባብ':
          'ዳሃብ አዳጋ                                                                                                     ትርጉም: የወርቅ ገበያ',
    },
    {
      'id': 337,
      'name': 'Saqi qadaaga',
      'ንባብ':
          'ሳዒ ዓዳጋ                                                                                                       ትርጉም: የከብት ገበይ',
    },
    {
      'id': 338,
      'name': 'daro qadaaga',
      'ንባብ':
          'ዳሮ አዳጋ                                                                                                       ትርጉም: እህል ገበያ',
    },
    {
      'id': 339,
      'name': 'sari qadaaga',
      'ንባብ':
          'ሳሪ አዳጋ                                                                                                        ትርጉም: የልብስ ገበያ',
    },
    {
      'id': 340,
      'name': 'sansi/sirag le lee',
      'ንባብ':
          'ሚዛኒይያት                                                                                                 ትርጉም: ፍይናንስ',
    },
    {
      'id': 341,
      'name': 'sansi/sirag le lee',
      'ንባብ':
          'ሳንሲ/ሲራግለ ሌ                                                                                                                 ትርጉም: ነዳጅ',
    },
    {
      'id': 342,
      'name': 'dahab bicse',
      'ንባብ':
          'ዳሃብ ቤህሴ                                                                                                              ትርጉም: ወርቅ ሰሪ',
    },
    {
      'id': 343,
      'name': 'Biriitia bicse',
      'ንባብ':
          'ቤሪታ ቢህሴ                                                                                                               ትርጉም: ብረታ ብረት ሰሪ',
    },
    {
      'id': 344,
      'name': 'waaridat/baahenta',
      'ንባብ':
          'ዋሪዳት፣ባሄንታ                                                                                                           ትርጉም: ላኪ',
    },
    {
      'id': 345,
      'name': 'saadirat/Ruubenta',
      'ንባብ':
          'ሳዲራት/ሩቤንት                                                                                                               ትርጉም: አስመጪ',
    },
    {
      'id': 346,
      'name': 'wakiili',
      'ንባብ':
          'ዋኪል                                                                                                                       ትርጉም: ወኪል',
    },
    {
      'id': 347,
      'name': 'Murtiseena ',
      'ንባብ':
          'ሙርቴሴይና                                                                                                                ትርጉም: አምራች',
    },
    {
      'id': 348,
      'name': 'Xagiteena',
      'ንባብ':
          'ዳጊቴይና                                                                                                                   ትርጉም: ሽማች',
    },
    {
      'id': 349,
      'name': 'Kalalu',
      'ንባብ':
          'ካለሉ                                                                                                                       ትርጉም: መከላከያ',
    },
    {
      'id': 350,
      'name': 'carbi',
      'ንባብ':
          'ሃርቢ                                                                                                                    ትርጉም: ጦርነት',
    },
    {
      'id': 351,
      'name': 'Maysataka',
      'ንባብ':
          'ማይሳታካ                                                                                                              ትርጉም: ውጊያ',
    },
    {
      'id': 352,
      'name': 'Wagari',
      'ንባብ':
          'ዋጋሪ                                                                                                                    ትርጉም: ሰላም',
    },
    {
      'id': 353,
      'name': 'Gayse/lacaw',
      'ንባብ':
          'ጋይሴ/ላሃው                                                                                                           ትርጉም: ደጋን',
    },
    {
      'id': 354,
      'name': 'Gayse baxa',
      'ንባብ':
          'ጋይሰብራ                                                                                                                   ትርጉም: ቀስት',
    },
    {
      'id': 355,
      'name': 'qande/macaxu',
      'ንባብ':
          'አንዳ/ማሃሩ                                                                                                              ትርጉም: ጦር',
    },
    {
      'id': 356,
      'name': 'Goobu',
      'ንባብ':
          'ጎቡ                                                                                                                ትርጉም: ጋሻ',
    },
    {
      'id': 357,
      'name': 'seefi',
      'ንባብ':
          'ሴፊ                                                                                                                ትርጉም: ሰይፍ',
    },
    {'id': 358, 'name': 'bombi ', 'ንባብ': '  ቦምቢ	  ትርጉም:ቦምብ'},
    {
      'id': 359,
      'name': 'Fardi/xonko gira  ',
      'ንባብ':
          'ፋርዲ/ዶንኮግ ጊራ	   	                                                                                                          ትርጉም:ሽጉጥ'
    },
    {
      'id': 358,
      'name': 'Dabbaaba ',
      'ንባብ':
          ' ድብባባ	         	                                                                                                           ትርጉም:ታንክ'
    },
    {
      'id': 360,
      'name': 'Saaruuku ',
      'ንባብ':
          'ሳሩኩ	           	                                                                                                           ትርጉም:ሮኬት'
    },
    {
      'id': 361,
      'name': ' Warara',
      'ንባብ':
          'ዋራራ	             	                                                                                                           ትርጉም:ወረራ'
    },
    {
      'id': 362,
      'name': ' Madfaqa',
      'ንባብ':
          'መዳፍዓ	           	                                                                                                           ትርጉም:መድፍ'
    },
    {
      'id': 362,
      'name': 'Dadho ',
      'ንባብ':
          'ዳድሆ	                	                                                                                                          ትርጉም:ማጥቃት'
    },
    {
      'id': 363,
      'name': ' Hirgimiyya',
      'ንባብ':
          'ሂርጊሚይያ	       	                                                                                                           ትርጉም:ማፈግፈግ'
    },
    {
      'id': 364,
      'name': ' Mayso',
      'ንባብ':
          'ማይሶ	               	                                                                                                           ትርጉም:ድል'
    },
    {
      'id': 365,
      'name': ' iysa',
      'ንባብ':
          'ኢይሳ	               	                                                                                                           ትርጉም:ድል ማድረግ'
    },
    {
      'id': 366,
      'name': 'Gaciyya/buka ',
      'ንባብ':
          'ጋሂይያ/ቡካ	    	                                                                                                          ትርጉም:መሸነፍ'
    },
    {
      'id': 367,
      'name': 'seewa ',
      'ንባብ':
          'ሴዋ	               	                                                                                                           ትርጉም:ምርኮኛ'
    },
    {
      'id': 369,
      'name': 'Daanaba ',
      'ንባብ':
          'ደናባ              	                                                                                                          	ትርጉም:የምርኮ ንብረት'
    },
    {
      'id': 370,
      'name': ' Bara',
      'ንባብ':
          'ባራ                   	                                                                                                           ትርጉም: ተኩስ አቁም'
    },
    {
      'id': 371,
      'name': 'Gaadule ',
      'ንባብ':
          'ጋዱሌ	              	                                                                                                          ትርጉም:ሽምቅ ተዋጊ'
    },
    {
      'id': 372,
      'name': ' Ganaasaqo',
      'ንባብ':
          'ጋናሳዖ	         	                                                                                                            ትርጉም:ግጭት'
    },
    {
      'id': 373,
      'name': ' Salala',
      'ንባብ':
          'ሳላላ	             	                                                                                                            ትርጉም:ጦር ሰፈር'
    },
    {
      'id': 374,
      'name': 'Rusasa ',
      'ንባብ':
          'ሩሳሳ	             	                                                                                                            ትርጉም:ጥይት'
    },
    {
      'id': 375,
      'name': ' Silaaca',
      'ንባብ':
          'ሲላሃ             	                                                                                                           	ትርጉም:መሳሪያ'
    },
    {
      'id': 376,
      'name': ' Gabqasa',
      'ንባብ':
          'ጋብዓሳ		                                                                                                          ትርጉም:ሲቪል'
    },
    {
      'id': 377,
      'name': 'sibayba ',
      'ንባብ':
          'ሲባይባ		                                                                                                          ትርጉም:ቃኚ'
    },
    {
      'id': 378,
      'name': ' Giba',
      'ንባብ':
          'ጊባ		                                                                                                          ትርጉም:ቃፊር'
    },
    {
      'id': 379,
      'name': 'Dale ',
      'ንባብ':
          'ዳሌ	                                                                                                          	ትርጉም:ቁስል'
    },
    {
      'id': 380,
      'name': ' Mudulli',
      'ንባብ':
          'ሙዱልሊ	                                                                                                          	ትርጉም:መቁሰል'
    },
    {
      'id': 381,
      'name': 'Dale ',
      'ንባብ':
          'ዳሌ  	                                                                                                           ትርጉም:	ቁስል'
    },
    {
      'id': 382,
      'name': ' Maqasakara',
      'ንባብ':
          'ማዓስከራ	                                                                                                          	ትርጉም:የጦር ካምፕ'
    },
    {
      'id': 383,
      'name': ' Miraaca',
      'ንባብ':
          'ሚራህ	                                                                                                          	ትርጉም:መሪ'
    },
    {
      'id': 384,
      'name': ' qande',
      'ንባብ':
          'ዓንዴ	                                                                                                          	ትርጉም:ሃይል'
    },
    {
      'id': 385,
      'name': 'qaskartu ',
      'ንባብ':
          'ዓስከርቱ		                                                                                                          ትርጉም:ወታደር'
    },
    {
      'id': 386,
      'name': ' Tabanaba',
      'ንባብ':
          'ታባንአአብባ	                                                                                                          	ትርጉም:አስር አለቃ'
    },
    {
      'id': 387,
      'name': 'Boolabba ',
      'ንባብ':
          'ቦኦል አብባ	                                                                                                          	ትርጉም:መቶ አለቃ'
    },
    {
      'id': 388,
      'name': ' Shambala',
      'ንባብ':
          'ሻምባላ	                                                                                                          	ትርጉም:ዛምበል'
    },
    {
      'id': 389,
      'name': ' Fereyeli',
      'ንባብ':
          'ፈረይሊ	                                                                                                          ትርጉም:	ሻለቃ'
    },
    {
      'id': 390,
      'name': ' Konoyli',
      'ንባብ':
          'ኮኖይሊ		                                                                                                          ትርጉም:ኮሎኔል'
    },
    {
      'id': 391,
      'name': 'jeneral ',
      'ንባብ':
          'ጀነራል		                                                                                                          ትርጉም:ጀነራል'
    },
    {
      'id': 392,
      'name': 'macxiyoomeh ',
      'ንባብ':
          'ማህሪ ዬሜህ	                                                                                                           ትርጉም:	ጦሩ ተጣላ（ተጋጨ）'
    },
    {
      'id': 393,
      'name': 'macxi yemeqeh ',
      'ንባብ':
          'ማህሪ የምኤህ		                                                                                                          ትርጉም:ጦሩ ታረቀ'
    },
    {
      'id': 394,
      'name': 'qalla heen ',
      'ንባብ':
          'አልላ ሄየን		                                                                                                          ትርጉም:ቃል ተግባቡ'
    },
    {
      'id': 395,
      'name': 'kollih anyo ',
      'ንባብ':
          'ኮልሊህ አንዬ	                                                                                                          	ትርጉም:መወገን '
    },
    {
      'id': 396,
      'name': 'yenkee lefen ',
      'ንባብ':
          'ዬንኬሌፈን		                                                                                                          ትርጉም:ተጋጩ'
    },
    {
      'id': 397,
      'name': ' Gino',
      'ንባብ':
          'ጊኖ		                                                                                                          ትርጉም:ተፈጥሮ'
    },
    {
      'id': 398,
      'name': 'Ardi ',
      'ንባብ':
          '	አርዲ	                                                                                                          	ትርጉም:መሬት'
    },
    {'id': 399, 'name': ' Qaran', 'ንባብ': ''},
    {
      'id': 400,
      'name': ' Ayro',
      'ንባብ':
          'አይሮ		                                                                                                          ትርጉም:ጸሃይ'
    },
    {
      'id': 401,
      'name': ' Alsa',
      'ንባብ':
          'አልሳ		                                                                                                          ትርጉም:ጨረቃ'
    },
    {
      'id': 402,
      'name': 'Bada ',
      'ንባብ':
          'ባዳ		                                                                                                          ትርጉም:ባህር'
    },
    {
      'id': 403,
      'name': 'Badiida ',
      'ንባብ':
          'ባዲዳ		                                                                                                          ትርጉም:ውቅያኖስ'
    },
    {
      'id': 404,
      'name': ' Barri',
      'ንባብ':
          'ባርሪ	                                                                                                          ትርጉም:	ገጠር'
    },
    {
      'id': 405,
      'name': ' Qayso',
      'ንባብ':
          'ዓይሶ	                                                                                                          ትርጉም:	ሳር'
    },
    {
      'id': 406,
      'name': ' Bacari',
      'ንባብ':
          'ባሃሪ	                                                                                                          ትርጉም:	ሜዳ'
    },
    {
      'id': 407,
      'name': ' Garbo',
      'ንባብ':
          'ጋርቦ		                                                                                                          ትርጉም:ጫካ'
    },
    {
      'id': 408,
      'name': ' Qale',
      'ንባብ':
          'አሌ	                                                                                                          	ትርጉም:ተራራ'
    },
    {
      'id': 409,
      'name': ' Bayyaaci',
      'ንባብ':
          'ባይያአሂ	                                                                                                          	ትርጉም:ጠጠር'
    },
    {
      'id': 410,
      'name': ' Qidde',
      'ንባብ':
          'ዒድዴ	                                                                                                          	ትርጉም:አሸዋ'
    },
    {
      'id': 410,
      'name': ' Weeqaytu',
      'ንባብ':
          'ዌኤዓይቱ	                                                                                                          	ትርጉም:ውሃ  '
    },
    {
      'id': 411,
      'name': ' Daqaara',
      'ንባብ':
          'ዳዓራ		                                                                                                          ትርጉም:ገባር ወንዝ/ወረዳ'
    },
    {
      'id': 412,
      'name': ' Roobu',
      'ንባብ':
          'ሮኦቡ		                                                                                                          ትርጉም:ዳመና '
    },
    {
      'id': 413,
      'name': ' Barada',
      'ንባብ':
          'ባራዳ	                                                                                                          	ትርጉም:ዝናብ'
    },
    {
      'id': 414,
      'name': ' Angada',
      'ንባብ':
          'አንጋዳ	                                                                                                          	ትርጉም:በረዶ'
    },
    {
      'id': 415,
      'name': ' Cankara',
      'ንባብ':
          'ሃንካራ	                                                                                                          	ትርጉም:ነጎድጓድ'
    },
    {
      'id': 416,
      'name': 'Cutukta ',
      'ንባብ':
          'ሁቱክታ	                                                                                                          	ትርጉም:ኮከብ'
    },
    {
      'id': 417,
      'name': ' qeeri',
      'ንባብ':
          'ኤኤሪ	                                                                                                          	ትርጉም:ጭስ'
    },
    {
      'id': 418,
      'name': ' Qubulu',
      'ንባብ':
          'ዑቡሉ	                                                                                                          	ትርጉም:ጭጋግ'
    },
    {
      'id': 419,
      'name': ' Buuri',
      'ንባብ':
          'ቡኡሪ	                                                                                                          	ትርጉም:አፈር'
    },
    {
      'id': 420,
      'name': ' Kalla',
      'ንባብ':
          'ካልላ	                                                                                                          	ትርጉም:ጭቃ'
    },
    {
      'id': 421,
      'name': 'Dite ',
      'ንባብ':
          'ዲቴ	                                                                                                          ትርጉም:	ጨለማ'
    },
    {
      'id': 422,
      'name': ' Weeqa',
      'ንባብ':
          'ዊኤዓ		                                                                                                          ትርጉም:ጮራ፣ብርሃን'
    },
    {
      'id': 423,
      'name': ' Caacaya',
      'ንባብ':
          'ሃአሃያ	                                                                                                          	ትርጉም:ንፋስ'
    },
    {
      'id': 424,
      'name': 'Qaanale ',
      'ንባብ':
          'ዓአናሌ		                                                                                                          ትርጉም:አውሎ ንፋስ'
    },
    {
      'id': 425,
      'name': ' Baaxoh angoyya',
      'ንባብ': 'ባአሮህ አንጎይያ ትርጉም:	የመሬት መንቀጥቀጥ'
    },
    {
      'id': 426,
      'name': ' ungaaxa',
      'ንባብ':
          ' ኡንጋአራ		                                                                                                          ትርጉም:የባህ ሞገድ'
    },
    {
      'id': 427,
      'name': ' Kalu',
      'ንባብ':
          'ካሉ	                                                                                                          ትርጉም:	ሃይቅ'
    },
    {
      'id': 427,
      'name': ' Rosqa',
      'ንባብ':
          'ሮሰአ		                                                                                                          ትርጉም:የአየር ሁኔታ'
    },
    {
      'id': 428,
      'name': ' Hawa',
      'ንባብ':
          'ሃዋ		                                                                                                          ትርጉም:አየር'
    },
    {
      'id': 429,
      'name': 'Xaa ',
      'ንባብ':
          'ዳአ		                                                                                                          ትርጉም:ድንጋይ'
    },
    {
      'id': 430,
      'name': ' Alafkulli',
      'ንባብ':
          'አልፋኩልሊ		                                                                                                          ትርጉም:ድር እንስሳት'
    },
    {
      'id': 431,
      'name': ' saqa',
      'ንባብ':
          'ሰዓ 		                                                                                                          ትርጉም:እንስሳት'
    },
    {
      'id': 432,
      'name': ' Ala',
      'ንባብ':
          'አላ		                                                                                                          ትርጉም:አውሬ'
    },
    {
      'id': 433,
      'name': ' Reyta(Wadara)',
      'ንባብ':
          'ሬይታ/ዋደራ 	                                                                                                          ትርጉም:	ፍየል፣ፍየሎች'
    },
    {
      'id': 434,
      'name': 'Ida(illi) ',
      'ንባብ':
          'ኢዳ/ኢልሊ/	                                                                                                          	ትርጉም:በግ፣በጎች'
    },
    {
      'id': 435,
      'name': ' farasa',
      'ንባብ':
          'ፋራሳ	                                                                                                          	ትርጉም:ፈርስ'
    },
    {
      'id': 436,
      'name': ' Danana',
      'ንባብ':
          'ዳናና		                                                                                                          ትርጉም:አህያ'
    },
    {
      'id': 437,
      'name': ' Saga',
      'ንባብ':
          'ሳጋ/ላኣ	                                                                                                          	ትርጉም:ላም፣ላሞች'
    },
    {
      'id': 438,
      'name': ' Aguru',
      'ንባብ':
          'አጉሩ		                                                                                                          ትርጉም:በሬ'
    },
    {
      'id': 439,
      'name': ' Dummu',
      'ንባብ':
          'ዱምሙ		                                                                                                          ትርጉም:ድመት'
    },
    {
      'id': 440,
      'name': ' Ikiqyo(hantuuta)',
      'ንባብ':
          'ኢኪዕዮ/ሃንቱኡታ	    	                                                                                                          ትርጉም:አይጥ'
    },
    {
      'id': 441,
      'name': ' Bakkeela',
      'ንባብ':
          'ባክኬኤላ	                                                                                                          	ትርጉም:ጥንቸል'
    },
    {
      'id': 442,
      'name': ' Suula',
      'ንባብ':
          'ሱኡላ	 	                                                                                                            ትርጉም:ተኩላ'
    },
    {
      'id': 443,
      'name': ' yangula',
      'ንባብ':
          'ያንጉላ		                                                                                                          ትርጉም:ጅብ'
    },
    {
      'id': 444,
      'name': ' Kabqi',
      'ንባብ':
          'ካብኢ	 	                                                                                                           ትርጉም:ነብር'
    },
    {
      'id': 445,
      'name': ' Waqri',
      'ንባብ':
          'ዋክሪ	                                                                                                          	ትርጉም:ቀበሮ'
    },
    {
      'id': 446,
      'name': 'Damaqtu ',
      'ንባብ':
          'ማዕቱ	  	                                                                                                          ትርጉም:ዝንጀሮ'
    },
    {
      'id': 447,
      'name': ' Lubaaka',
      'ንባብ':
          'ሉባአካ		                                                                                                          ትርጉም:አንበሳ'
    },
    {
      'id': 448,
      'name': ' Dakanu',
      'ንባብ':
          'ደካኑ		                                                                                                          ትርጉም:ዝሆን'
    },
    {
      'id': 449,
      'name': ' Qangi',
      'ንባብ':
          'አንጊ	                                                                                                          	ትርጉም:አውሬ'
    },
    {
      'id': 450,
      'name': ' Dubaala',
      'ንባብ':
          'ዱባላ	                                                                                                          	ትርጉም:የዱር አውሬ'
    },
    {
      'id': 451,
      'name': ' Garaala',
      'ንባብ':
          'ጋራዓላ		                                                                                                          ትርጉም:ለማዳ እንስሳ'
    },
    {
      'id': 452,
      'name': ' Goroyya',
      'ንባብ':
          'ጎሮይያ		                                                                                                          ትርጉም:ሰጎን'
    },
    {
      'id': 453,
      'name': ' Dorrahi',
      'ንባብ':
          'ዶርራሂ		                                                                                                          ትርጉም:ዶሮ'
    },
    {
      'id': 454,
      'name': ' Kuta',
      'ንባብ':
          'ኩታ     	                                                                                                             ትርጉም:    ውሻ'
    },
    {
      'id': 455,
      'name': ' Ranse',
      'ንባብ':
          ' አላ		                                                                                                          ትርጉም:ሴት ግመል'
    },
    {
      'id': 456,
      'name': ' Rakuubu',
      'ንባብ':
          'ራኩኡቡ	                                                                                                          	ትርጉም:ግመል（ወንድ）'
    },
    {
      'id': 457,
      'name': ' Gaala',
      'ንባብ':
          'ጋአላ		                                                                                                          ትርጉም:ግመሎች'
    },
    {
      'id': 458,
      'name': ' Daqama',
      'ንባብ':
          'ዳዓማ	ሽልምልማም 	                                                                                                          ትርጉም:ሜዳ አህያ'
    },
    {
      'id': 459,
      'name': ' Wayxexxa',
      'ንባብ':
          'ዋይዴድዳ		                                                                                                          ትርጉም:ሜዳ አህያ'
    },
    {
      'id': 460,
      'name': ' Gari',
      'ንባብ':
          'ጋሪ	                                                                                                          	ትርጉም:ቀጭኔ'
    },
    {
      'id': 461,
      'name': ' Biqida',
      'ንባብ':
          'ቢኢዳ	                                                                                                          	ትርጉም:ሳላ'
    },
    {
      'id': 462,
      'name': ' Xabaado',
      'ንባብ':
          'ዳባኦዳ	                                                                                                          	ትርጉም:አዞ'
    },
    {
      'id': 463,
      'name': ' Kullumta',
      'ንባብ':
          'ኩልሉምታ	                                                                                                          	ትርጉም:አሳ'
    },
    {
      'id': 464,
      'name': ' Dullu',
      'ንባብ':
          'ድኡሉ	                                                                                                          	ትርጉም:ጉማሬ'
    },
    {
      'id': 465,
      'name': ' Baxanna',
      'ንባብ':
          'ባራንና	                                                                                                          	ትርጉም:እንቁራሪት'
    },
    {
      'id': 466,
      'name': ' Gurqu',
      'ንባብ':
          'ጉርዑ	                                                                                                          	ትርጉም:አውራሪስ'
    },
    {
      'id': 467,
      'name': ' Gasi',
      'ንባብ':
          'ጊሲ		                                                                                                          ትርጉም:ጎሽ'
    },
    {
      'id': 468,
      'name': ' Kuraanu',
      'ንባብ':
          'ኩራአኑ		                                                                                                          ትርጉም:ቁራ'
    },
    {
      'id': 469,
      'name': ' Kimbiro',
      'ንባብ':
          'ኪምቢሮ		                                                                                                          ትርጉም:ወፍ'
    },
    {
      'id': 470,
      'name': ' Goomaqa',
      'ንባብ':
          'ጎአማዓ		                                                                                                          ትርጉም:እርግብ'
    },
    {
      'id': 471,
      'name': ' Qawi(tiko)',
      'ንባብ':
          'ዓዊ/ቲኮ		                                                                                                          ትርጉም:ጭልፊት'
    },
    {
      'id': 472,
      'name': ' Gumaytu',
      'ንባብ':
          'ጎማይቱ	ጆፌ 	                                                                                                          ትርጉም:አሞራ'
    },
    {
      'id': 473,
      'name': ' Koxxali',
      'ንባብ':
          'ኮድዳሌ		                                                                                                          ትርጉም:አባኮዳ'
    },
    {
      'id': 474,
      'name': ' Xaariyaytu',
      'ንባብ':
          'ዳአሪያይቱ	                                                                                                          	ትርጉም:ትል'
    },
    {
      'id': 475,
      'name': 'Qaro ',
      'ንባብ':
          'ዓሮ		                                                                                                          ትርጉም:ሸረሪት'
    },
    {
      'id': 476,
      'name': ' Xuune',
      'ንባብ':
          'ዱኡኔ 	                                                                                                          	ትርጉም:ጉንዳን'
    },
    {
      'id': 477,
      'name': ' Kayniiqe',
      'ንባብ':
          'ካይኒኢኤ		                                                                                                          ትርጉም:የወባ ትንኝ'
    },
    {
      'id': 478,
      'name': ' Qanaytu',
      'ንባብ':
          'ዓናይቱ		                                                                                                          ትርጉም:አንበጣ'
    },
    {
      'id': 479,
      'name': ' Diidaale',
      'ንባብ':
          'ዳኢዳአሌ	                                                                                                          	ትርጉም:ንብ'
    },
    {
      'id': 480,
      'name': ' Abeesa',
      'ንባብ':
          'አቤኤሳ		                                                                                                          ትርጉም:እባብ'
    },
    {
      'id': 481,
      'name': ' Igixxa',
      'ንባብ':
          'ኢጊድዳ		                                                                                                          ትርጉም:ጊንጥ'
    },
    {
      'id': 482,
      'name': ' Kaalibi',
      'ንባብ':
          'ካሊቢ		                                                                                                          ትርጉም:አቅጣጫ'
    },
    {
      'id': 483,
      'name': 'Maaca(mekki) ',
      'ንባብ':
          'ማሃ/መክኪ	  	                                                                                                          ትርጉም:ምስራቅ'
    },
    {
      'id': 484,
      'name': 'Mekrifi(carra) ',
      'ንባብ':
          'ሜክሪፊ/ሃርራ/	                                                                                                          	ትርጉም:ምዕራብ'
    },
    {
      'id': 485,
      'name': 'Gabbi',
      'ንባብ':
          'ጋብቢ		                                                                                                          ትርጉም:ደቡብ'
    },
    {
      'id': 486,
      'name': ' Kilbata',
      'ንባብ':
          'ኪልበታ		                                                                                                          ትርጉም:ሰሜን'
    },
    {
      'id': 487,
      'name': ' Kilbatti maaca ',
      'ንባብ':
          'ኪልበትቲ ማሃ		                                                                                                          ትርጉም:ሰሜን ምስራቅ'
    },
    {
      'id': 488,
      'name': 'Gabbi maaca ',
      'ንባብ':
          'ጋብቢ ማሃ		                                                                                                          ትርጉም:ደቡብ ምስራቅ'
    },
    {
      'id': 489,
      'name': 'Kilbatti carra ',
      'ንባብ':
          'ኪልባቲት ሃርራ	                                                                                                          	ትርጉም:ሰሜን ምዕራብ'
    },
    {
      'id': 490,
      'name': ' Focca',
      'ንባብ':
          '	ፎሃ		                                                                                                          ትርጉም:ፊት ለፊት'
    },
    {
      'id': 491,
      'name': 'Derre ',
      'ንባብ':
          'ዴርሬ		                                                                                                          ትርጉም:ኋላ'
    },
    {
      'id': 492,
      'name': 'Migda ',
      'ንባብ':
          'ሚግዳ		                                                                                                          ትርጉም:ቀኝ'
    },
    {
      'id': 493,
      'name': ' Gura',
      'ንባብ':
          'ጉራ		                                                                                                          ትርጉም:ግራ'
    },
    {
      'id': 494,
      'name': ' Daga',
      'ንባብ':
          'ዳጋ		                                                                                                          ትርጉም:ላይ'
    },
    {
      'id': 495,
      'name': ' Guba',
      'ንባብ':
          ' ጉባ		                                                                                                          ትርጉም:ታች'
    },
    {
      'id': 496,
      'name': ' Adda',
      'ንባብ':
          'አድዳ		                                                                                                          ትርጉም:ውስጥ'
    },
    {
      'id': 497,
      'name': 'Iro ',
      'ንባብ':
          'ኢሮ		                                                                                                          ትርጉም:ውጭ'
    },
    {
      'id': 498,
      'name': ' Iffan',
      'ንባብ':
          '	ኢፍፋን		                                                                                                          ትርጉም:ወደ'
    },
    {
      'id': 499,
      'name': ' Xayih',
      'ንባብ':
          'ዳዬህ		                                                                                                          ትርጉም:ቅርብ'
    },
    {
      'id': 500,
      'name': ' Xeerih',
      'ንባብ':
          'ዴኤሪህ	 	                                                                                                            ትርጉም:ሩቅ፣ረጅም'
    },
    {
      'id': 501,
      'name': 'Wakti ',
      'ንባብ':
          'ዋክቲ	      	                                                                                                           ትርጉም:ጊዜ፣ወቅት'
    },
    {
      'id': 502,
      'name': ' Liggida',
      'ንባብ':
          'ሊግጊዳ		                                                                                                          ትርጉም:ዓመት'
    },
    {
      'id': 503,
      'name': ' Dubbi',
      'ንባብ':
          'ዱብቢ		                                                                                                           ትርጉም:10 ዓመት'
    },
    {
      'id': 504,
      'name': ' HOra',
      'ንባብ':
          '	ሆራ 	                                                                                                          	ትርጉም:ትውልድ፣30 ዓመት'
    },
    {
      'id': 505,
      'name': 'Bool liggida  ',
      'ንባብ': ' 	ቦኦል ሊግጊድ	ትርጉም:መቶ አመት፣ምዕተ ዓመት'
    },
    {
      'id': 506,
      'name': ' Affara Adbana',
      'ንባብ': 'አፍፋራ አድባና   	ትርጉም:አራት የዝናብ ወቅቶች'
    },
    {'id': 507, 'name': ' Karama', 'ንባብ': 'ካርማ	ትርጉም:ክረምት'},
    {'id': 508, 'name': ' Dadaqa', 'ንባብ': 'ዳደዓ	ትርጉም:ፀደይ'},
    {'id': 509, 'name': ' Dabayba', 'ንባብ': 'ደባይባ	ትርጉም:መኸር'},
    {'id': 510, 'name': ' Sugumu', 'ንባብ': 'ሱጉሙ	ትርጉም:በልግ'},
    {'id': 511, 'name': ' Cagaya', 'ንባብ': 'ሃጋያ	ትርጉም:በጋ'},
    {'id': 512, 'name': ' Gilala', 'ንባብ': 'ጊላላ	ትርጉም:የቅዝቃዜ ወቅት'},
    {'id': 513, 'name': ' xaagi mansoofa', 'ንባብ': ' 	ዳአጊ ማንሶአፋ	   ትርጉም:ወር'},
    {
      'id': 514,
      'name': 'Ayyaama(bacure) ',
      'ንባብ':
          'አይያኣማ 	                                                                                                            ትርጉም:	ሳምንት'
    },
    {
      'id': 515,
      'name': ' Qaada',
      'ንባብ':
          'ዓአዳ	 	                                                                                                           ትርጉም:ቀን'
    },
    {
      'id': 516,
      'name': ' Laqo',
      'ንባብ':
          'ለዖ		                                                                                                          ትርጉም:ሌሊት'
    },
    {
      'id': 517,
      'name': ' Saaku',
      'ንባብ':
          'ሳአኩ	   	                                                                                                          ትርጉም:ጧት'
    },
    {
      'id': 518,
      'name': ' Ghaara',
      'ንባብ':
          'ጋሃአራ	  	                                                                                                           ትርጉም:ቀትር፣እኩለ ቀን'
    },
    {
      'id': 519,
      'name': 'Carra ',
      'ንባብ':
          'ሃርራ	 	                                                                                                           ትርጉም:ማታ፣ከሰዓት በኋላ'
    },
    {
      'id': 520,
      'name': ' Gimo',
      'ንባብ':
          'ጊሞ	   	                                                                                                          ትርጉም:እኩለሌሊት'
    },
    {
      'id': 521,
      'name': ' Maaca(dibro)',
      'ንባብ':
          'ማአሃ	 	                                                                                                            ትርጉም:ንጋት'
    },
    {
      'id': 522,
      'name': ' Kassoyna',
      'ንባብ':
          'ካስሶይና	 	                                                                                                           ትርጉም:ማምሽያ'
    },
    {
      'id': 523,
      'name': ' Asaaku',
      'ንባብ':
          'አሳአኩ	  	                                                                                                            ትርጉም:ዛሬ'
    },
    {
      'id': 524,
      'name': 'Beeca ',
      'ንባብ':
          'ቤኤሪ	   	                                                                                                          ትርጉም:ከነገ ወዲያ'
    },
    {
      'id': 525,
      'name': ' Kimaala',
      'ንባብ':
          'ኪማአላ	 	                                                                                                          ትርጉም:ትላንት'
    },
    {
      'id': 526,
      'name': ' Ammmaaca',
      'ንባብ':
          'አምማአሃ	                                                                                                          	ትርጉም:ከ ትላንት በስቲያ'
    },
    {
      'id': 527,
      'name': ' Waqla',
      'ንባብ':
          'ዋዕላ	  	                                                                                                           ትርጉም:ሰዓት'
    },
    {
      'id': 528,
      'name': ' Diini',
      'ንባብ':
          'ዲኢኒ	     	                                                                                                           ትርጉም:ሃይማኖት'
    },
    {
      'id': 530,
      'name': ' Yalla(Allah)',
      'ንባብ':
          'አልላሃ	     	                                                                                                           ትርጉም:አልላህ'
    },
    {
      'id': 531,
      'name': ' Farmoyta',
      'ንባብ':
          'ፋርሞይታ		                                                                                                          ትርጉም:መልዕክተኛ'
    },
    {
      'id': 532,
      'name': ' Nabiyyi',
      'ንባብ':
          'ናቢይ	   	                                                                                                           ትርጉም:ነቢይ'
    },
    {
      'id': 533,
      'name': ' Islam',
      'ንባብ':
          'እስላማ		                                                                                                          ትርጉም:ዕስልምና'
    },
    {
      'id': 534,
      'name': ' Korosu',
      'ንባብ':
          'ኮሮሱ		                                                                                                          ትርጉም:ክርስትና'
    },
    {
      'id': 536,
      'name': ' yahuudu',
      'ንባብ':
          'ያሁኡዱ		                                                                                                          ትርጉም:አይሁዳዊ'
    },
    {
      'id': 537,
      'name': ' Muslimtu',
      'ንባብ':
          'ሙስሊምቱ	  	                                                                                                           ትርጉም:ሙስሊም'
    },
    {
      'id': 538,
      'name': ' Korosta',
      'ንባብ':
          'ኮሮስታ		                                                                                                          ትርጉም:ክርስቲያን'
    },
    {
      'id': 539,
      'name': ' yahuudiita',
      'ንባብ':
          'ያሁኡዲታ	 	                                                                                                            ትርጉም:አይሁድ'
    },
    {
      'id': 540,
      'name': ' Masgiidi',
      'ንባብ':
          'ማስጊድ	   	                                                                                                            ትርጉም:መስጊድ'
    },
    {
      'id': 541,
      'name': ' sinagoog',
      'ንባብ':
          'ሲናአጎኦጉ	 	                                                                                                             ትርጉም:ቤተ ክርስቲያን'
    },
    {
      'id': 542,
      'name': ' Kaniisa',
      'ንባብ':
          'ካኒዒሲ	   	                                                                                                           ትርጉም:ቤተ አይሁድ'
    },
    {
      'id': 543,
      'name': ' Tawraat',
      'ንባብ':
          'ታውራአታ	  	                                                                                                           ትርጉም:ኦሪት'
    },
    {
      'id': 544,
      'name': ' Injiili',
      'ንባብ':
          'ኢንጂኢሊ	  	                                                                                                           ትርጉም:ወንጌል'
    },
    {
      'id': 545,
      'name': ' Qhuraana',
      'ንባብ':
          'ንባብቁርአና	 	                                                                                                           ትርጉም:ቁርአን'
    },
    {
      'id': 546,
      'name': 'Jannata ',
      'ንባብ':
          'ጀናንታ	   	                                                                                                           ትርጉም:ጀነት'
    },
    {
      'id': 547,
      'name': ' ghanannama',
      'ንባብ':
          'ጋሃንናማ	                                                                                                          	ትርጉም:ሲኦል'
    },
    {
      'id': 548,
      'name': ' Karaama(muqjiza)',
      'ንባብ':
          'ካራአማ/ሙዕጂዛ	 	                                                                                                            ትርጉም:ተአምር'
    },
    {
      'id': 549,
      'name': 'Salaata ',
      'ንባብ':
          'ሳላአታ		                                                                                                          ትርጉም:ሶላት፣ስግደት'
    },
    {
      'id': 550,
      'name': ' Soomu',
      'ንባብ':
          'ሶኦሙ	   	                                                                                                           ትርጉም:ጾም'
    },
    {
      'id': 551,
      'name': ' cajji',
      'ንባብ':
          'ሐጂ	   	                                                                                                           ትርጉም:ሐጅ'
    },
    {
      'id': 552,
      'name': ' Zakaata',
      'ንባብ':
          'ዛካአታ	  	                                                                                                           ትርጉም:ምፅዋት'
    },
    {
      'id': 553,
      'name': ' Kiyaamah ayro',
      'ንባብ':
          'ኪያአማህ አይሮ  	                                                                                                           ትርጉም:	ምፃት'
    },
    {
      'id': 554,
      'name': ' Galato',
      'ንባብ':
          'ጋላቶ	 	                                                                                                           ትርጉም:ቅጣት'
    },
    {
      'id': 555,
      'name': ' Digaala',
      'ንባብ':
          'ዲጋአላ	                                                                                                          	ትርጉም:አማኝ'
    },
    {
      'id': 556,
      'name': ' Moomintu',
      'ንባብ':
          'ሞኦሚንቱ		                                                                                                          ትርጉም:ከሀዲ'
    },
    {
      'id': 557,
      'name': ' kaafirtu',
      'ንባብ':
          'ካአፊርቱ	                                                                                                          	ትርጉም:ልደት'
    },
    {
      'id': 558,
      'name': ' Mawliidi',
      'ንባብ':
          'ማውሊኢዲ	   	                                                                                                          ትርጉም:የአረፋ በአል'
    },
    {
      'id': 559,
      'name': 'Qarfa qiidi ',
      'ንባብ':
          'አርፋ ዒኢዲ	  	                                                                                                           ትርጉም:የፆም ፍቺ በአል'
    },
    {
      'id': 560,
      'name': ' soom qiidi',
      'ንባብ':
          'ሶኦም ዒኢዲ	 	                                                                                                            ትርጉም:ድንግል'
    },
    {
      'id': 561,
      'name': ' Baxuwwa',
      'ንባብ':
          'ባሩውዋ	  	                                                                                                           ትርጉም:መላእክት'
    },
    {
      'id': 562,
      'name': ' 2toh ugutu',
      'ንባብ':
          'ነምማሃይቶ ኡጉቱ	 	                                                                                                            ትርጉም:ትንሳኤ'
    },
    {
      'id': 563,
      'name': ' Imaana',
      'ንባብ':
          'ኢማአና	  	                                                                                                           ትርጉም:እምነት'
    },
    {
      'id': 564,
      'name': ' Zambi',
      'ንባብ':
          'ዘምቢ	  	                                                                                                           ትርጉም:ሃጥያት'
    },
    {
      'id': 565,
      'name': ' Qafuuta (cabti)',
      'ንባብ':
          'አፍኡቲ/ሃብቲ		                                                                                                          ትርጉም:ምህረት'
    },
    {
      'id': 566,
      'name': 'Ranse booxa ',
      'ንባብ':
          'ራንሴ ቦአራ	   	                                                                                                           ትርጉም:የትያትር መድረክ'
    },
    {
      'id': 567,
      'name': ' fanti makra',
      'ንባብ':
          'ፋንቲ ማክራ	   	                                                                                                          ትርጉም:መካከለኛ ሞገድ'
    },
    {
      'id': 568,
      'name': ' Ranse abeyna',
      'ንባብ':
          'ራንሴ አቤና		                                                                                                           ትርጉም:ከያኒ'
    },
    {
      'id': 569,
      'name': ' Taswiiri',
      'ንባብ':
          'ታስዊኢሪ		                                                                                                          ትርጉም:ፎቶግራፍ'
    },
    {
      'id': 570,
      'name': ' Taswiir ugse',
      'ንባብ':
          'ታስዊኢር ኡግሴ	 	                                                                                                           ትርጉም:ፎቶ አንሺ'
    },
    {
      'id': 571,
      'name': ' Raadiyo',
      'ንባብ':
          'ራአድዮ		                                                                                                          ትርጉም:ሬዲዮ'
    },
    {
      'id': 572,
      'name': ' Musajjlala',
      'ንባብ':
          'ሙስጅጃላ	   	                                                                                                          ትርጉም:ቴፕ'
    },
    {
      'id': 573,
      'name': ' Qaglata',
      'ንባብ':
          'ግጋላታ	  	                                                                                                           ትርጉም:የቴፕ ክር'
    },
    {
      'id': 574,
      'name': ' Radiyo maglla',
      'ንባብ':
          'ራአዲዮ ማግልላላ	                                                                                                          	ትርጉም: ሬድዮ ጣቢያ'
    },
    {
      'id': 575,
      'name': ' Televiziyoonu',
      'ንባብ':
          'ቴሌቪዚዮአኒ	   	                                                                                                           ትርጉም:ቴሌቭዚን'
    },
    {
      'id': 576,
      'name': 'Viidiyo ',
      'ንባብ':
          'ቪዲዮ	     	                                                                                                           ትርጉም:ቪዲዮ'
    },
    {
      'id': 577,
      'name': ' ux makra',
      'ንባብ':
          'ኡድ ማክራ	  	                                                                                                           ትርጉም:አጭር ሞገድ'
    },
    {
      'id': 578,
      'name': ' xer makra',
      'ንባብ':
          'ዴር ማክራ	  	                                                                                                           ትርጉም:ረጅም ሞገድ'
    },
    {
      'id': 579,
      'name': ' xaagu',
      'ንባብ':
          'ዳአጉ	   	                                                                                                           ትርጉም:ዜና'
    },
    {
      'id': 580,
      'name': ' xaagu qawe',
      'ንባብ':
          'ዳአጉ አዌ	  	                                                                                                           ትርጉም:ጋዜጠኛ'
    },
    {
      'id': 581,
      'name': ' iro xaaagu',
      'ንባብ':
          'ኢሮ ዳአጉ	   	                                                                                                          ትርጉም:የውጭ ዜና'
    },
    {
      'id': 582,
      'name': ' baaxoh addah xaagu',
      'ንባብ':
          'ባአሮህ አድዳህ ዳጉ		                                                                                                          ትርጉም:የሐገር ውስጥ ዜና'
    },
    {
      'id': 583,
      'name': ' Taddiira',
      'ንባብ':
          'ታዱዲኢራ		                                                                                                          ትርጉም:ፕሮግራም'
    },
    {
      'id': 584,
      'name': ' Maybalaalaqa',
      'ንባብ':
          ' 	                                                                                                          ትርጉም:ማይባላአላዓ	ጋዜጣ'
    },
    {
      'id': 585,
      'name': ' Majallata',
      'ንባብ':
          'ማጃልላታ	 	                                                                                                           ትርጉም:መጽሄት'
    },
    {
      'id': 586,
      'name': ' Ammunta',
      'ንባብ':
          'አምሙንታ	ርዕስ 	                                                                                                          ትርጉም:አንቀጽ'
    },
    {
      'id': 587,
      'name': ' Xaagi  raceyna',
      'ንባብ':
          'ዳአጊ ራሄይና		                                                                                                          ትርጉም:የዜና ምንጭ'
    },
    {
      'id': 588,
      'name': 'xaagu ruube ',
      'ንባብ':
          'ዳጉ ሩኡቤ	  	                                                                                                          ትርጉም:ዜና አስተላላፊ'
    },
    {
      'id': 589,
      'name': ' Weelo',
      'ንባብ':
          ' 	ዌኤሎ	                                                                                                          	ትርጉም:ባህሪይ'
    },
    {
      'id': 590,
      'name': ' Bisu',
      'ንባብ':
          'ቢሱ	 	                                                                                                           ትርጉም:ቀለም'
    },
    {
      'id': 591,
      'name': ' Diti',
      'ንባብ':
          'ዲቲ	 	                                                                                                           ትርጉም:ጥቁር'
    },
    {
      'id': 592,
      'name': ' Qidi',
      'ንባብ':
          'ኢዲ	 	                                                                                                           ትርጉም:ነጭ'
    },
    {
      'id': 593,
      'name': ' Qisi',
      'ንባብ':
          'ኢሲ	 	                                                                                                           ትርጉም:ቀይ'
    },
    {
      'id': 594,
      'name': ' Inxixi',
      'ንባብ':
          ' ኢንዲዲ	  	                                                                                                           ትርጉም:አረንጓዴ'
    },
    {
      'id': 595,
      'name': ' Kuclinaana',
      'ንባብ':
          'ኩህሊናና	 	                                                                                                           ትርጉም:ሰማያዊ'
    },
    {
      'id': 596,
      'name': ' Caawinaana',
      'ንባብ':
          'ሃዊናአና	   	                                                                                                          ትርጉም:ጠይም'
    },
    {
      'id': 597,
      'name': ' Walqinaana',
      'ንባብ':
          'ዋልኢናአና	  	                                                                                                           ትርጉም:ቢጫ'
    },
    {
      'id': 598,
      'name': ' Saxxana',
      'ንባብ':
          'ሳድዳና	 	                                                                                                            ትርጉም:ደደብ'
    },
    {
      'id': 599,
      'name': ' Bayyana',
      'ንባብ':
          'ባይያና		                                                                                                          ትርጉም:ብልህ'
    },
    {
      'id': 600,
      'name': ' Qululu',
      'ንባብ':
          'ዑሉሉ	  	                                                                                                          ትርጉም:ረሃብ'
    },
    {
      'id': 601,
      'name': ' Bakarli',
      'ንባብ':
          'ባካርሊ		                                                                                                          ትርጉም:የተጠማ'
    },
    {
      'id': 602,
      'name': ' Qarmoqo',
      'ንባብ':
          'ዓርምዖ	 	                                                                                                           ትርጉም:ቆንጆ'
    },
    {
      'id': 603,
      'name': ' Qaxuumo',
      'ንባብ':
          'ዓራኡም	 	                                                                                                           ትርጉም:አስቀያሚ'
    },
    {
      'id': 604,
      'name': 'Gabcu ',
      'ንባብ':
          'ጋብሁ	     	                                                                                                            ትርጉም:ጠማማ'
    },
    {
      'id': 605,
      'name': ' kareero',
      'ንባብ':
          'ካራኤሮ	  	                                                                                                           ትርጉም:ቀጥተኛ'
    },
    {
      'id': 606,
      'name': ' Naqboyta',
      'ንባብ':
          'ናዕቦይታ	 	                                                                                                           ትርጉም:ጠላት'
    },
    {
      'id': 607,
      'name': ' Kacnoyta',
      'ንባብ':
          'ካህኖይታ	  	                                                                                                           ትርጉም:ወዳጅ'
    },
    {
      'id': 608,
      'name': ' Aamantili',
      'ንባብ':
          'አማንቲሊ	  	                                                                                                           ትርጉም:ታማኝ'
    },
    {
      'id': 609,
      'name': ' Garqa',
      'ንባብ':
          'ገርዓ	   	                                                                                                           ትርጉም:ሌባ'
    },
    {
      'id': 610,
      'name': ' Agiru',
      'ንባብ':
          'አጊሩ	   	                                                                                                           ትርጉም:ጀግና	'
    },
    {
      'id': 611,
      'name': ' Qabal',
      'ንባብ':
          'mali	ዓባል መሊ	 	                                                                                                           ትርጉም:ፈሪ'
    },
    {
      'id': 612,
      'name': ' Nummeena',
      'ንባብ':
          'ኑሞሜይና	   	                                                                                                          ትርጉም:ዕውነተኛ'
    },
    {
      'id': 613,
      'name': ' Dirabli',
      'ንባብ':
          'ዲራብሊ	   	                                                                                                           ትርጉም:ውሸታም'
    },
    {
      'id': 614,
      'name': ' Mixigi',
      'ንባብ':
          'ሚዲጊ	   	                                                                                                           ትርጉም:ምሁር'
    },
    {
      'id': 615,
      'name': ' Lawisi',
      'ንባብ':
          'ላዊሲ	   	                                                                                                           ትርጉም:አትታላይ'
    },
    {
      'id': 616,
      'name': ' Kasloyta',
      'ንባብ':
          'ካስሎይታ	                                                                                                          	ትርጉም:አዋቂ'
    },
    {
      'id': 617,
      'name': ' cabuli',
      'ንባብ':
          'ሃቡሊ	    	                                                                                                          ትርጉም:እብድ'
    },
    {
      'id': 618,
      'name': ' sissiko',
      'ንባብ':
          'ሲሲኮ	   	                                                                                                            ትርጉም:ፈጣን'
    },
    {
      'id': 619,
      'name': ' Qilso(Dokkoowe)',
      'ንባብ':
          '	ዒልሶ（ዶክኮዌ）	 	                                                                                                           ትርጉም:ዘገምተኛ'
    },
    {
      'id': 620,
      'name': ' Faranili(Gabtafili)',
      'ንባብ':
          'ፋራኒሊ（ጋብታፍሊ）		                                                                                                           ትርጉም:ቀልጣፋ'
    },
    {
      'id': 621,
      'name': ' Tutaanuli',
      'ንባብ':
          'ቱታኑሊ		                                                                                                          ትርጉም:ሰነፍ'
    },
    {
      'id': 622,
      'name': ' Kaxxiinaytu',
      'ንባብ':
          'ካድድናይቱ	                                                                                                          	ትርጉም:ኩራተኛ'
    },
    {
      'id': 623,
      'name': ' Caddili(Cismatli)',
      'ንባብ':
          'ሃድዲዳሊ（ሂስማትሊ）	                                                                                                          ትርጉም:	ትሁት'
    },
    {'id': 624, 'name': ' Saytun', 'ንባብ': 'ሰይቱን	   ትርጉም:ንጹህ'},
    {
      'id': 625,
      'name': ' Xaqata(Wasaka)',
      'ንባብ':
          'ዳዓታ（ዋሳክ/ኡጉፉ）	 	                                                                                                           ትርጉም:ቆሻሻ'
    },
    {
      'id': 626,
      'name': ' Ruffali',
      'ንባብ':
          'ሩፍፋሊ	 	                                                                                                           ትርጉም:ደስተኛ'
    },
    {
      'id': 627,
      'name': ' Rookali',
      'ንባብ':
          'ሮኮሊ	  	                                                                                                           ትርጉም:ሐዘንተኛ'
    },
    {
      'id': 628,
      'name': ' Qilsi(Gibidi)',
      'ንባብ':
          'ኢልሲ（ጊቢዲ）		                                                                                                          ትርጉም:ከባድ'
    },
    {
      'id': 629,
      'name': ' Qilsamali(Xoctili)',
      'ንባብ':
          'ዒልሳመሊ（ዶህቲሊ）	                                                                                                          ትርጉም:	ቀላል'
    },
    {
      'id': 631,
      'name': ' Naqabixaynali(Bagcarrale)',
      'ንባብ':
          'ነዕቢዳይነሊ（ባግሃርራሊ）	                                                                                                          	ትርጉም: ግልፍተኛ'
    },
    {
      'id': 632,
      'name': ' Cillaaleli',
      'ንባብ':
          'ሂልላሌሊ		                                                                                                          ትርጉም:  ቆንቋና፣ንፉግ'
    },
    {
      'id': 633,
      'name': ' Macawa(cindali)',
      'ንባብ':
          'ማሃዋ（ሂንዳሊ）	                                                                                                          ትርጉም:	ቸር'
    },
    {
      'id': 634,
      'name': ' Maqarli(Diggali/Ligdoli)',
      'ንባብ':
          'ማዓርሊ（ድግጋ/ሊግዶሊ）	                                                                                                          ትርጉም:	ጠንካራ'
    },
    {
      'id': 635,
      'name': ' Boolali(Taanoyta)',
      'ንባብ':
          'ቦኦላሊ（ታአኖይታ）	                                                                                                          ትርጉም:	ደካማ'
    },
    {
      'id': 636,
      'name': 'Naba ',
      'ንባብ':
          'ነባ	 	                                                                                                          ትርጉም: ትልቅ'
    },
    {
      'id': 637,
      'name': ' Qunxa',
      'ንባብ':
          'ኡንዳ	                                                                                                           ትርጉም:	ትንሽ'
    },
    {
      'id': 638,
      'name': ' uxxi',
      'ንባብ':
          'ኡድዲ	                                                                                                          	ትርጉም: አጭር'
    },
    {
      'id': 639,
      'name': ' Xer',
      'ንባብ':
          'ዴር		                                                                                                          ትርጉም: ረዝም'
    },
    {
      'id': 640,
      'name': ' Fidin',
      'ንባብ':
          'ፊዲን		                                                                                                          ትርጉም: ሰፊ'
    },
    {
      'id': 641,
      'name': ' ceyina',
      'ንባብ':
          'ሄይና		                                                                                                          ትርጉም: ጠባብ'
    },
    {
      'id': 642,
      'name': ' foyya',
      'ንባብ':
          'ፎይያ	                                                                                                          	ትርጉም: ባዶ'
    },
    {
      'id': 643,
      'name': ' Kibu',
      'ንባብ':
          'ኪቡ	                                                                                                          	ትርጉም: ሙሉ'
    },
    {
      'id': 644,
      'name': ' Gabulle(Masule)',
      'ንባብ':
          'ጉቡልሊ（ሙሱሌ）	                                                                                                          ትርጉም:	ወፍራም'
    },
    {
      'id': 645,
      'name': 'Cabbole(Qakule) ',
      'ንባብ':
          'ሃብቦሊ（ዓኩሊ）	                                                                                                          ትርጉም:	ቀጭን'
    },
    {
      'id': 646,
      'name': ' Lab',
      'ንባብ':
          '	ላብ  	                                                                                                           ትርጉም: 	ወንዴ '
    },
    {
      'id': 647,
      'name': ' say',
      'ንባብ':
          'ሰይ		                                                                                                          ትርጉም: ሴቴ'
    },
    {
      'id': 648,
      'name': ' Sidiica gona',
      'ንባብ':
          'ሲዲኢሃ ጎና	                                                                                                           ትርጉም:	ሶስት ማዕዘን'
    },
    {
      'id': 649,
      'name': ' Affara gona',
      'ንባብ':
          'አፋራ ጎና 	                                                                                                          ትርጉም:	አራት ማዕዘን'
    },
    {
      'id': 650,
      'name': ' Xangi mali',
      'ንባብ':
          'ደንጊ መሊ	                                                                                                           ትርጉም:	መስማት የተሳነው（ደንቆሮ)'
    },
    {
      'id': 651,
      'name': 'Gonnna(Intimali) ',
      'ንባብ':
          'ጎንና（ኢንቲ መሊ）	                                                                                                          ትርጉም:	ማየት የተሳነው（አይነ ስውር)'
    },
    {
      'id': 652,
      'name': ' Duuda',
      'ንባብ':
          'ዱኡዳ		                                                                                                          ትርጉም: ዱዳ'
    },
    {
      'id': 653,
      'name': ' Bidaaru',
      'ንባብ':
          'ቢዳሩ		                                                                                                           ትርጉም:መላጣ'
    },
    {
      'id': 654,
      'name': ' Gaafu',
      'ንባብ':
          'ጋአፋ	                                                                                                           ትርጉም:	ሽራፊ'
    },
    {
      'id': 655,
      'name': ' Abaaroli',
      'ንባብ':
          'አባሮሊ	                                                                                                          	ትርጉም: ዕርጉም'
    },
    {
      'id': 656,
      'name': ' Qaafiyata',
      'ንባብ':
          'ዓአፊያት	                                                                                                           ትርጉም:	ጤና'
    },
    {
      'id': 657,
      'name': ' Biyak',
      'ንባብ':
          'ቢያክ  	                                                                                                           ትርጉም:	ሕመም'
    },
    {
      'id': 658,
      'name': ' Lakima',
      'ንባብ':
          'ላኪማ 	                                                                                                          ትርጉም:	በሽታ'
    },
    {
      'id': 659,
      'name': ' Dayla',
      'ንባብ':
          'ዳይላ		                                                                                                          ትርጉም: መድሐኒት（ሕክምና）'
    },
    {
      'id': 660,
      'name': ' Aqayyaare(Fookkaqo)',
      'ንባብ':
          'አዓይያአሬ（ፎክካዖ）	                                                                                                          ትርጉም:	ምርመራ（ሕክምና）'
    },
    {
      'id': 661,
      'name': ' Makeelo',
      'ንባብ':
          'ማኬኤሎ 	                                                                                                          ትርጉም:	ምርመራ（ትንተና）'
    },
    {
      'id': 662,
      'name': ' Diwa',
      'ንባብ':
          'ድዋ	 	                                                                                                          ትርጉም:  መድኃኒት ቤት（ፋርማሲ）'
    },
    {
      'id': 663,
      'name': ' Diwa dukkaana',
      'ንባብ':
          'ደዋ ዱክካና	 	                                                                                                           ትርጉም: ላቦራቶሪ'
    },
    {
      'id': 664,
      'name': ' Makeelo daasa',
      'ንባብ':
          'ማኬኤ ዳአስ		                                                                                                          ትርጉም: ቀዶ ህክምና'
    },
    {
      'id': 665,
      'name': ' Ricdek cixxa',
      'ንባብ':
          'ሪህዴክ ሂድዳ 	                                                                                                           ትርጉም:	ሃኪም'
    },
    {
      'id': 666,
      'name': ' Madliina',
      'ንባብ':
          'ሂኪሚ	አስታማሚ	                                                                                                          ትርጉም:（ለሴት）'
    },
    {
      'id': 667,
      'name': ' Raaji',
      'ንባብ':
          'ራአጂ	   	                                                                                                          ትርጉም: ራጅ(x-ray)'
    },
    {
      'id': 667,
      'name': ' Qanxiseena',
      'ንባብ':
          'ዓንዲሴይና	                                                                                                           ትርጉም:	ቀዶ ጠጋኝ'
    },
    {
      'id': 668,
      'name': ' Angadaada',
      'ንባብ':
          'አንገዳኣዳ	                                                                                                          	ትርጉም: ማገገም'
    },
    {
      'id': 669,
      'name': ' Amo beera',
      'ንባብ':
          'አሞቤርራ		                                                                                                            ትርጉም: ራስ ምታት'
    },
    {
      'id': 670,
      'name': ' Dudduba',
      'ንባብ':
          'ዱድዱባ		                                                                                                          ትርጉም: ዕብጠት'
    },
    {
      'id': 671,
      'name': ' Gosonu',
      'ንባብ':
          'ጎሱኑ	                                                                                                          	ትርጉም: ጉንፋን'
    },
    {
      'id': 672,
      'name': ' Qaso',
      'ንባብ':
          'ዓሶ		                                                                                                           ትርጉም: ወባ'
    },
    {
      'id': 673,
      'name': ' dale',
      'ንባብ':
          'ዳሌ		                                                                                                          ትርጉም: ቁስል'
    },
    {
      'id': 674,
      'name': ' Baggexo',
      'ንባብ':
          'ባግጌፎ		                                                                                                          ትርጉም: ተቅማጥ'
    },
    {
      'id': 675,
      'name': ' Baasuuru(Boooraqi)',
      'ንባብ':
          'ባኣሱር（ቦኦራዲ）	ሬባ	                                                                                                           ትርጉም: （ኪንታሮት）'
    },
    {
      'id': 676,
      'name': ' Lubbidabala',
      'ንባብ':
          'ሉቢዳባላ		                                                                                                          ትርጉም: ልብ ምት（ሕመም）'
    },
    {
      'id': 677,
      'name': ' Labha',
      'ንባብ':
          'doore	ላብሃ ዶኦሬ 	                                                                                                          ትርጉም:	ሳንባ ነቀርሳ'
    },
    {'id': 678, 'name': ' Kacuw', 'ንባብ': 'ካሁው	ትርጉም: ሳል'},
    {
      'id': 679,
      'name': ' Uriyya(Waddiimiyya)',
      'ንባብ':
          'ኡሪይያ（ዋድዲሚይያ）	                                                                                                          ትርጉም:	መዳን'
    },
    {
      'id': 680,
      'name': ' Kaxxa daktra',
      'ንባብ':
          'ካድዳ ደክታራ	                                                                                                          	ትርጉም: ሆስፒታል'
    },
    {
      'id': 681,
      'name': 'Kiliiniki ',
      'ንባብ':
          'ክሊኒኪ 	                                                                                                          ትርጉም:	ክሊኒክ'
    },
    {
      'id': 682,
      'name': ' Ixo(Aftabu)',
      'ንባብ':
          'ኢዶ（አፍተቡ）	                                                                                                          ትርጉም:	ክትባት'
    },
    {
      'id': 683,
      'name': 'Ullatina ',
      'ንባብ':
          'ኡልላትኢና 	                                                                                                          	ትርጉም: አዋላጅ'
    },
    {
      'id': 684,
      'name': ' Ibra(Erba)',
      'ንባብ':
          'ኢርባ（ኤርባ）	                                                                                                           ትርጉም:	መርፌ'
    },
    {
      'id': 685,
      'name': ' Kaniina',
      'ንባብ':
          'ካኒኢና 	                                                                                                          ትርጉም:	ኪኒን'
    },
    {
      'id': 686,
      'name': ' Koxxa',
      'ንባብ':
          'ኮድዳ  	                                                                                                          ትርጉም:	ጉሉኮስ'
    },
    {
      'id': 687,
      'name': 'Baasima ',
      'ንባብ':
          'ባሲማ	 	                                                                                                           ትርጉም: ፋሻ（የቁስል）'
    },
    {
      'id': 688,
      'name': ' MAygarrama(xakaba)',
      'ንባብ':
          'ማይገርራማ（ዳካባ）	                                                                                                             ትርጉም:	መጠገን（የ አጥንት）'
    },
    {
      'id': 689,
      'name': ' Umaala',
      'ንባብ':
          'ኡማላ		                                                                                                          ትርጉም: መመርቀዝ（ኢንፌክሽን）'
    },
    {
      'id': 690,
      'name': ' Quduri',
      'ንባብ':
          'ኡዱሪ	                                                                                                          ትርጉም:	ወረርሽኝ'
    },
    {
      'id': 691,
      'name': ' Tocbuda',
      'ንባብ':
          'ቶህቡዳ 	                                                                                                          ትርጉም:	መከላከል'
    },
    {
      'id': 692,
      'name': ' Tiiru',
      'ንባብ':
          'ቲኢሩ  	                                                                                                          ትርጉም:	መታቀብ'
    },
    {
      'id': 693,
      'name': ' Balqiinu',
      'ንባብ':
          'ባልዒኢኑ 	                                                                                                          ትርጉም:	መተማመን'
    },
    {
      'id': 694,
      'name': ' Balqo',
      'ንባብ':
          'ባልዖ	  	                                                                                                         ትርጉም:  ከትዳር ውጪ ወሲብ አለመፈፀም'
    },
    {
      'id': 695,
      'name': ' Labana siba',
      'ንባብ':
          'ላብና ሲባ	                                                                                                          ትርጉም:	ኮንዶም'
    },
    {
      'id': 696,
      'name': ' Madqa',
      'ንባብ':
          'ማድዓ	                                                                                                         	ትርጉም: ሕግ'
    },
    {
      'id': 697,
      'name': ' Qadli',
      'ንባብ':
          'ዓድሊ	                                                                                                          ትርጉም:	ፍትህ'
    },
    {
      'id': 698,
      'name': ' Caxa	',
      'ንባብ':
          'ሐራ 	                                                                                                          ትርጉም: ፍርድ ቤት፣ዛፍ'
    },
    {'id': 699, 'name': ' Garkure', 'ንባብ': 'ገር ኩሬ  ትርጉም:	ዳኛ'},
    {
      'id': 700,
      'name': 'Wayto(Malkiti) ',
      'ንባብ':
          'ዋይቶ（ማልኪቲ）	                                                                                                          ትርጉም:	ክስ'
    },
    {
      'id': 701,
      'name': ' Xaawa(Gaaroowu)',
      'ንባብ':
          'ዳኣዋ（ጋኣሮው） 	                                                                                                         ትርጉም:	ክርክር'
    },
    {
      'id': 702,
      'name': ' Baatileena',
      'ንባብ':
          'ባአቲሌይና  	                                                                                                         ትርጉም:	ወንጀለኛ'
    },
    {
      'id': 703,
      'name': ' Bari(Aslaga)',
      'ንባብ':
          'ባሪ（አስለገ）	                                                                                                         ትርጉም:	ነፃ（ከወንጀል）'
    },
    {
      'id': 704,
      'name': ' Daremsime',
      'ንባብ':
          'ዳሬምሲሜ 	                                                                                                          ትርጉም:	ተጠርጣሪ'
    },
    {
      'id': 705,
      'name': ' Cakiimi',
      'ንባብ':
          'ሃኪሚ		                                                                                                          ትርጉም: ሐኪም'
    },
    {
      'id': 706,
      'name': ' absuma',
      'ንባብ':
          'a	አብሱማእ		                                                                                                         ትርጉም:  የልጅ ልጅ（ሴት）'
    },
    {
      'id': 707,
      'name': 'Absuma`a	 ',
      'ንባብ':
          'አብሱማእ		                                                                                                         ትርጉም: የ አባት እህት ልጅ（ሴት）'
    },
    {'id': 708, 'name': ' Baatili', 'ንባብ': 'ባቲሊ	ትርጉም: ወንጀል'},
    {
      'id': 709,
      'name': ' Garkuro(Kurma)',
      'ንባብ':
          'ገርኩሮ（ኩርማ） 	                                                                                                         ትርጉም:	ፍርድ'
    },
    {
      'id': 710,
      'name': ' Garkuro xikka',
      'ንባብ':
          'ገርኩሮህድክካ 	                                                                                                         ትርጉም:	የመወሰን ድንበር'
    },
    {
      'id': 711,
      'name': ' Qagfaxiti (caxakkoro)',
      'ንባብ':
          'ዓግፋሪቲ（ሃራክኮሮ）	                                                                                                          ትርጉም:	ይግባኝ'
    },
    {
      'id': 712,
      'name': ' Abbokaato',
      'ንባብ':
          'አቦካቶ	                                                                                                          ትርጉም:	ጠበቃ'
    },
    {
      'id': 713,
      'name': ' Sumaaqa',
      'ንባብ':
          'ሱመዓ		                                                                                                          ትርጉም: ምስክር'
    },
    {
      'id': 714,
      'name': ' Margaqa',
      'ንባብ':
          'ማርገዓ 	                                                                                                          ትርጉም:	ውሳኔ'
    },
    {
      'id': 715,
      'name': ' Siira',
      'ንባብ':
          'ሲኢራ		                                                                                                          ትርጉም: ስርዓት'
    },
    {
      'id': 716,
      'name': ' Wano',
      'ንባብ':
          'ዋኖ		                                                                                                          ትርጉም: ድንጋጌ'
    },
    {
      'id': 717,
      'name': ' Wadu',
      'ንባብ':
          'ዋዱ		                                                                                                          ትርጉም: ማስረጃ'
    },
    {
      'id': 718,
      'name': ' Mqem',
      'ንባብ':
          'bara	ሜኤም ባራ  	                                                                                                         ትርጉም:	ፍትሐ ብሄር'
    },
    {
      'id': 719,
      'name': ' Waado',
      'ንባብ':
          'ዋዶ 	                                                                                                         	ትርጉም: ገደብ'
    },
    {
      'id': 720,
      'name': ' Raawa',
      'ንባብ':
          'ራአዊ 	                                                                                                          ትርጉም:	ዕርከን'
    },
    {
      'id': 721,
      'name': ' Amri',
      'ንባብ':
          'አምሪ 	                                                                                                         	ትርጉም: ትዕዛዝ'
    },
    {
      'id': 722,
      'name': ' Idini',
      'ንባብ':
          'ኢድኒ 	                                                                                                           ትርጉም:	ፍቃድ'
    },
    {
      'id': 723,
      'name': ' Mixxaaginnu',
      'ንባብ':
          'ሚድዳጊንኑ	                                                                                                           ትርጉም: ሓላፊነት'
    },
    {
      'id': 724,
      'name': ' Xammaala',
      'ንባብ':
          'ደምማአላ	                                                                                                         ትርጉም: ጥምረት'
    },
    {
      'id': 725,
      'name': ' Buruk caxa',
      'ንባብ':
          'ቡሩክ ሃራ                                                                                                           ትርጉም:	ሰበር ችሎት'
    },
    {
      'id': 726,
      'name': ' Xacaacekali caalata',
      'ንባብ':
          'ዳሃአሄካሊ ሃላታ                                                                                                           ትርጉም:	የ አስቸኳይ ጊዜ አዋጅ'
    },
    {
      'id': 727,
      'name': ' Sido',
      'ንባብ':
          'ሲዶ	                                                                                                         ትርጉም: መሰረት'
    },
    {
      'id': 728,
      'name': ' Sannda',
      'ንባብ':
          'ሰንዳ                                                                                                          ትርጉም:	ሰነድ'
    },
    {
      'id': 729,
      'name': ' Abaabisiyya',
      'ንባብ':
          'አባአቢሲይያ                                                                                                           ትርጉም:	ማንፀባረቅ'
    },
    {
      'id': 730,
      'name': ' Keexeena',
      'ንባብ':
          'ኬኤሬኤና	                                                                                                          ትርጉም: መስፈርት'
    },
    {
      'id': 731,
      'name': ' Gidiyi',
      'ንባብ':
          'ጊዲይ                                                                                                         	ትርጉም: ክፍያ'
    },
    {
      'id': 732,
      'name': ' qulo',
      'ንባብ':
          'ዑሎ                                                                                                          ትርጉም:	ቅጅ'
    },
    {
      'id': 733,
      'name': ' Alkumu',
      'ንባብ':
          'አልኩሙ                                                                                                          ትርጉም:	ጥሎሽ'
    },
    {
      'id': 734,
      'name': ' Fayxi',
      'ንባብ':
          'ፊይሪ                                                                                                         	ትርጉም: ማጨት'
    },
    {
      'id': 735,
      'name': ' Gennaqo',
      'ንባብ':
          'ጌንናዖ	ኒካሕ፣                                                                                                            ትርጉም:ቃል ኪዳን'
    },
    {
      'id': 736,
      'name': ' Digibi',
      'ንባብ':
          'ዲጊቢ	                                                                                                          ትርጉም: ሰርግ'
    },
    {
      'id': 737,
      'name': ' Qaruusu',
      'ንባብ':
          'ዓሩሱ                                                                                                         	ትርጉም: ሙሽራ'
    },
    {
      'id': 738,
      'name': 'Qbna	 ',
      'ንባብ':
          'ዒብና                                                                                                            ትርጉም:  ሙሽሪት'
    },
    {
      'id': 739,
      'name': ' Aligge/Qarus maqanxa',
      'ንባብ':
          'አሊጌ/ዓሩስ                                                                                                          ትርጉም: ማዓንዳ	ሚዜ'
    },
    {
      'id': 740,
      'name': ' Aliggeyta/Akutta',
      'ንባብ':
          'አሊጌይታ አኩትታ                                                                                                            ትርጉም:	ሴት ሚዜ'
    },
    {
      'id': 741,
      'name': 'Orobi ',
      'ንባብ':
          'አሮብ                                                                                                          ትርጉም:	ሙሽሪትን መውሰድ'
    },
    {
      'id': 742,
      'name': ' Koofaxa gacsa',
      'ንባብ':
          'ኮኦፍራክ  ጋሃሳ                                                                                                           ትርጉም:	መልስ'
    },
    {
      'id': 743,
      'name': 'Balla/Qarusso',
      'ንባብ':
          'ባልላ/ዓሩስሦ	                                                                                                           ትርጉም: ሠርገኛ'
    },
    {
      'id': 744,
      'name': ' Waradddi',
      'ንባብ':
          'ዋራድዲ                                                                                                           ትርጉም:	ከሙሽራ ወገን ሰርገኛ'
    },
    {
      'id': 745,
      'name': ' Kanaddi',
      'ንባብ':
          'ካናድዲ                                                                                                          ትርጉም:	ከሙሽሪት ወገን ሰርገኛ'
    },
    {
      'id': 746,
      'name': ' Cali',
      'ንባብ':
          'ሃሊ	                                                                                                          ትርጉም: የሰርግ አስተዋጾ'
    },
    {
      'id': 747,
      'name': ' Cabti',
      'ንባብ':
          'ሃብቲ	                                                                                                            ትርጉም: ፍቺ'
    },
    {
      'id': 748,
      'name': ' Aysuna/Aysinu',
      'ንባብ':
          'አይሱና（አይሱኑ）                                                                                                         ትርጉም:	ቅናት'
    },
    {
      'id': 749,
      'name': ' Raysa/Lafa/',
      'ንባብ':
          ' ራይሳ/ለፋ                                                                                                           ትርጉም:	ሬሳ'
    },
    {
      'id': 750,
      'name': ' Raysi kaqaylo',
      'ንባብ':
          'ራይሲ ከዓይሎ                                                                                                           ትርጉም:	ሬሳን ማጠብ'
    },
    {
      'id': 751,
      'name': ' Kafana',
      'ንባብ':
          'ከፋና                                                                                                           ትርጉም:	ከፈን'
    },
    {
      'id': 752,
      'name': 'Maagaqa',
      'ንባብ':
          'ማአጋዓ	                                                                                                         ትርጉም: ቀብር'
    },
    {
      'id': 753,
      'name': ' Maagaqa',
      'ንባብ':
          'ማአጋዓ ፊድሶ	                                                                                                         ትርጉም: ቀብር ስነስርዓት'
    },
    {
      'id': 754,
      'name': 'Fiddima fidso ',
      'ንባብ':
          'ፊድዲማ                                                                                                             ትርጉም: ፊድሶ	ለቅሶ'
    },
    {
      'id': 755,
      'name': ' Rabeyna',
      'ንባብ':
          'ራብይና                                                                                                           	ትርጉም: ተዝካር'
    },
    {
      'id': 756,
      'name': ' Kura',
      'ንባብ':
          'ኩራ                                                                                                          ትርጉም: 	የለቅሶ ጊዜ አስተዋጾ'
    },
    {
      'id': 757,
      'name': ' Gubna',
      'ንባብ':
          'ጉብና                                                                                                            ትርጉም:	ባል የሞተባት ሴት'
    },
    {
      'id': 758,
      'name': ' Agala',
      'ንባብ':
          'አጋላ                                                                                                          ትርጉም:	አንገል'
    },
    {
      'id': 759,
      'name': 'Qayxiixa ',
      'ንባብ':
          'ዓይዴድ                                                                                                          ትርጉም:	የቲሞች'
    },
    {
      'id': 760,
      'name': ' Nagra',
      'ንባብ':
          'ናግራ                                                                                                           ትርጉም:	ውርስ'
    },
    {
      'id': 761,
      'name': 'Buuke(booge) ',
      'ንባብ':
          'ቡኡኬ（ቦጌ）                                                                                                          ትርጉም:	ለቅሶ ማልቀስ'
    },
    {
      'id': 762,
      'name': 'Arka ',
      'ንባብ':
          'አርከ                                                                                                           ትርጉም:	ሐዘን'
    },
    {
      'id': 763,
      'name': 'Taqziyya ',
      'ንባብ':
          'ታዕዚይያ                                                                                                           ትርጉም:	ማፅናናት'
    },
    {
      'id': 764,
      'name': ' Ginaaza salaata',
      'ንባብ':
          '	ጊናዛ ሳላት                                                                                                           ትርጉም:	ፍታት'
    },
    {
      'id': 765,
      'name': ' Buqre',
      'ንባብ':
          'ቡዕሬ	                                                                                                          ትርጉም: ዕርሻ'
    },
    {
      'id': 766,
      'name': ' Gawra',
      'ንባብ':
          'ጋዕሬ                                                                                                         	ትርጉም:አዝመራ'
    },
    {
      'id': 767,
      'name': ' Xage',
      'ንባብ':
          'ዳጌ	                                                                                                         ትርጉም:ማሳ'
    },
    {
      'id': 768,
      'name': ' Baayuru',
      'ንባብ':
          'ባዮሩ	                                                                                                         ትርጉም:ቦይ'
    },
    {
      'id': 769,
      'name': ' Duuga/Dabiri/',
      'ንባብ':
          'ዱጋ /ዳቢሪ	                                                                                                           ትርጉም:ወሃ ማቆሪያ'
    },
    {
      'id': 770,
      'name': ' Saddi/bicsenkalu/',
      'ንባብ':
          'ሳዳዲ/ቢህሴንኩሉ                                                                                                          ትርጉም:	ግድብ'
    },
    {
      'id': 771,
      'name': 'Murti ',
      'ንባብ':
          'ሙርቲ                                                                                                          ትርጉም:	ምርት'
    },
    {
      'id': 772,
      'name': ' Buqraabe',
      'ንባብ':
          'ቡዕራቤ	                                                                                                          ትርጉም:ገበሬ'
    },
    {
      'id': 773,
      'name': ' Qabaara',
      'ንባብ':
          'ዓባራ	                                                                                                           ትርጉም:ድርቅ'
    },
    {
      'id': 774,
      'name': ' Leekora',
      'ንባብ':
          'ሌኮራ                                                                                                           ትርጉም:	ውሃ ማጥለቅለቅ'
    },
    {
      'id': 775,
      'name': ' Doolat buqre',
      'ንባብ':
          'ደላት ቡኡሬ                                                                                                          ትርጉም:	መንግስት እርሻ'
    },
    {
      'id': 776,
      'name': ' Egla buqre',
      'ንባብ':
          'ኤግላ ቡኡሬ                                                                                                          ትርጉም:	የማህበር እርሻ'
    },
    {
      'id': 777,
      'name': ' Cagay buqre',
      'ንባብ':
          'ሃጋይ ቡዕሬ	                                                                                                          ትርጉም: ማረስ ማለስለስ'
    },
    {
      'id': 778,
      'name': 'Kooqaaro ',
      'ንባብ':
          'ኮዓሮ	                                                                                                         ትርጉም: መዝራት'
    },
    {
      'id': 779,
      'name': ' Buqre mqnsoofa',
      'ንባብ':
          'ቡኡሬ ማንሶፋ                                                                                                          ትርጉም:	የ እርሻ መሳሪያዎች'
    },
    {
      'id': 780,
      'name': ' Murti orba',
      'ንባብ':
          'ሙርቲ ኦርባ	                                                                                                         ትርጉም: ምርት መሰብሰብ'
    },
    {
      'id': 781,
      'name': ' Riigi',
      'ንባብ':
          'ሪኢጊ                                                                                                          ትርጉም:	ጎተራ'
    },
    {
      'id': 782,
      'name': ' Sasnisa',
      'ንባብ':
          'ሳስኒሳ	                                                                                                         ትርጉም: ማዳበሪያ'
    },
    {
      'id': 783,
      'name': ' Dacarsitto',
      'ንባብ':
          'ዳሃርሲትቶ                                                                                                          ትርጉም:	አርብቶ አደርነት '
    },
    {
      'id': 784,
      'name': ' Saqa',
      'ንባብ':
          'ሳአ                                                                                                         	ትርጉም: ዕንስሳት'
    },
    {
      'id': 785,
      'name': ' Kalo',
      'ንባብ':
          'ካሎ	                                                                                                         ትርጉም: ለም መሬት'
    },
    {
      'id': 786,
      'name': ' Duwa/Dacara',
      'ንባብ':
          'ድውእ/ዳሃራ                                                                                                          ትርጉም:	ለግጦሽ ስምሪት'
    },
    {
      'id': 787,
      'name': ' Saqduwe',
      'ንባብ':
          'ሳዕዱዌ                                                                                                         	ትርጉም: እረኛ'
    },
    {
      'id': 788,
      'name': ' Aydorra',
      'ንባብ':
          'አይዶርራ                                                                                                          ትርጉም:	ማርባት'
    },
    {
      'id': 789,
      'name': ' Niyyayse',
      'ንባብ':
          '	ኒያይሴ                                                                                                         	ትርጉም: አራጅ'
    },
    {
      'id': 790,
      'name': ' Xiglo',
      'ንባብ':
          'ዲግሎ	                                                                                                         ትርጉም: ማለብ'
    },
    {
      'id': 791,
      'name': ' Ruko',
      'ንባብ':
          'ሩኮ	                                                                                                          ትርጉም: መናጥ'
    },
    {
      'id': 792,
      'name': ' Mutuku',
      'ንባብ':
          'ሙትኮ	                                                                                                         ትርጉም: ሌጋ ቅቤ'
    },
    {
      'id': 793,
      'name': ' Niyya',
      'ንባብ':
          'ኒይያ	                                                                                                            ትርጉም: ማረድ'
    },
    {
      'id': 794,
      'name': ' Akada',
      'ንባብ':
          'አክዳ	                                                                                                         ትርጉም: ልምላሜ'
    },
    {
      'id': 795,
      'name': ' Cayi',
      'ንባብ':
          'ሃይ	                                                                                                            ትርጉም: ጥጋብ'
    },
    {
      'id': 796,
      'name': ' awqenta',
      'ንባብ':
          'አውኤንተ                                                                                                           ትርጉም: 	ወጪ'
    },
    {
      'id': 797,
      'name': ' Kuuru',
      'ንባብ':
          'ኩኡሩ	                                                                                                            ትርጉም:  ኢንዱስትሪ'
    },
    {
      'id': 798,
      'name': ' Kuuriino',
      'ንባብ':
          'ኩሪኖ	                                                                                                           ትርጉም: እንድስትሪ ማስፋፋት'
    },
    {
      'id': 799,
      'name': ' xoooquh xiina',
      'ንባብ':
          'ዶዓህ ዲና	                                                                                                          ትርጉም:  ወዛደር'
    },
    {
      'id': 800,
      'name': ' Sandiika',
      'ንባብ':
          ' ሳንዲካ	                                                                                                         ትርጉም: ሰራተኛ ማህበር'
    },
    {
      'id': 801,
      'name': ' Mahandis',
      'ንባብ':
          'ማሃንዲሳ	                                                                                                         ትርጉም: ኢንጅነር'
    },
    {
      'id': 802,
      'name': ' Mattebannu',
      'ንባብ':
          'ማቴባንኑ                                                                                                          ትርጉም:	ቴክኒክ'
    },
    {
      'id': 803,
      'name': ' Kuurtiina',
      'ንባብ':
          'ኩርቲና                                                                                                          ትርጉም:	ፋብሪካ'
    },
    {
      'id': 804,
      'name': ' Mehrata',
      'ንባብ':
          'ሜህራታ	                                                                                                         ትርጉም:ሙያ'
    },
    {
      'id': 805,
      'name': ' Naggarinna',
      'ንባብ':
          'ናግጋሪና	                                                                                                          ትርጉም: የሞያ ብቃት'
    },
    {
      'id': 806,
      'name': ' Naggaara',
      'ንባብ':
          'ናግጋራ                                                                                                          ትርጉም:	ባለሙያ'
    },
    {
      'id': 807,
      'name': ' Qasin duyye',
      'ንባብ':
          'ዓሲን ዱያዬ                                                                                                          ትርጉም:	ጥሬ ዕቃ'
    },
    {
      'id': 808,
      'name': ' Robootu',
      'ንባብ':
          'ሮቦቱ                                                                                                         	ትርጉም: ሮቦት'
    },
    {
      'id': 809,
      'name': ' Garaaja',
      'ንባብ':
          'ጋራዝ	                                                                                                         ትርጉም:  ጋራዝ'
    },
    {
      'id': 810,
      'name': ' Gaaza',
      'ንባብ':
          'ጋዛ	                                                                                                         ትርጉም: ጋዝ'
    },
    {
      'id': 811,
      'name': ' Doolata',
      'ንባብ':
          'ዶአላታ	                                                                                                         ትርጉም: መንግስት'
    },
    {
      'id': 812,
      'name': ' Cokoomata',
      'ንባብ':
          'ሆኮኦማታ	                                                                                                         ትርጉም: መስተዳድር'
    },
    {
      'id': 812,
      'name': ' Agat miglisi',
      'ንባብ':
          'አጋት ሚግሊሲ                                                                                                          	 ትርጉም: ፓርላማ'
    },
    {
      'id': 813,
      'name': ' Doolat Madqa/Dastuuru',
      'ንባብ':
          'ዶላት ማድዓ/ዳስቱሩ                                                                                                           ትርጉም:	ሕገ መንግስት'
    },
    {
      'id': 814,
      'name': ' Malaaka',
      'ንባብ':
          'ማላካ	                                                                                                          ትርጉም: ሚኒስትር'
    },
    {
      'id': 815,
      'name': ' Malokti malaaka',
      'ንባብ':
          'ማሎክቲ ማላካ                                                                                                          ትርጉም:	ጠ/ሚኒስተር'
    },
    {
      'id': 816,
      'name': 'Malokti miglisi ',
      'ንባብ':
          'ማሎክቲ ሚግሊሲ	                                                                                                          ትርጉም: ሚኒስትሮች ም/ቤት'
    },
    {
      'id': 817,
      'name': 'Banoya ',
      'ንባብ':
          'ባይኖያ	                                                                                                           ትርጉም: ምክትል'
    },
    {
      'id': 818,
      'name': ' Duddo',
      'ንባብ':
          'ዱድዶ	                                                                                                          ትርጉም: ችሎት ብቃት'
    },
    {
      'id': 819,
      'name': ' muddaqiyannu',
      'ንባብ':
          'ሙድዳዒያንኑ                                                                                                          ትርጉም:	ሉአላዊነት'
    },
    {
      'id': 820,
      'name': ' Nagusu',
      'ንባብ':
          'ናጉሱ                                                                                                           ትርጉም:	ንጉስ'
    },
    {
      'id': 821,
      'name': ' Naguusannu',
      'ንባብ':
          'ናጉሳንኑ	                                                                                                          ትርጉም: ንጉሳዊ አገዛዝ'
    },
    {
      'id': 822,
      'name': ' Illata',
      'ንባብ':
          'ኢልላልታ	                                                                                                         ትርጉም: ንጉሰ ነገስት'
    },
    {
      'id': 823,
      'name': ' Illati',
      'ንባብ':
          'rasu	ኢልላልቲ ራሱ                                                                                                          ትርጉም:	የአፄ ግዛት'
    },
    {
      'id': 824,
      'name': ' Reeda',
      'ንባብ':
          'ሬዳ	                                                                                                           ትርጉም: ሹመት'
    },
    {
      'id': 825,
      'name': ' Ummuuno',
      'ንባብ':
          'ኡምሙኖ                                                                                                            ትርጉም:	ሪፐብሊክ'
    },
    {
      'id': 826,
      'name': ' Awlaytu',
      'ንባብ':
          'አውላይቱ	                                                                                                           ትርጉም: ተወካይ'
    },
    {
      'id': 827,
      'name': ' Faxteyna',
      'ንባብ':
          'ፍርቴይና                                                                                                           ትርጉም:	እጩ'
    },
    {
      'id': 828,
      'name': ' Adoyta',
      'ንባብ':
          'አዶይታ	                                                                                                            ትርጉም: አባል'
    },
    {
      'id': 829,
      'name': 'Madqiyya ',
      'ንባብ':
          'ሚድዒይያ	                                                                                                           ትርጉም: መወሰን'
    },
    {
      'id': 830,
      'name': ' Madqa tayyaqo',
      'ንባብ':
          'ማድዓ ታይያዖ                                                                                                          	ትርጉም: ሕግ አውጪ'
    },
    {
      'id': 831,
      'name': ' Madqa Arcisa',
      'ንባብ':
          'ማድዓ አርሂሳ                                                                                                           ትርጉም:	ሕግ አስፈፃሚ'
    },
    {
      'id': 832,
      'name': 'Madqaaloynisa ',
      'ንባብ':
          'ማድዓ ሎይኒሳ                                                                                                           ትርጉም:	ፍትህ አካላት'
    },
    {
      'id': 833,
      'name': ' Parti',
      'ንባብ':
          'ፓርቲ	                                                                                                            ትርጉም: ፓርቲ'
    },
    {
      'id': 834,
      'name': ' Kobxu',
      'ንባብ':
          'ኮቦሩ                                                                                                             ትርጉም:	ጉባኤ'
    },
    {
      'id': 835,
      'name': ' Daffeyna',
      'ንባብ':
          'ዳፍፈይና	                                                                                                           ትርጉም: ሰብሰባ'
    },
    {
      'id': 836,
      'name': ' Inayta',
      'ንባብ':
          'ኢናይታ                                                                                                             ትርጉም:	ማዕከል'
    },
    {
      'id': 837,
      'name': ' Ludda',
      'ንባብ':
          'ሉድዳ	                                                                                                            ትርጉም:  ቅርጫፍ'
    },
    {
      'id': 838,
      'name': ' Mugaaqisso',
      'ንባብ':
          'ሙግጋዒስሶ	                                                                                                           ትርጉም:  ምደባ'
    },
    {
      'id': 839,
      'name': ' Rakaakaya',
      'ንባብ':
          'ራካካያ	                                                                                                           ትርጉም: ክልል'
    },
    {
      'id': 840,
      'name': ' Rasu',
      'ንባብ':
          'ራሱ	                                                                                                            ትርጉም:  ዞን'
    },
    {
      'id': 841,
      'name': ' Hoxsiyya',
      'ንባብ':
          'ዳዓራ	                                                                                                           ትርጉም:  ወረዳ'
    },
    {
      'id': 842,
      'name': ' Awda',
      'ንባብ':
          'አውደእ	                                                                                                           ትርጉም:  ቀበሌ'
    },
    {
      'id': 843,
      'name': ' Makefta',
      'ንባብ':
          'ማኬፍታ                                                                                                           ትርጉም:	ሰፈር'
    },
    {
      'id': 844,
      'name': 'Poliisi ',
      'ንባብ':
          'ፖሊሲ	                                                                                                           ትርጉም:ፖሊስ'
    },
    {
      'id': 845,
      'name': ' casibi',
      'ንባብ':
          'ሃሲቢ	                                                                                                           ትርጉም:  እስር'
    },
    {
      'id': 846,
      'name': ' Casibi qari',
      'ንባብ':
          'ሃሲቢ አሪ	                                                                                                           ትርጉም:  እስር ቤት'
    },
    {
      'id': 847,
      'name': ' Baaxo baxa',
      'ንባብ':
          'ባዶበዳ	                                                                                                           ትርጉም:  ዜጋ'
    },
    {
      'id': 848,
      'name': ' Baaxo baxiinu',
      'ንባብ':
          'ባአሮብባሪኑ	                                                                                                           ትርጉም:  ዜግነት'
    },
    {
      'id': 849,
      'name': ' Magaala',
      'ንባብ':
          'ማጋአላ	                                                                                                           ትርጉም:  ከተማ'
    },
    {
      'id': 850,
      'name': ' Qalta',
      'ንባብ':
          'ዓልታ	                                                                                                           ትርጉም: ገጠር'
    },
    {
      'id': 851,
      'name': ' Kallaytu',
      'ንባብ':
          'ከልላይቱ	                                                                                                         ትርጉም:  ማዘጋጃ ቤት'
    },
    {
      'id': 852,
      'name': 'Mangaba/Mula ',
      'ንባብ':
          'ማንገባ/ሙላእ                                                                                                           ትርጉም:	አብላጫ'
    },
    {
      'id': 853,
      'name': ' Dago gaba',
      'ንባብ':
          'ዳጎ ጋባ	                                                                                                           ትርጉም: አናሳ'
    },
    {
      'id': 854,
      'name': ' Hilliki',
      'ንባብ':
          'ሂልሊኪ                                                                                                         	ትርጉም:  ተቃርኖ'
    },
    {
      'id': 855,
      'name': ' sadu',
      'ንባብ':
          'ሳዱ                                                                                                            ትርጉም:	ተቃራኒ'
    },
    {
      'id': 856,
      'name': ' Sadiinu',
      'ንባብ':
          'ሳዱኒ	                                                                                                          ትርጉም: ተቃውሞ'
    },
    {
      'id': 857,
      'name': ' Dadala',
      'ንባብ':
          'ዳዱሊ                                                                                                         	ትርጉም:  እድገት'
    },
    {
      'id': 858,
      'name': ' Wadirraqa',
      'ንባብ':
          'ዋዲርራዓ	                                                                                                           ትርጉም: ኋላ ቀርነት'
    },
    {
      'id': 859,
      'name': 'Amo baxxaqqa ',
      'ንባብ':
          'አሞባድዳዓ	                                                                                                           ትርጉም:  ነፃነት'
    },
    {
      'id': 860,
      'name': ' Ku amolayyo',
      'ንባብ':
          'ኳ ኦሞልአይዬ	                                                                                                         ትርጉም:  ቀኝ ግዛትነት'
    },
    {
      'id': 861,
      'name': ' Sahdaytiino',
      'ንባብ':
          'ሳህዳይቲኖ	                                                                                                         ትርጉም:  ሰብአዊነት'
    },
    {
      'id': 862,
      'name': ' Federaal xinto',
      'ንባብ':
          'ፌዴራሊኖ ዲንቶ                                                                                                          ትርጉም:	ፌደራሊዝም'
    },
    {
      'id': 863,
      'name': ' Inkaafa xinto',
      'ንባብ':
          'ኢንካአፋድዲንቶ	                                                                                                           ትርጉም: አሃዳዊነት'
    },
    {
      'id': 864,
      'name': ' Qalla',
      'ንባብ':
          'ዓልላ	ዝምድና፣                                                                                                           ትርጉም: ግንኙነት'
    },
    {
      'id': 865,
      'name': ' Diplomaasi qalla',
      'ንባብ':
          'ዲፕሎማሲ አልላ	                                                                                                         ትርጉም:  የዲፕሎማሲ ግንኙነት'
    },
    {
      'id': 866,
      'name': ' Safaarata',
      'ንባብ':
          'ሳፋራታ                                                                                                           ትርጉም:	ኤምባሲ'
    },
    {
      'id': 868,
      'name': ' Safiiri',
      'ንባብ':
          'ሳፍሪ	                                                                                                          ትርጉም: አምባሳደር'
    },
    {
      'id': 869,
      'name': ' Irga',
      'ንባብ':
          'ኢርጋ	                                                                                                         ትርጉም: ልኡክ'
    },
    {
      'id': 870,
      'name': ' Mablo',
      'ንባብ':
          'ማብሎ                                                                                                         	ትርጉም: ድርድር'
    },
    {
      'id': 871,
      'name': ' Kukta',
      'ንባብ':
          'ኩክታ	                                                                                                            ትርጉም:  አዋጅ'
    },
    {
      'id': 872,
      'name': ' Sirri/Cummi/',
      'ንባብ':
          'ሲርሪ                                                                                                           ትርጉም:	ምስጢር'
    },
    {
      'id': 873,
      'name': ' Taama soolo',
      'ንባብ':
          'ታማሰሶሎ                                                                                                           ትርጉም:	ስራ ማቆም'
    },
    {
      'id': 874,
      'name': ' Uluuluka',
      'ንባብ':
          'ኡሉሉካ                                                                                                              ትርጉም:  ሰላማዊ ሰልፍ'
    },
    {
      'id': 875,
      'name': ' Adaadarisso',
      'ንባብ':
          'አዳዳሪስሶ                                                                                                           ትርጉም:	ስቃይ'
    },
    {
      'id': 876,
      'name': ' Kataysiinu',
      'ንባብ':
          'ካታይሱኒ                                                                                                         	ትርጉም:  ጓደኝነት'
    },
    {
      'id': 877,
      'name': ' Hawi',
      'ንባብ':
          'ሃዊ	                                                                                                                      ትርጉም:   ወገናዊነት'
    },
    {
      'id': 878,
      'name': ' Qaxxaagite',
      'ንባብ':
          'ዓድዳጊቴ                                                                                                           ትርጉም:	አመልካች'
    },
    {
      'id': 879,
      'name': ' Hirrigiye',
      'ንባብ':
          'ሂሪግዬ	                                                                                                           ትርጉም:  ወግ አጥባቂ'
    },
    {
      'id': 880,
      'name': ' Amo kalti',
      'ንባብ':
          'አሞክካልቲ	                                                                                                         ትርጉም: የሞት ቅጣት'
    },
    {
      'id': 881,
      'name': ' Fannisiyya',
      'ንባብ':
          'ፋንኒሲይያ                                                                                                           ትርጉም:	ስቅላት'
    },
    {
      'id': 882,
      'name': 'Gaasisenta ',
      'ንባብ':
          'ጋዲስንታ	                                                                                                           ትርጉም: ቀጣይነት'
    },
    {
      'id': 883,
      'name': ' Fillat gaco',
      'ንባብ':
          'ፊልላት ጋሃ	                                                                                                           ትርጉም: ረዳት ማሳጣት'
    },
    {
      'id': 884,
      'name': ' Kaririqisso',
      'ንባብ':
          'ካሪሪኢሶ	                                                                                                          ትርጉም: አክራሪነት'
    },
    {
      'id': 885,
      'name': ' Makkoowiyya',
      'ንባብ':
          'ማከኮዊይያ                                                                                                           ትርጉም:	አፈንጋጭ'
    },
    {
      'id': 886,
      'name': ' Bodambood',
      'ንባብ':
          'ቦዳምቦኦድ                                                                                                           ትርጉም:	በአንድ ዓላማ የማይረጋ'
    },
    {
      'id': 887,
      'name': ' Garcabbaxa',
      'ንባብ':
          'ጋራ ሃብባራ                                                                                                          ትርጉም:	ድንገተኛ'
    },
    {
      'id': 888,
      'name': ' afqado',
      'ንባብ':
          'አፍ ዓዶ                                                                                                           ትርጉም:	ህልውና'
    },
    {
      'id': 889,
      'name': ' Aysisso',
      'ንባብ':
          'አይስሶ                                                                                                          ትርጉም:	መሻሻል'
    },
    {
      'id': 890,
      'name': ' Gacsiso',
      'ንባብ':
          'ጋህሲስሶ	                                                                                                            ትርጉም: መባባስ'
    },
    {
      'id': 891,
      'name': 'geedana/Giclo ',
      'ንባብ':
          'ጌዳና/ጊህሎ                                                                                                           ትርጉም:	ትግል'
    },
    {
      'id': 892,
      'name': ' Gaadu',
      'ንባብ':
          'ጋዱ                                                                                                            ትርጉም:	ዘመቻ'
    },
    {
      'id': 893,
      'name': ' Aydakaakana',
      'ንባብ':
          'አይዳካከና                                                                                                           ትርጉም:	ስልጠና'
    },
    {
      'id': 894,
      'name': ' Qaskariinoh aydakaakana',
      'ንባብ':
          'ዓስካሪኖህ አይዳካከና                                                                                                            ትርጉም:	ወታደራዊ ስልጠና '
    },
    {
      'id': 896,
      'name': ' Biiro',
      'ንባብ':
          'ቢሮ                                                                                                           ትርጉም:	ቢሮ'
    },
    {
      'id': 897,
      'name': ' Mirracsenta',
      'ንባብ':
          '	ሚራህስንታ                                                                                                           ትርጉም:	መምሪያ'
    },
    {
      'id': 898,
      'name': ' Isporti',
      'ንባብ':
          'ኢስፖርቲ                                                                                                            ትርጉም:	እስፖርት'
    },
    {
      'id': 899,
      'name': 'buxa ',
      'ንባብ':
          'በራ	                                                                                                             ትርጉም: ውድድር'
    },
    {
      'id': 900,
      'name': 'Ibi koqoso ',
      'ንባብ':
          'ኢቢ ኮዕሶ	                                                                                                            ትርጉም:  እግር ኳስ'
    },
    {
      'id': 901,
      'name': ' Gaba koqoso',
      'ንባብ':
          'ገባ ኮዕሶ	                                                                                                           ትርጉም: እጅ ኳስ'
    },
    {
      'id': 902,
      'name': ' kafaq koqoso',
      'ንባብ':
          'ካፋዕ ኮዕሶ                                                                                                           ትርጉም:	ቅርጫት ኳስ'
    },
    {
      'id': 903,
      'name': ' koqso',
      'ንባብ':
          'ኮዕሶ	                                                                                                           ትርጉም: ኳስ'
    },
    {
      'id': 904,
      'name': ' Arda',
      'ንባብ':
          'አርዳ	                                                                                                           ትርጉም: ሩጫ'
    },
    {
      'id': 905,
      'name': ' KAqo',
      'ንባብ':
          'ካዖ	                                                                                                           ትርጉም: ዝላይ'
    },
    {
      'id': 906,
      'name': ' Qambo',
      'ንባብ':
          'አምቦ                                                                                                           ትርጉም:	ውርወራ'
    },
    {
      'id': 907,
      'name': ' Giiru',
      'ንባብ':
          'ጊሩ	                                                                                                          ትርጉም: ዋና'
    },
    {
      'id': 908,
      'name': ' Cisaaba',
      'ንባብ':
          'ሂሳባ	                                                                                                           ትርጉም:  ሂሳብ'
    },
    {
      'id': 909,
      'name': 'osssa ',
      'ንባብ':
          'ኦስሳ	                                                                                                            ትርጉም: መደመር'
    },
    {
      'id': 910,
      'name': ' Kalta',
      'ንባብ':
          'ካልታ	                                                                                                         ትርጉም:  መቀነስ'
    },
    {
      'id': 911,
      'name': ' Atka',
      'ንባብ':
          'አትካ	                                                                                                           ትርጉም:  ማብዛት'
    },
    {
      'id': 912,
      'name': ' Kurta',
      'ንባብ':
          'ኩርታ	                                                                                                         ትርጉም:  ማካፈል'
    },
    {
      'id': 913,
      'name': ' Ixxu',
      'ንባብ':
          'ኢድዱ	                                                                                                         ትርጉም:  ቁጥር'
    },
    {
      'id': 914,
      'name': ' Ixxima',
      'ንባብ':
          'ኢድድማ                                                                                                            ትርጉም:	አሃዝ'
    },
    {
      'id': 915,
      'name': ' Maxca maafo',
      'ንባብ':
          'መድሃምማፎ	                                                                                                           ትርጉም:  ዐረፍተነገር'
    },
    {
      'id': 916,
      'name': ' Digloytah ixxima',
      'ንባብ':
          '	ዲግሎይታህ ኢድዲማ	                                                                                                           ትርጉም: ክፍልፋይ'
    },
    {
      'id': 917,
      'name': ' Caddoh Ixxima',
      'ንባብ':
          'ሃዶህኢድድማ	                                                                                                         ትርጉም:  ደረጃ'
    },
    {
      'id': 918,
      'name': ' culenta',
      'ንባብ':
          'ሁለንታ                                                                                                           ትርጉም:	ገቢ'
    },
    {
      'id': 919,
      'name': ' Ramidi',
      'ንባብ':
          'ራሚዲ	                                                                                                          ትርጉም: ስር'
    },
    {
      'id': 920,
      'name': ' Daaba',
      'ንባብ':
          'ዳባ	                                                                                                            ትርጉም:  ግንድ'
    },
    {
      'id': 921,
      'name': 'Agat culenta ',
      'ንባብ':
          'አጋት ሁለንታ	                                                                                                           ትርጉም:  ብሄራዊ ገቢ'
    },
    {
      'id': 922,
      'name': ' Ayyufta',
      'ንባብ':
          'አይዮፋታ                                                                                                           ትርጉም:	ቅጠል'
    },
    {
      'id': 923,
      'name': ' Qoborta',
      'ንባብ':
          'ዖቦርታ                                                                                                           ትርጉም:	አበባ'
    },
    {
      'id': 924,
      'name': ' Mixaxu',
      'ንባብ':
          'ሚራሩ	                                                                                                           ትርጉም:ፍሬ'
    },
    {
      'id': 925,
      'name': ' Gaydu',
      'ንባብ':
          'ጋይዱ	                                                                                                              ትርጉም:ጥሬ'
    },
    {
      'id': 926,
      'name': ' cubbuso',
      'ንባብ':
          'ሁብቡሶ	                                                                                                           ትርጉም:ጥናት'
    },
    {
      'id': 927,
      'name': ' Baddafa',
      'ንባብ':
          'ባዳድፋ	                                                                                                            ትርጉም:ባህር ጠረፍ'
    },
    {
      'id': 928,
      'name': ' Baddiita',
      'ንባብ':
          'ባዳዲታ	                                                                                                           ትርጉም:ንፋስ（ከ ባህር ወደ የብስ）'
    },
    {
      'id': 929,
      'name': ' Barriita',
      'ንባብ':
          'ባርሪታ	                                                                                                            ትርጉም:ንፋስ（ከ  የብስ ወደ ባህር）'
    },
    {
      'id': 930,
      'name': 'Gadiri ',
      'ንባብ':
          'ጋዳሪ	                                                                                                               ትርጉም:ደሴት'
    },
    {
      'id': 931,
      'name': ' Kaddi',
      'ንባብ':
          'ካድዲ	                                                                                                                ትርጉም:የባህር ወሽመጥ'
    },
    {
      'id': 932,
      'name': ' Baddi caraata',
      'ንባብ':
          'በድዲ ሃራታ	                                                                                                           ትርጉም: የባህር ሰላጤ'
    },
    {
      'id': 933,
      'name': ' Gayya',
      'ንባብ':
          'ጋይያ                                                                                                               ትርጉም:	ጥልቀት（የባህር）'
    },
    {
      'id': 934,
      'name': ' Qira',
      'ንባብ':
          'ዒራ	                                                                                                            ትርጉም:  ጥልቀት የ ሌለው（ለባህር）'
    },
    {
      'id': 935,
      'name': ' Haffo',
      'ንባብ':
          'ሃፍፎ	                                                                                                              ትርጉም: የ ባህር ሞገድ'
    },
    {
      'id': 936,
      'name': ' Lelwa',
      'ንባብ':
          'ሌልዋ	                                                                                                             ትርጉም: የውሃ አካል'
    },
    {
      'id': 937,
      'name': ' Galaaca',
      'ንባብ':
          'ጋላሃ                                                                                                           ትርጉም:	ጨው የሌለው ውሃ'
    },
    {
      'id': 938,
      'name': ' Coboyu',
      'ንባብ':
          'ሆቦዩ	                                                                                                         ትርጉም:  የዝናብ ውሃ '
    },
    {
      'id': 939,
      'name': 'Daraqa ',
      'ንባብ':
          'ዳራዓ	                                                                                                         ትርጉም:  ድፍርስ ውሃ'
    },
    {
      'id': 940,
      'name': ' Badliita',
      'ንባብ':
          'ባድሊታ                                                                                                            ትርጉም:	ጨዋማ ውሃ '
    },
    {
      'id': 941,
      'name': ' Caro',
      'ንባብ':
          'ሃሮ	                                                                                                           ትርጉም: ቅራሪ ውሃ'
    },
    {
      'id': 942,
      'name': ' Dara',
      'ንባብ':
          'ዳራአ                                                                                                             ትርጉም:	ምንጭ'
    },
    {
      'id': 943,
      'name': ' Buyyi',
      'ንባብ':
          'ቡድሊታ                                                                                                           ትርጉም:	ጭሮሽ'
    },
    {
      'id': 944,
      'name': ' Muude',
      'ንባብ':
          '	ሙዴ	                                                                                                           ትርጉም: የውሃ ገንዳ'
    },
    {
      'id': 945,
      'name': ' Qeela',
      'ንባብ':
          'ዓኤላ	                                                                                                            ትርጉም:  የውሃ ጉድጓድ'
    },
    {
      'id': 946,
      'name': ' Boynalle',
      'ንባብ':
          'ቦይናሌ                                                                                                           ትርጉም:	የ እንፋሎት ውሃ'
    },
    {
      'id': 947,
      'name': 'Maaqoh/Daro ',
      'ንባብ':
          '	ማዖ/ዳሮ                                                                                                            ትርጉም:	ምግብ ፣እህል'
    },
    {
      'id': 948,
      'name': ' Ambo',
      'ንባብ':
          'አምቦ	                                                                                                         ትርጉም:  ጥሬ'
    },
    {
      'id': 949,
      'name': ' Diglu',
      'ንባብ':
          'ዲግሉ                                                                                                           ትርጉም:	ክርክር፣ክክ'
    },
    {
      'id': 950,
      'name': ' Unduru/qagina',
      'ንባብ':
          '	ኡንድሩ/ዓጊና                                                                                                           ትርጉም:	ሊጥ'
    },
    {
      'id': 951,
      'name': ' Muufeyta',
      'ንባብ':
          'ሙፈይታ                                                                                                           ትርጉም:	የጉድጓድ ዳቦ'
    },
    {
      'id': 952,
      'name': ' Buuqeyta',
      'ንባብ':
          'ቡኤይታ                                                                                                           ትርጉም:	ተቦክቶ የተጋገረ '
    },
    {
      'id': 953,
      'name': ' Naadiita',
      'ንባብ':
          'ናዲታ	                                                                                                           ትርጉም:ሳይቦካ የተጋገረ'
    },
    {
      'id': 954,
      'name': ' Luclucu',
      'ንባብ':
          'ሉህሉህ	                                                                                                           ትርጉም:እንጀራ'
    },
    {
      'id': 955,
      'name': ' Eceyya',
      'ንባብ':
          'ኤሄይያ	                                                                                                           ትርጉም:ወፍጮ'
    },
    {
      'id': 956,
      'name': ' Riyo',
      'ንባብ':
          'ሪዮ	                                                                                                                ትርጉም:መፍጨት'
    },
    {
      'id': 957,
      'name': ' Gida',
      'ንባብ':
          'ጊዳ	                                                                                                                 ትርጉም:እርግዝና'
    },
    {
      'id': 958,
      'name': 'Mayanagali/Wasakatu ',
      'ንባብ':
          'መያንገሊ/ወስክቱ	                                                                                                           ትርጉም:  የወር አበባ'
    },
    {
      'id': 959,
      'name': ' Luwaata',
      'ንባብ':
          'ሉዋታ                                                                                                            ትርጉም:	ማቅለሽለሽ'
    },
    {
      'id': 960,
      'name': ' Soonibiinu',
      'ንባብ':
          'ሶንቢኑ	                                                                                                           ትርጉም: እርግዝና'
    },
    {
      'id': 961,
      'name': ' Dabbaqaana/Lacawa',
      'ንባብ':
          'ዳበበዓና/ለሃዋ	                                                                                                           ትርጉም:  ምጥ'
    },
    {
      'id': 962,
      'name': ' Xalaaya',
      'ንባብ':
          'ዳላያ	                                                                                                           ትርጉም: መውለድ'
    },
    {
      'id': 963,
      'name': ' Ulla',
      'ንባብ':
          'ኡልላ	                                                                                                           ትርጉም: አራስ'
    },
    {
      'id': 964,
      'name': ' Alqiina',
      'ንባብ':
          'አልዒኢና	                                                                                                          ትርጉም:  የልጅ እናት'
    },
    {
      'id': 965,
      'name': ' Monititar',
      'ንባብ':
          'ሞኒተር                                                                                                           ትርጉም:	ሞኒተር'
    },
    {
      'id': 966,
      'name': ' qasirgacsa',
      'ንባብ':
          'አሲርገህሳ                                                                                                           ትርጉም:	ክለሳ'
    },
    {
      'id': 967,
      'name': ' Digiriiri',
      'ንባብ':
          'በንዲራ ሳሬ                                                                                                           ትርጉም:	የሰንደቃ ዓላማ መዝሙር'
    },
    {
      'id': 968,
      'name': ' Qasbi',
      'ንባብ':
          'ዓስቢ	                                                                                                           ትርጉም: ደመወዝ'
    },
    {
      'id': 969,
      'name': ' maali siira',
      'ንባብ':
          'ማሊ ሲራ                                                                                                           ትርጉም:	የገንዘብ ስርዓት'
    },
    {
      'id': 970,
      'name': ' cali',
      'ንባብ':
          'ሃሊ	                                                                                                          ትርጉም:  አስተዋጽኦ'
    },
    {
      'id': 971,
      'name': ' qarsa',
      'ንባብ':
          'አርሳ                                                                                                           ትርጉም:	ግንባር(የጦር)'
    },
    {
      'id': 972,
      'name': ' mudumu',
      'ንባብ':
          'ሙዱሙ	                                                                                                          ትርጉም:  መቁሰል'
    },
    {
      'id': 973,
      'name': ' lee',
      'ንባብ':
          'ሌኤ	                                                                                                         ትርጉም:  ውሃ'
    },
    {
      'id': 974,
      'name': ' Ifu',
      'ንባብ':
          'ኢፉ                                                                                                           ትርጉም:	ጮራ/ብርሃን'
    },
    {
      'id': 975,
      'name': ' bara',
      'ንባብ':
          'ባራ                                                                                                           ትርጉም:	ሌሊት'
    },
    {
      'id': 976,
      'name': 'bara ',
      'ንባብ':
          'ባራ	                                                                                                           ትርጉም:ሌሊት'
    },
    {
      'id': 977,
      'name': 'kaniisa ',
      'ንባብ':
          'ካኒኢሳ                                                                                                           ትርጉም:  ቤተክርስቲያን '
    },
    {'id': 978, 'name': ' bara', 'ንባብ': 'ባራ  ትርጉም:	ሌሊት'},
    {
      'id': 979,
      'name': ' koqso booxa',
      'ንባብ':
          'ኮዕሶኦ ቦኦራ                                                                                                           ትርጉም:	ኳስ ሜዳ'
    },
    {'id': 980, 'name': ' maglaba', 'ንባብ': 'ማግላባ  ትርጉም:	ድርሻ'},
    {
      'id': 981,
      'name': ' booltah ixxima',
      'ንባብ':
          '	ቦልታህ ኢድዲማ	                                                                                                           ትርጉም: ፐርሰንት'
    },
    {
      'id': 982,
      'name': ' ximmoytha ixxima',
      'ንባብ':
          'ድምሞይታህ ኢድዲማ	                                                                                                         ትርጉም:  መቶኛ/ዴሲማል'
    },
    {'id': 983, 'name': ' baxa`a', 'ንባብ': 'በራእ  ትርጉም:	ሴት ልጅ'},
    {
      'id': 984,
      'name': 'tobokoyt`a ',
      'ንባብ':
          'ቶቦኮይታእ                                                                                                           ትርጉም:	አጎት/ከ አባት በኩል'
    },
    {
      'id': 985,
      'name': ' qari makiina',
      'ንባብ':
          'ዓሪ                                                                                                            ትርጉም:  መኪና	የጭነት መኪና'
    },
    {
      'id': 986,
      'name': ' cali',
      'ንባብ':
          'ሓሊ                                                                                                           ትርጉም:	አስተዋጾ'
    },
    {
      'id': 987,
      'name': ' Lakqo qadaaga',
      'ንባብ':
          'ላክዖ አዳጋ                                                                                                           ትርጉም:	የብር ገበያ'
    },
    {
      'id': 988,
      'name': ' Briita qadaaga',
      'ንባብ':
          'ቢሪታ አዳጋ                                                                                                           	ብረታ ብረት ገበያ'
    },
    {
      'id': 989,
      'name': ' gabbi carra',
      'ንባብ':
          'ጋብቢ ሓርራ                                                                                                           ትርጉም:	ደቡብ ምዕራብ'
    },
    {
      'id': 990,
      'name': ' Islaam',
      'ንባብ':
          'ኢስላም                                                                                                           ትርጉም:	እስልምና'
    },
    {
      'id': 991,
      'name': ' korosu',
      'ንባብ':
          'ኮሮሱ                                                                                                           ትርጉም:	ክርስትና'
    },
    {
      'id': 992,
      'name': ' xaagu tatruse',
      'ንባብ':
          'ዳጉ ታትሩሴ                                                                                                           ትርጉም:	ዜና አንባቢ'
    },
    {
      'id': 993,
      'name': ' koraanna',
      'ንባብ':
          'ኮራአና                                                                                                           ትርጉም:	ኤሌክትሪክ'
    },
    {
      'id': 994,
      'name': 'makkoowiyya',
      'ንባብ':
          '	ማክኮዊይያ                                                                                                         ትርጉም:	ማፈንገጥ '
    },
  ];
  List<Map<String, dynamic>> _foundWords = [];
  @override
  void initState() {
    // TODO: implement initState
    super.initState();
    _foundWords = _allWords;
  }

  void _filter(String key) {
    List<Map<String, dynamic>> results = [];
    if (key.isEmpty) {
      results = _allWords;
    } else {
      results = _allWords
          .where((element) =>
              element['name'].toLowerCase().contains(key.toLowerCase()))
          .toList();
    }
    setState(() {
      _foundWords = results;
    });
  }

  @override
  Widget build(BuildContext context) {
    // Map<String, dynamic> word=_allWords[index];
    //bool isSaved=savedWords.contains(_allWords);
    return Scaffold(
        backgroundColor: Colors.white,
        appBar: AppBar(
          title: Text('በአፋርኛ በመፃፍ ይፈልጉ'),
          centerTitle: true,
          actions: [
            Theme(
              data: Theme.of(context).copyWith(
                dividerColor: Colors.white,
                iconTheme: IconThemeData(color: Colors.white),
                textTheme: TextTheme().apply(bodyColor: Colors.white),
              ),
              child: PopupMenuButton<int>(
                color: Colors.indigo,
                onSelected: (item) => onSelected(context, item),
                itemBuilder: (context) => [
                  PopupMenuItem<int>(
                    value: 0,
                    child: Text('በአማርኛ ይፈልጉ'),
                  ),
                  PopupMenuItem<int>(
                    value: 1,
                    child: Text('afarigna search'),
                  ),
                ],
              ),
            ),
          ],
        ),
        body: Padding(
          padding: const EdgeInsets.all(15.0),
          child: Column(
            children: [
              TextField(
                onChanged: (value) => _filter(value),
                cursorColor: Colors.white,
                decoration: const InputDecoration(
                    labelText: 'Search...',
                    labelStyle: TextStyle(
                        color: Colors.black,
                        letterSpacing: 3,
                        fontWeight: FontWeight.bold,
                        fontSize: 17),
                    suffixIcon: Icon(
                      Icons.search,
                      color: Colors.black,
                    ),
                    icon: Icon(
                      Icons.list,
                      color: Colors.black,
                    )),
              ),
              const SizedBox(
                height: 5,
              ),
              Expanded(
                  child: _foundWords.isNotEmpty
                      ? ListView.builder(
                          itemCount: _foundWords.length,
                          itemBuilder: (context, index) {
                            return Card(
                              key: ValueKey(_foundWords[index]['id']),
                              color: Colors.lightBlueAccent.shade200,
                              elevation: 4,
                              margin: const EdgeInsets.symmetric(vertical: 10),
                              child: ListTile(
                                leading: FavoriteButton(
                                  isFavorite: false,
                                  iconSize: 10,
                                  // iconDisabledColor: Colors.white,
                                  valueChanged: (_isFavorite) {
                                    print('Is Favorite : $_isFavorite');
                                  },
                                ),
                                title: Text(
                                  _foundWords[index]['name'],
                                  style: const TextStyle(
                                      fontWeight: FontWeight.bold,
                                      letterSpacing: 1,
                                      color: Colors.black,
                                      fontSize: 18),
                                ),
                                subtitle: Text(_foundWords[index]['ንባብ'],
                                    style: const TextStyle(
                                        fontWeight: FontWeight.bold,
                                        letterSpacing: 1,
                                        color: Colors.black,
                                        fontSize: 16)),
                                trailing: Text(
                                    _allWords[index]['id'].toString(),
                                    style: const TextStyle(
                                        fontWeight: FontWeight.bold,
                                        letterSpacing: 1,
                                        color: Colors.black,
                                        fontSize: 15,
                                        backgroundColor: Colors.white)),
                              ),
                            );
                          })
                      : const Center(
                          child: Text('ተመሳሳይ ቃል አልተገኘም'),
                        ))
            ],
          ),
        ));
  }

  void onSelected(BuildContext context, int item) {
    switch (item) {
      case 0:
        Navigator.of(context).push(
          MaterialPageRoute(builder: (context) => amharicsearch()),
        );
        break;
      case 1:
        Navigator.of(context).push(
          MaterialPageRoute(builder: (context) => HomePage()),
        );
      //   break;
      // case 2:
      //   Navigator.of(context).pushAndRemoveUntil(
      //     MaterialPageRoute(builder: (context) => LoginPage()),
      //     (route) => false,
      //   );
    }
  }
}
